Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: In case you want to go back to the initial state of ticket notifications, you can click on **Reset to default** button.
de: Wenn Sie zur Standardkonfiguration der Ticketbenachrichtigungen zurückkehren möchten, können Sie auf die Schaltfläche **Standardwerte wiederherstellen** klicken.
sr: У случају да желите да се вратите на почетно стање обавештења о тикету, можете да кликнете на дугме **Поништи вредности**.

source: Duplicate Detection
de: Duplikaterkennung
sr: Откривање дупликата

source: Detect Duplicate Ticket Creation
de: Ticket Duplikaterkennung
sr: Откривање дупликата тикета приликом отварања

source: This setting turns on the duplicate ticket detection mechanism during ticket creation. If similar tickets are found in the system, a suitable warning will be shown to the user trying to create a ticket.
de: Diese Einstellung schaltet den Mechanismus zur Erkennung von doppelten Tickets ein. Wenn ähnliche Tickets im System gefunden werden, wird dem Benutzer, der versucht, ein Ticket zu erstellen, eine entsprechende Warnung angezeigt.
sr: Ово подешавање укључује механизам за откривање дупликата тикета током отварања тикета. Ако се пронађу слични тикети у систему, кориснику који покушава да отвори нови тикет биће приказано одговарајуће упозорење.

source: A Sample Duplicate Ticket Warning
de: Ein Beispiel für eine Warnung zu doppelten Tickets
sr: Пример упозорења о дупликату тикета

source: You can choose which ticket attributes will be matched by selecting them in **Attributes to compare** field. Only if the ticket attribute value provided by the user in the ticket create form is *equal* with the attribute in an existing ticket, the warning will be shown.
de: Sie können wählen, welche Ticketattribute abgeglichen werden sollen, indem Sie diese im Feld **Attribute, die zu vergleichen sind** auswählen. Die Duplikat-Warnung wird nur angezeigt, wenn die Werte der Ticketattribute in mehreren Tickets *gleich* sind.
sr: Можете да изаберете који атрибути тикета треба да се подударају тако што ћете их изабрати у пољу **Атрибути за поређење**. Само ако је вредност атрибута тикета које је корисник навео у обрасцу за отварање новог тикета *једнака* са атрибутом постојећег тикета, упозорење ће бити приказано.

source: **Warning title** and **Warning message** are configurable as well.
de: **Warnungstitel** und **Warnmeldung** sind ebenfalls konfigurierbar.
sr: **Наслов упозорења** и **Порука упозорења** се такође могу подесити.

source: You can limit the detection only to certain user roles. By default, only agents will see the warning.
de: Sie können die Erkennung auf bestimmte Benutzerrollen beschränken. Standardmäßig wird die Warnung nur für Agenten angezeigt.
sr: Откривање можете ограничити само на одређене корисничке улоге. Подразумевано, само оператери ће видети упозорење.

source: If you don't want to show the matched tickets as part of the warning, you can set **Show matching ticket(s) in the warning** setting to *no*.
de: Wenn Sie die passenden Tickets nicht als Teil der Warnung anzeigen möchten, können Sie die Einstellung **Zeige passende(s) Ticket(s) in der Warnung** auf *nein* setzen.
sr: Ако не желите да прикажете пронађене тикете као део упозорења, можете да подесите **Прикажи сличне тикете као део упозорења** на *не*.

source: By default, **Permission level for looking up ticket** is set to *User*, which means user permissions will be honored during sarch. The user will see the warning only if tickets they have access to are matched. Alternatively, you can set this setting to *System*, in which case the search will happen within *all* tickets in the system, regardless of user permissions.
de: Standardmäßig ist **Berechtigungsstufe für Ticket-Suchvorgänge** auf *Benutzer* eingestellt. Das bedeutet, dass die Benutzerrechte bei der Suche beachtet werden. Der Benutzer sieht die Warnung nur, wenn Tickets, auf die er Zugriff hat, übereinstimmen. Alternativ können Sie diese Einstellung auf *System* setzen. In diesem Fall wird die Suche in *allen* Tickets im System durchgeführt, unabhängig von den Benutzerrechten.
sr: Подразумевано, **Ниво дозвола при претраживању тикета** је подешен на *Корисник*, што значи да ће се корисничке дозволе поштовати током претраге. Корисник ће видети упозорење само ако се подударају тикети којима има приступ. Алтернативно, можете поставити ово подешавање на *Систем*, у ком случају ће се претрага одвијати унутар *свих* тикета у систему, без обзира на корисничке дозволе.

source: **🦺 Safety first!**
de: **🦺 Sicherheit geht vor!**
sr: **🦺 Безбедност на првом месту!**

source: Even if the permission level is set to *System*, the user will not be shown the tickets they don't have access to in the warning, even if they match.
de: Auch wenn die Berechtigungsstufe auf *System* eingestellt ist, werden dem Benutzer die Tickets, auf die er keinen Zugriff hat, in der Warnung nicht angezeigt, selbst wenn sie übereinstimmen.
sr: Чак и ако је ниво дозволе постављен на *Систем*, кориснику неће бити приказани тикети којима нема приступ у упозорењу, чак и ако се подударају.

source: However, just the confirmation about the existence of the tickets in the system may be considered an unwanted information disclosure. Use this option carefully!
de: Die bloße Bestätigung über die Existenz der Tickets im System kann jedoch als unerwünschte Weitergabe von Informationen angesehen werden. Verwenden Sie diese Option mit Vorsicht!
sr: Међутим, сама потврда о постојању тикета у систему може се сматрати нежељеном информацијом. Користите ову опцију пажљиво!

source: Finally, you can configure between matching within **All tickets** or **Open tickets** only by setting **Match tickets in following states**. Depending on the current ticket state, a ticket may or not be matched.
de: Schließlich können Sie festlegen, ob der Abgleich nur für **Alle Tickets** oder nur für **Offene Tickets** erfolgen soll, indem Sie **Vergleiche Tickets in folgenden Status** einstellen. Je nach aktuellem Ticketstatus erfolgt die Prüfung oder nicht.
sr: Коначно, можете да подесите **Претражи тикете у следећим стањима** на **Сви тикети** или **Отворени тикети**. У зависности од тренутног стања тикета, тикет ће бити узет у обзир.

source: Core workflows allow you to adjust object attributes in many ways. For example:
de: Mit Core Workflows können Sie Objektattribute auf vielfältige Weise anpassen. Zum Beispiel:

source: Show and hide fields
de: Felder ein- und ausblenden

source: Adjust if fields are mandatory or not
de: Pflichtfelder anpassen

source: Set available options for select fields
de: Verfügbare Optionen für Auswahlfelder festlegen

source: This allows you to provide exactly the information that your users really need.
de: So können Sie genau die Informationen anzeigen, die Ihre Benutzer wirklich benötigen.

source: If the pre-defined :doc:`object attributes</system/objects>` are not enough, please add custom object attributes first.
de: Wenn die vordefinierten :doc:`Objektattribute</system/objects>` nicht ausreichen, fügen Sie bitte zunächst benutzerdefinierte Objektattribute hinzu.

source: If you experience slow or unreliable field updates, please see :ref:`Core Workflow Ajax Modus <core-workflow-ajax-mode>`
de: Wenn Sie langsame oder unzuverlässige Feldaktualisierungen feststellen, lesen Sie bitte :ref:`Core Workflow Ajax Modus <core-workflow-ajax-mode>`
sr: Ако имате спора или непоуздана освежавања на терену, погледајте :ref:`Ajax режим радног тока <core-workflow-ajax-mode>`.

source: This is a very enhanced functionality and can cause unexpected UI behavior. Please ensure to test your use cases after configuration to reduce surprises.
de: Dies ist eine sehr mächtige Funktionalität und kann zu unerwartetem Verhalten der Benutzeroberfläche führen. Bitte stellen Sie sicher, dass Sie Ihre Anwendungsfälle nach der Konfiguration testen, um Überraschungen zu vermeiden.
sr: Ово је напредна функција и може изазвати неочекивано понашање корисничког интерфејса. Обавезно тестирајте своје случајеве коришћења након подешавања да бисте смањили изненађења.

source: Core Workflow Condition Operators
de: Core Workflow Bedingungsoperatoren
sr: Оператори услова радних токова

source: You might know that there is a separate section for explaining :doc:`condition operators </misc/object-conditions/basics>`. Head over there to see a detailed explanation of many conditions and operators.
de: Sie wissen vielleicht, dass es einen separaten Bereich zur Erläuterung von :doc:`Bedingungsoperatoren </misc/object-conditions/basics>` gibt. Dort finden Sie eine detaillierte Erklärung vieler Bedingungen und Operatoren.
sr: Можда сте свесни да постоји посебан одељак који објашњава :doc:`операторе услова </misc/object-conditions/basics>`. Тамо можете пронаћи детаљна објашњења за многе услове и операторе.

source: Due to differences to other places in Zammad which are also using conditions (e.g. triggers), you can find a dedicated description of operators for core workflows below.
de: Aufgrund von Unterschieden zu anderen Bereichen in Zammad, die ebenfalls Bedingungen verwenden (z.B. Trigger) , finden Sie weiter unten eine Beschreibung der Operatoren speziell für Core-Workflows.
sr: Услед разлика са другим областима Zammad-а које такође користи услове (нпр. окидачи), испод можете пронаћи објашњење посвећено операторима радних токова.

source: Be aware that the availability of the operators depends on the selected attribute and its field type. Some of the operators may only be available for system attributes (e.g. for "tags", "active").
de: Beachten Sie, dass die Verfügbarkeit der Operatoren von dem ausgewählten Attribut und seinem Feldtyp abhängt. Einige der Operatoren sind möglicherweise nur für Systemattribute verfügbar (z.B. für "Tags", "Aktiv").
sr: Обратите пажњу да доступност оператора зависи од одабраних атрибута и типа поља. Неки од оператора могу бити доступни само за системске атрибуте (нпр. за „Ознаке”, „Активно”).

source: after (absolute)
de: nach (absolut)
sr: након (апсолутно)

source: Matches if a date/time is after a specific point in time.
de: Trifft zu, wenn ein Datum/Uhrzeit nach einem definierten Zeitpunkt liegt.
sr: Подудара се ако је датум/време након одређеног тренутка.

source: after (relative)
de: nach (relativ)
sr: након (релативно)

source: Matches if a time span after a specified event has passed.
de: Trifft zu, wenn eine Zeitspanne nach einem bestimmten Ereignis vergangen ist.
sr: Подудара се ако је временски оквир прошао након одређеног догађаја.

source: before (absolute)
de: vor (absolut)
sr: пре (апсолутно)

source: Matches if a date/time is before a specific point in time.
de: Trifft zu, wenn ein Datum/Uhrzeit vor einem definierten Zeitpunkt liegt.
sr: Подудара се ако је време/датум пре одређеног тренутка.

source: before (relative)
de: vor (relativ)
sr: пре (релативно)

source: Matches if a time span after a specified event has not passed.
de: Trifft zu während einer definierten Zeitspanne nach einem Ereignis.
sr: Подудара се ако временски оквир након одређеног догађаја није прошао.

source: contains
de: enthält
sr: садржи

source: Matches if a specified value is present.
de: Trifft zu, wenn ein definierter Wert vorhanden ist.
sr: Подудара се ако одређена вредност постоји.

source: Matches if all of the specified values are present.
de: Trifft zu, wenn alle definierten Werte vorhanden sind.
sr: Подудара се ако све дате вредности постоје.

source: Matches if none of the specified values are present.
de: Trifft zu, wenn keiner der definierten Werte vorhanden ist.
sr: Подудара се ако ниједна од датих вредности не постоји.

source: contains not
de: enthält nicht
sr: не садржи

source: Matches if a specified value is not present.
de: Trifft zu, wenn ein definierter Wert nicht vorhanden ist.
sr: Подудара се ако дата вредност не постоји.

source: Matches if one specified value is present.
de: Trifft zu, wenn ein definierter Wert vorhanden ist.
sr: Подудара се ако једна дата вредност постоји.

source: Matches if one specified value is not present.
de: Trifft zu, wenn ein definierter Wert nicht vorhanden ist.
sr: Подудара се ако једна дата вредност не постоји.

source: does not match regex
de: passt nicht auf regex
sr: не задовољава регуларни израз

source: Matches if content doesn't fit to regex rule.
de: Trifft zu, wenn der Inhalt nicht der Regex-Regel entspricht.
sr: Подудара се ако се садржај не поклапа са регуларним изразом.

source: ends with
de: endet auf
sr: завршава се са

source: Matches if content ends with specified value.
de: Trifft zu, wenn der Inhalt mit dem definierten Wert endet.
sr: Подудара се ако се садржај завршава са датом вредности.

source: ends with one of
de: endet auf eins von
sr: завршава се са једним од

source: Matches if content ends with one of the specified values.
de: Trifft zu, wenn der Inhalt mit einem der definierten Werte endet.
sr: Подудара се ако се садржај завршава са једном од датих вредности.

source: from (relative)
de: von vor (relativ)
sr: од (релативно)

source: Matches if date/time is after a period of time after an event.
de: Trifft zu, wenn Datum/Uhrzeit nach einer definierten Zeitspanne nach einem Ereignis liegen.
sr: Подудара се ако је датум/време након датог периода после догађаја.

source: Matches if content is equal to a specified value.
de: Trifft zu, wenn der Inhalt gleich dem definierten Wert ist.
sr: Подудара се ако је садржај једнак датој вредности.

source: is any of
de: ist eins von
sr: је један од

source: Matches if content is equal to any of specified values.
de: Trifft zu, wenn der Inhalt mit einem der definierten Werte übereinstimmt.
sr: Подудара се ако је садржај једнак једној од датих вредности.

source: is modified
de: ist geändert
sr: је измењено

source: Matches if content is modified.
de: Trifft zu, wenn der Inhalt geändert wurde.
sr: Подудара се ако је садржај промењен.

source: True from the moment of changing content until form submit.
de: Wahr ab dem Zeitpunkt der Änderung des Inhalts bis zum Absenden des Formulars.
sr: Тачно од тренутка промене садржаја до слања форме.

source: is modified to
de: ist geändert auf
sr: је промењено на

source: Matches if content is modified to a specific value.
de: Trifft zu, wenn der Inhalt auf einen definiertene Wert geändert wurde.
sr: Подудара се ако је садржај промењен на дату вредност.

source: is none of
de: ist keins von
sr: није ниједан од

source: Matches if content is none of any specified values.
de: Trifft zu, wenn der Inhalt keinem der definierten Werte entspricht.
sr: Подудара се ако садржај није једнак ниједног од датих вредности.

source: Matches if content is not equal to a specified value.
de: Trifft zu, wenn der Inhalt nicht gleich dem definierten Wert ist.
sr: Подудара се ако садржај није једнак датој вредности.

source: Matches if content is present.
de: Trifft zu, wenn ein Inhalt vorhanden ist.
sr: Подудара се ако садржај постоји.

source: just changed
de: gerade geändert
sr: управо измењено

source: Matches if content has changed.
de: Trifft zu, wenn sich der Inhalt gerade geändert hat.
sr: Подудара се ако је садржај измењен.

source: Only true for the moment of changing content until next form field action/click.
de: Nur zutreffend für den Moment der Änderung des Inhalts bis zur nächsten Formularfeldaktion/zum nächsten Mausklick.
sr: Тачно само од тренутка измене садржаја до следеће акције/клика поља форме.

source: just changed to
de: gerade geändert auf
sr: је управо измењено на

source: Matches if content has changed to a specified value.
de: Trifft zu, wenn sich der Inhalt gerade auf einen definierten Wert geändert hat.
sr: Подудара се ако је садржај измењен на дату вредност.

source: matches regex
de: passt auf regex
sr: задовољава регуларни израз

source: Matches if value fits to regex rule.
de: Trifft zu, wenn der Wert der Regex-Regel entspricht.
sr: Подудара се ако се садржај поклапа са регуларним изразом.

source: Matches if no content is present.
de: Trifft zu, wenn kein Inhalt vorhanden ist.
sr: Подудара се ако садржај не постоји.

source: starts with
de: beginnt mit
sr: почиње са

source: Matches if content starts with specified value.
de: Trifft zu, wenn der Inhalt mit dem definierten Wert beginnt.
sr: Подудара се ако садржај почиње са датом вредности.

source: starts with one of
de: beginnt mit eins von
sr: почиње са једним од

source: Matches if content starts with one of the specified values.
de: Trifft zu, wenn der Inhalt mit einem der definierten Werte beginnt.
sr: Подудара се ако садржај почиње са једном од датих вредности.

source: till (relative)
de: bis in (relativ)
sr: до (релативно)

source: Matches if date/time is before a period of time before an event.
de: Triff zu, wenn Datum/Uhrzeit vor einem definierten Zeitraum vor einem Ereignis liegt.
sr: Подудара се ако је датум/време пре датог периода пре догађаја.

source: today
de: heute
sr: данас

source: Matches if date/time is today.
de: Trifft zu, wenn Datum/Uhrzeit heute ist.
sr: Подудара се ако је датум/време у току данашњег дана.

source: within last (relative)
de: innerhalb letzter (relativ)
sr: у последњих (релативно)

source: Matches if date/time content is within specified period of time before now.
de: Triff zu, wenn Datum/Uhrzeit innerhalb der definierten Zeitspann vor jetzt liegt.
sr: Подудара се ако је датум/време унутар датог периода у прошлости.

source: within next (relative)
de: innerhalb nächster (relativ)
sr: у следећих (релативно)

source: Matches if date/time content is within specified period of time after now.
de: Trifft zu, wenn Datum/Uhrzeit innerhalb der definierten Zeitspanne nach jetzt liegt.
sr: Подудара се ако је датум/време унутар датог периода у будућности.

source: How do they work?
de: Wie funktionieren sie?
sr: Како то уствари функционише?

source: Find a description of the different parts of the core workflows below.
de: Nachstehend finden Sie eine Beschreibung der verschiedenen Teile der Core Workflows.

source: Choose the object context you want to run the workflow in. This will decide on your available attributes and actions. Ticket objects also have access to the ticket customer.
de: Wählen Sie den Objektkontext, in dem Sie den Workflow ausführen möchten. Dies entscheidet über die verfügbaren Attribute und Aktionen. Ticket-Objekte haben auch Zugriff auf den Ticket-Kunden.

source: Choose in which situation the workflow is applied. Contexts can be combined to avoid duplicate workflows.
de: Wählen Sie aus, in welcher Situation der Workflow angewendet werden soll. Im Feld "Kontext" können mehrere Einträge gewählt werden, um doppelte Core Workflows zu vermeiden.
sr: Изаберите у којој ситуацији се примењује радни ток. Контексти се могу комбиновати да би се смањио број токова.

source: Creation mask
de: Erstellmaske
sr: Форма за отварање

source: If selected, your conditions and actions will affect all applicable creation masks.
de: Wenn Sie diese Option wählen, wirken sich Ihre Bedingungen und Aktionen auf alle anwendbaren Erstellungsmasken aus.
sr: По избору, ваши услови и радње ће утицати на све доступне форме додавања.

source: Edit mask
de: Bearbeitungsmaske
sr: Форма за измену

source: If selected, your conditions and actions will affect all applicable edit masks.
de: Wenn Sie diese Option auswählen, wirken sich Ihre Bedingungen und Aktionen auf alle zutreffenden Bearbeitungsmasken aus.
sr: По избору, ваши услови и радње ће утицати на све доступне форме за уређивање.

source: Zammad differentiates between selected and saved conditions. These can be combined wherever needed. You can find a description of the condition operators for core workflows in :doc:`/system/core-workflows/condition-operators`.
de: Zammad unterscheidet zwischen ausgewählten und gespeicherten Bedingungen. Diese können bei Bedarf kombiniert werden. Eine Beschreibung der Bedingungsoperatoren für Core Workflows finden Sie in :doc:`/system/core-workflows/condition-operators`.

source: **⚠️ Restrict workflows to specific roles if needed!**
de: **⚠️ Schränken Sie Core Workflows auf bestimmte Rollen ein, falls erforderlich!**
sr: **⚠️ Ограничите токове на одговарајуће улоге ако је потребно!**

source: By default and unless configured in conditions, workflow rules are executed for **all roles**. This also affects your customers!
de: Standardmäßig werden Workflow-Regeln für **alle Rollen** ausgeführt, sofern nichts anderes in den Bedingungen konfiguriert wurde. Dies betrifft auch Ihre Kunden!
sr: Подразумевано, осим ако нису подешене у условима, правила радног тока се процењују за **све улоге**. Ово такође утиче на ваше клијенте!

source: Selected Conditions
de: Ausgewählte Bedingungen
sr: Одабрани услови

source: These conditions are based on form values and match if an appropriate selection is made (e.g. choosing another group in the ticket without saving). This applies for drafts (active selection) and currently saved values.
de: Diese Bedingungen basieren auf Formularwerten und treffen zu, wenn eine entsprechende Auswahl getroffen wird (z.B. Auswahl einer anderen Gruppe im Ticket ohne Speichern). Dies gilt für Entwürfe (aktive Auswahl) und aktuell gespeicherte Werte.
sr: Ови услови су базирани на вредностима форме и поклапају се ако је направљен одговарајући избор (нпр. избор друге групе у тикету без снимања). Ово важи за нацрте (активан избор) и тренутно сачуване вредности.

source: Saved Conditions
de: Gespeicherte Bedingungen
sr: Сачувани услови

source: These conditions only match if the selected values are stored in the database. It ignores the current value or selection of the field, as long as the changes are not saved (e.g. performing field operations for an existing ticket, which is viewed/opened by an agent).
de: Diese Bedingungen treffen nur zu, wenn die ausgewählten Werte in der Datenbank gespeichert sind. Der aktuelle Wert oder die Auswahl des Feldes wird ignoriert, solange die Änderungen nicht gespeichert werden (z.B. bei der Durchführung von Änderungen an einem bestehenden Ticket, das von einem Agenten angesehen/geöffnet wird).
sr: Ови услови се поклапају само ако изабране вредности сачуване у бази података. Игноришу тренутну вредност или избор поља, све док измене нису снимљене (нпр. управљањем пољима постојећег тикета, који је у прегледу оператера).

source: Keep in mind that the value has to be available in the situation where you need it. Otherwise the condition won't match.
de: Denken Sie daran, dass der Wert zum Zeitpunkt der Ausführung verfügbar sein muss. Andernfalls wird die Bedingung nicht erfüllt.
sr: Имајте на уму да вредност мора бити доступна у ситуацији у којој вам је потребна. У супротном, услов се неће подударати.

source: Example: you can't perform any actions with *saved condition* on a ticket in creation, because there are no saved values at that time.
de: Beispiel: Sie können keine Aktionen mit *gespeicherter Bedingung* für ein Ticket durchführen, das gerade erstellt wird, da es zu diesem Zeitpunkt keine gespeicherten Werte gibt.
sr: Пример: не можете извршити акције са *сачуваним условима* при отварању тикета, јер нема снимљених вредности у том тренутку.

source: Define which actions should get applied to the relevant fields. The possible actions depend on the object type. However, usually you can at least change the visibility and whether the field is mandatory.
de: Definieren Sie, welche Aktionen auf die entsprechenden Felder angewendet werden sollen. Die möglichen Aktionen hängen vom Objekttyp ab. In der Regel können Sie jedoch zumindest die Sichtbarkeit ändern und festlegen, ob das Feld ein Pflichtfeld ist.
