Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: Certificates belonging your contacts, or their issuing certificate authority (CA) to **verify incoming message signatures** and **encrypt outgoing messages**.
de: Zertifikate, die Ihren Kontakten oder der ausstellenden Zertifizierungsstelle (CA) gehören, um **Signaturen von Eingangsnachrichten** zu überprüfen und **Ausgangsnachrichten** zu verschlüsseln.

source: **Where can I get a certificate?**
de: **Wo kann ich ein Zertifikat erhalten?**

source: The easiest way to get certificates is to buy an annual subscription through a commercial CA, such as:
de: Der einfachste Weg, Zertifikate zu erhalten, ist der Kauf eines Jahresabonnements über eine kommerzielle Zertifizierungsstelle, wie z.B.:
sr: Најлакши начин да набавите сертификате је да купите годишњу претплату преко комерцијалног CA, као што су:

source: `Sectigo (formerly Comodo) <https://sectigo.com/signing-certificates/email-smime-certificate>`_
de: `Sectigo (ehemals Comodo) <https://sectigo.com/signing-certificates/email-smime-certificate>`_
sr: `Sectigo (раније Comodo) <https://sectigo.com/signing-certificates/email-smime-certificate>`_

source: You can also generate your own self-signed certificates, but the process is complicated and usually **involves extra work for your contacts**.
de: Sie können auch Ihre eigenen selbstsignierten Zertifikate erstellen, aber das Verfahren ist kompliziert und bedeutet in der Regel **mehr Arbeit für Ihre Kontakte**.

source: Bear in mind that **S/MIME only works if the other party is using it, too.**
de: Denken Sie daran, dass **S/MIME nur funktioniert, wenn die andere Partei es auch benutzt**.

source: Certificate and Private Key Checks on Upload
de: Überprüfung von Zertifikat und privatem Schlüssel beim Hochladen
sr: Провере сертификата и тајног кључа при отпремању

source: The certificate and public key validation is based on the ``X509v3`` extensions.
de: Die Validierung von Zertifikaten und öffentlichen Schlüsseln basiert auf den ``X509v3``-Erweiterungen.
sr: Провера сертификата и јавног кључа је заснована на ``X509v3`` екстензијама.

source: Uploading a *client certificate*?
de: Hochladen eines *Kundenzertifikats*?
sr: Отпремате *сертификат клијента*?

source: The following attributes are required then:
de: Die folgenden Attribute sind dann erforderlich:
sr: Следећи атрибути су тада обавезни:

source: Subject Alternative Name (at least one email address has to be present)
de: Subject Alternative Name (mindestens eine E-Mail-Adresse muss vorhanden sein)
sr: Subject Alternative Name (мора бити присутна најмање једна имејл адреса)

source: Key Usage (``Digital Signature`` and/or ``Key Encipherment``)
de: Key Usage (``Digital Signature`` und/oder ``Key Encipherment``)
sr: Key Usage (``Digital Signature`` и/или ``Key Encipherment``)

source: Public key algorithm (either ``RSA`` or ``EC``)
de: Algorithmus des öffentlichen Schlüssels (entweder ``RSA`` oder ``EC``)
sr: Public key algorithm (или ``RSA`` или ``EC``)

source: The Extended Key Usage attribute is optional. If the certificate provides the named attribute, than it must contain the value ``E-mail Protection``.
de: Das Attribut "Extended Key Usage" ist optional. Wenn das Zertifikat das genannte Attribut enthält, dann muss es den Wert ``E-mail Protection`` enthalten.
sr: Атрибут Extended Key Usage је опционалан. Ако сертификат садржи дотични атрибут, онда мора да садржи вредност ``E-mail Protection``.

source: Please note that any usable email adress has to be prefixed with ``email:`` or ``rfc822:``.
de: Bitte beachten Sie, dass jeder verwendbaren Email-Adresse der Zusatz ``email:`` oder ``rfc822:`` vorangestellt werden muss.
sr: Имајте на уму да свака употребљива имејл адреса мора имати префикс ``email:`` или ``rfc822:``.

source: The named public key algorithms are mandatory for private keys as well.
de: Die genannten Algorithmen für öffentliche Schlüssel sind auch für private Schlüssel vorgeschrieben.
sr: Именовани алгоритми јавног кључа су обавезни и за тајне кључеве.

source: Uploading a *CA certificate*?
de: Hochladen eines *CA-Zertifikats*?
sr: Отпремате *CA сертификат*?

source: In the case of an uploaded CA certificate, providing the value ``CA:TRUE`` in the attribute *Basic Contstraints*, the previously mentioned attributes are not verified.
de: Im Falle eines hochgeladenen CA-Zertifikats, das im Attribut *Basic Contstraints* den Wert ``CA:TRUE`` aufweist, werden die zuvor genannten Attribute nicht überprüft.
sr: У случају када отпремљени CA сертификат има вредност ``CA:TRUE`` за *Basic Contstraints* атрибут, претходно излистани атрибути неће бити проверени.

source: In general, the usage of any expired (``Not After``) or not yet valid (``Not Before``) certificate is denied for outgoing emails.
de: Im Allgemeinen wird die Verwendung eines abgelaufenen (``Not After``) oder noch nicht gültigen (``Not Before``) Zertifikats für ausgehende E-Mails verweigert.
sr: Уопштено говорећи, употреба сертификата који је истекао (``Not After``) или још увек није важећи (``Not Before``) биће онемогућена за одлазне имејл поруке.

source: Example certificate:
de: Beispiel für ein Zertifikat:
sr: Пример сертификата:

source: Please note that Zammad will distrust senders by default. This means that you're always required to provide certificate data, no matter if for signing or encrypting.
de: Bitte beachten Sie, dass Zammad Absendern standardmäßig misstraut. Das bedeutet, dass Sie immer Zertifikatsdaten angeben müssen, egal ob zum Signieren oder Verschlüsseln.
sr: Имајте на уму да Zammad подразумевано неће веровати пошиљаоцима. То значи да се од вас увек тражи да обезбедите податке сертификата, без обзира да ли за потписивање или шифровање.

source: This is by design and can't be adjusted.
de: Das ist so gewollt und kann nicht geändert werden.
sr: Ово је по пројекту и не може се променити.

source: All of the system's latest S/MIME activity is displayed in the **Recent Logs** section.
de: Alle aktuellen S/MIME-Aktivitäten des Systems werden im Abschnitt **Aktuellste Protokolle** angezeigt.
sr: Све најновије S/MIME активности система су приказане у одељку **Недавни уноси евиденције**.

source: Sample entries of in- and outgoing S/MIME related emails.
de: Beispieleinträge von ein- und ausgehenden S/MIME-bezogenen E-Mails.
sr: Примери уноса долазних и одлазних S/MIME имејл порука.

source: Logs report the status and details of all mail, both incoming and outgoing, that used signing/verification or encryption/decryption.
de: Die Protokolle enthalten den Status und die Details aller eingehenden und ausgehenden E-Mails, die signiert/verifiziert oder ver- und entschlüsselt wurden.
sr: Евиденција извештава о статусу и детаљима свих порука, како долазних тако и одлазних, које су користиле функције потписивања/верификације или шифровања/дешифровања.

source: This log does **not** include email sent by :doc:`triggers </manage/trigger>` or the :doc:`scheduler </manage/scheduler>`. For those, check your ``production.log``.
de: Dieses Protokoll enthält **nicht** E-Mails, die von :doc:`triggers </manage/trigger>` oder dem :doc:`scheduler </manage/scheduler>` gesendet wurden. Prüfen Sie dazu bitte Ihr ``production.log``.
sr: Ова евиденција **не** укључује имејл поруке које шаљу :doc:`окидачи </manage/trigger>` и :doc:`планери </manage/scheduler>`. За њих, проверите своју ``production.log`` датотеку.

source: Common Issues
de: Häufige Probleme
sr: Уобичајени проблеми

source: I received a signed/encrypted email before I set up S/MIME integration
de: Ich habe eine signierte/verschlüsselte E-Mail erhalten, bevor ich die S/MIME-Integration eingerichtet habe
sr: Добио сам потписану/шифровану имејл поруку пре него што је подешена S/MIME интеграција

source: No problem. Once S/MIME has been enabled and the appropriate certificates have been added, agents will be prompted to retry verification/decryption on matching emails.
de: Das ist kein Problem. Sobald S/MIME aktiviert ist und die entsprechenden Zertifikate hinzugefügt wurden, werden die Agenten aufgefordert, die Verifizierung/Entschlüsselung bei entsprechenden E-Mails zu wiederholen.
sr: Нема проблема. Када се S/MIME укључи и додају одговарајући сертификати, оператерима ће бити пружена опција да поново покушају верификују/дешифрују одговарајуће поруке.

source: Screenshot of user prompt to retry decryption
de: Screenshot mit Benutzeraufforderung, die Entschlüsselung zu wiederholen
sr: Снимак екрана корисничке функције за поновни покушај дешифровања

source: The 🔒 **Encrypt** button is disabled
de: Die 🔒 **Verschlüsseln**-Schaltfläche ist deaktiviert
sr: Дугме 🔒 **Шифровање** је онемогућено

source: Have you added the recipient's certificate?
de: Haben Sie das Zertifikat des Empfängers hinzugefügt?
sr: Да ли сте додали сертификат примаоца?

source: Are you sure the recipient's certificate is valid?
de: Sind Sie sicher, dass das Zertifikat des Empfängers gültig ist?
sr: Да ли сте сигурни да је сертификат примаоца важећи?

source: Have you checked your ``production.log`` for more details?
de: Haben Sie Ihr ``production.log`` auf weitere Details überprüft?
sr: Да ли сте проверили своју ``production.log`` датотеку за више детаља?

source: If encryption doesn't work in the composer, it won't work in :doc:`triggers </manage/trigger>` or the :doc:`scheduler </manage/scheduler>` either!
de: Wenn die Verschlüsselung Ticket-Bereich nicht funktioniert, wird sie auch nicht in :doc:`Triggern </manage/trigger>` oder in :doc:`Automatisierungen </manage/scheduler>` funktionieren!
sr: Ако шифровање не функционише приликом слања, неће радити ни у :doc:`окидачима </manage/trigger>` и :doc:`планерима </manage/scheduler>`!

source: The ✅ **Sign** button is disabled
de: Die ✅ **Signieren**-Schaltfläche ist deaktiviert
sr: Дугме ✅ **Потписивање** је онемогућено

source: Have you added **both the certificate and private key** for your organization?
de: Haben Sie **Zertifikate und privaten Schlüssel** für Ihre Organisation hinzugefügt?
sr: Да ли сте додали **и сертификат и тајни кључ** за своју организацију?

source: Does the email address on the certificate match the email address of the agent/group composing the email?
de: Stimmt die E-Mail-Adresse aus dem Zertifikat mit der E-Mail-Adresse der Person/Gruppe überein, die die E-Mail verfasst?
sr: Да ли се имејл адреса сертификата подудара са имејл адресом оператера/групе која саставља поруку?

source: Error: “Fingerprint already taken”
de: Fehler: "Fingerabdruck bereits vorhanden"
sr: Грешка: „Fingerprint already taken“

source: Are you sure you haven't added this certificate already?
de: Sind Sie sicher, dass Sie dieses Zertifikat nicht bereits hinzugefügt haben?
sr: Јесте ли сигурни да већ нисте додали овај сертификат?

source: Error: “❌ invalid byte sequence in UTF-8”
de: Fehler: "❌ ungültige Bytefolge in UTF-8"
sr: Грешка: „❌ invalid byte sequence in UTF-8“

source: Please ensure to provide PEM formatted certificate and keys.
de: Bitte stellen Sie sicher, dass Sie das Zertifikat und die Schlüssel im PEM-Format bereitstellen.
sr: Обавезно обезбедите сертификат и кључеве у PEM формату.

source: Did you check if the provided file is a valid certificate or key?
de: Haben Sie überprüft, ob es sich bei der bereitgestellten Datei um ein gültiges Zertifikat oder einen gültigen Schlüssel handelt?
sr: Да ли сте проверили да ли дата датотека садржи важећи сертификат или кључ?

source: Maintenance
de: Wartung
sr: Одржавање

source: Zammad comes with a maintenance mode that you can use for e.g. updating the instance or changing settings while restricting availability and functions.
de: Zammad verfügt über einen Wartungsmodus, den Sie z.B. zum Aktualisieren der Instanz oder zum Ändern von Einstellungen verwenden können, wobei die Verfügbarkeit und die Funktionen eingeschränkt werden.
sr: Zammad долази са режимом одржавања који можете користити за нпр. ажурирање инстанце или промену подешавања уз ограничавање доступности функција.

source: Mode
de: Modus
sr: Режим

source: The mode setting allows you to enable or disable the maintenance mode.
de: Mit dem Modus-Schalter können Sie den Wartungsmodus aktivieren oder deaktivieren.
sr: Подешавање режима вам омогућава да укључите или искључите режим одржавања.

source: Defaults to *off*.
de: Die Standardeinstellung ist *aus*.
sr: Подразумевано је *искључено*.

source: The maintenance mode will restrict access to administrative roles only. This means agents and customers are logged off.
de: Im Wartungsmodus ist der Zugriff nur auf administrative Rollen beschränkt. Das bedeutet, dass Agenten und Kunden abgemeldet sind.
sr: Режим одржавања ће ограничити приступ само улози администратора. То значи да су оператери и клијенти одјављени.

source: This setting allows you to provide a login message within a green banner above the login screen. Click into the green banner in the settings page to adjust your message. To activate the message, activate the *@Login* setting.
de: Mit dieser Einstellung können Sie eine Login-Nachricht in einem grünen Banner über dem Login-Bildschirm anzeigen. Klicken Sie in das grüne Banner auf der Einstellungsseite, um Ihre Nachricht anzupassen. Um die Nachricht zu aktivieren, aktivieren Sie den Schalter *@Login*.
sr: Ово подешавање вам омогућава да одредите пријавну поруку у оквиру зеленог банера изнад екрана за пријаву. Кликните на зелени банер на страници са подешавањима да бисте прилагодили своју поруку. Да бисте активирали поруку, укључите подешавање *@Пријави се*.

source: Screenshot showing the default login message within the settings page
de: Screenshot zeigt die Standard-Anmeldung auf der Einstellungsseite
sr: Снимак екрана који приказује подразумевану пријавну поруку у оквиру странице са подешавањима

source: Send an informative message to **all active sessions**. This comes handy to inform your agents e.g. about mayor outages or to force reloads after configuration changes.
de: Senden Sie eine informative Nachricht an **alle angemeldeten Benutzer**. Dies ist nützlich, um Ihre Agenten z.B. über größere Ausfälle zu informieren oder um nach Konfigurationsänderungen einen Reload zu erzwingen.
sr: Пошаљите информативну поруку **свим активним сесијама**. Ово је згодно да обавестите своје оператере, нпр. о дужим прекидима рада или о обавезном поновном учитавању апликације након измена конфигурације.

source: This is the messages title (slightly bigger than the normal message).
de: Dies ist der Titel der Nachricht (etwas größer als die normale Nachricht).
sr: Ово је наслов поруке (мало већи фонт од остатка текста).

source: The text you want to provide to your logged in sessions.
de: Der Text, den Sie Ihren angemeldeten Benutzern senden wollen.
sr: Текст који желите да пошаљете својим пријављеним сесијама.

source: Reload application
de: Applikation neu laden
sr: Освежи апликацију

source: Selecting this option will change the message acceptance button from *Close* (with nothing happening) to *Continue session*, which forces the application to reload.
de: Wenn Sie diese Option wählen, ändert sich die Schaltfläche der Benachrichtigung von *Schließen* (ohne dass etwas passiert) in *Sitzung fortsetzen*, wodurch ein erneutes Laden der Anwendung erzwungen wird.
sr: Избор ове опције промениће дугме за прихватање поруке из *Затвори* (без икакве функције) у *Настави сесију*, што приморава апликацију да се поново учита.

source: If you have customers that are logged in to Zammad, they'll also be notified if they're active in that moment.
de: Wenn Sie Kunden haben, die bei Zammad eingeloggt sind, werden diese ebenfalls benachrichtigt, wenn sie in diesem Moment aktiv sind.
sr: Ако имате клијенте који су пријављени у Zammad, они ће такође бити обавештени уколико су активни у том тренутку.

source: Example without reload application
de: Beispiel ohne Anwendungs-Aktualisierung
sr: Пример без поновног учитавања апликације

source: Message setting within Zammad's admin settings without ticket reload application setting.
de: Nachrichteneinstellung in den Verwaltungseinstellungen von Zammad ohne erzwungene Aktualisierung.
sr: Подешавање поруке у оквиру Zammad-ових подешавања администратора без поновног учитавања апликације.

source: Screenshot showing the send message settings without ticket reload application set
de: Screenshot mit den Einstellungen für das Senden von Nachrichten ohne Aktualisierung der Anwendung
sr: Снимак екрана који приказује подешавање слања поруке без поновног учитавања апликације

source: The modal all other active sessions will see upon pressing *Send to clients*.
de: Der Dialog, den alle anderen aktiven Sitzungen sehen, wenn Sie auf *An Clients senden* drücken.
sr: Дијалог ће све остале активне сесије видети чим притиснете *Пошаљи клијентима*.

source: Screenshot showing modal caused by maintenance's message without reload application ticket
de: Screenshot mit Benachrichtigung ohne Aktualisierung der Anwendung
sr: Снимак екрана који приказује дијалог изазван поруком одржавања без поновног учитавања апликације

source: Example with reload application
de: Beispiel mit Anwendungs-Aktualisierung
sr: Пример са поновним учитавањем апликације

source: Message setting within Zammad's admin settings with ticket reload application setting.
de: Nachrichteneinstellung in den Verwaltungseinstellungen von Zammad mit erzwungener Aktualisierung.
sr: Подешавање поруке у оквиру Zammad-ових подешавања администратора са поновним учитавањем апликације.

source: Screenshot showing the send message settings with ticket reload application set
de: Screenshot mit den Einstellungen für das Senden von Nachrichten mit Aktualisierung der Anwendung
sr: Снимак екрана који приказује подешавање слања поруке са поновним учитавањем апликације

source: Screenshot showing modal caused by maintenance's message with reload application ticket
de: Screenshot mit Benachrichtigung mit Aktualisierung der Anwendung
sr: Снимак екрана који приказује дијалог изазван поруком одржавања са поновним учитавањем апликације

source: Monitoring
de: Monitoring (Überwachung)
sr: Надгледање

source: This function is only available in self hosted instances. If you use Zammad in our cloud, we are monitoring the system on our own and take steps to fix potential problems directly.
de: Diese Funktion ist nur in selbst gehosteten Instanzen verfügbar. Wenn Sie Zammad in unserer Cloud nutzen, überwachen wir das System selbst und ergreifen Maßnahmen, um mögliche Probleme direkt zu beheben.
sr: Ова функција је доступна само у инстанцама које сами хостујете. Ако користите Zammad у нашем окружењу, ми сами надгледамо систем и предузимамо кораке да директно решимо потенцијалне проблеме.

source: On the monitoring page, you can see the current health state of Zammad under "*Current Status*" at the bottom. This can be useful if you want to have a look if everything is up and running. As an example, you could have a look in the monitoring when you assume that some emails aren't processed from Zammad.
de: Auf der Monitoring-Seite können Sie den aktuellen Zustand von Zammad unter "*Aktueller Status*" am unteren Rand sehen. Dies kann nützlich sein, wenn Sie nachsehen wollen, ob alles funktioniert. Zum Beispiel können Sie einen Blick ins Monitoring werfen, wenn Sie vermuten, dass einige E-Mails von Zammad nicht verarbeitet werden.
sr: На страници за надгледање можете видети тренутно стање Zammad-а под „*Тренутно стање*“ при дну. Ово може бити корисно ако желите да проверите да ли је све у реду. Као пример, могли бисте да провериде у надгледању када претпоставите да се неке имејл поруке не обрађују од стране Zammad-а.

source: **Can't receive an email and the monitoring response is "healthy"?**
de: **Können Sie keine E-Mail empfangen, aber das Monitoring meldet "kein Vorfälle"?**
sr: **Не можете да примите имејл поруке и стање надгледања је „без проблема“?**

source: Zammad will just inform you about unprocessable emails. This is not the case for oversized emails. You can adjust the maximum email size in :doc:`../channels/email/settings`.
de: Zammad informiert Sie nur über nicht verarbeitbare E-Mails. Das ist hingegen bei übergroßen E-Mails nicht der Fall. Sie können die maximale E-Mail-Größe in :doc:`../channels/email/settings` einstellen.
sr: Zammad ће вас само обавестити о необрађеним имејл порукама. Ово није случај са превеликим имејл порукама. Можете подесити максималну величину имејл порука путем :doc:`../channels/email/settings`.

source: Beside the indication in the monitoring page, you can also use an external monitoring tool to monitor Zammad's health. To request the health of Zammad, you need to provide the API key (token) to the external monitoring tool. You can copy the token from the "*Current Token*" field as well as the whole API endpoint of your system ("*Health Check*" field), in which the API token is already included.
de: Neben der Anzeige auf der Monitoring-Seite können Sie auch ein externes Monitoring-Tool verwenden, um den Zustand von Zammad zu überwachen. Um den Zustand von Zammad abzufragen, müssen Sie dem externen Monitoring-Tool den API-Schlüssel (Token) zur Verfügung stellen. Sie können den Token sowohl aus dem Feld "*Aktueller Token*" als auch aus dem gesamten API-Endpunkt Ihres Systems (Feld "*Gesundheits-Check*") kopieren, in dem der API-Token bereits enthalten ist.
sr: Поред индикације на страници за надгледање, можете користити и спољни алат за надгледање статуса Zammad-а. Да бисте надгледали Zammad, потребно је да доставите API кључ (токен) спољном алату за надгледање. Можете копирати кључ из поља „*Тренутни кључ*“, као и комплетну API путању вашег система (поље „*Провера доступности*“), у коју је API кључ већ укључен.

source: Screenshot showing Current Token and Health Check
de: Screenshot mit aktuellem Token und Gesundheits-Check
sr: Снимак екрана који приказује тренутни кључ и проверу доступности

source: Screenshot showing Token and Health Check
de: Screenshot mit Token und Gesundheits-Check
sr: Снимак екрана који приказује кључ и проверу доступности

source: In addition to that, you can reset the auto-generated token to make sure that already configured monitoring systems won't work anymore. So, please use this "*Reset*" button only if you know what you do!
de: Darüber hinaus können Sie das automatisch generierte Token zurücksetzen, um sicherzustellen, dass bereits konfigurierte Monitoring-Systeme nicht mehr funktionieren. Bitte verwenden Sie diese Schaltfläche "*Zurücksetzen*" nur, wenn Sie wissen, was Sie tun!
sr: Поред тога, можете ресетовати аутоматски генерисани кључ да бисте били сигурни да већ конфигурисани системи за надгледање више неће радити. Дакле, користите дугме „*Поништи*” само ако знате шта радите!

source: Example Output
de: Beispiel Ausgabe
sr: Пример резултата

source: No issues found
de: keine Vorfälle
sr: Није пронађен ниједан проблем

source: **Indicator in Zammad**:
de: **Indikator in Zammad**:
sr: **Индикатор у Zammad-у**:

source: Screenshot showing monitoring with no issues
de: Screenshot des Monitoring ohne Probleme
sr: Снимак екрана који приказује преглед надгледања без проблема

source: **API response**::
de: **API-Antwort**::
sr: **API одговор**::

source: Issues were found
de: Es wurden Probleme festgestellt
sr: Проблеми су пронађени

source: Screenshot showing monitoring with issues
de: Screenshot des Monitoring mit Problemen
sr: Снимак екрана који приказује преглед надгледања са проблемима

source: Objects
de: Objekte
sr: Објекти
