Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: For most users, :ref:`the sample scripts from the Setup Guide <checkmk-api-alerts>` will do the job just fine. But if you want more fine-grained control—for instance, to create high- and low-priority tickets for different types of system events—then you'll have to customize the data those scripts send to Zammad.
de: Für die meisten Benutzer sind die :ref:`Beispielskripte aus dem Einrichtungsanleitung <checkmk-api-alerts>` völlig ausreichend. Wenn Sie jedoch eine feinere Steuerung wünschen, z.B. um Tickets mit hoher und niedriger Priorität für verschiedene Arten von Systemereignissen zu erstellen, müssen Sie die Daten, die diese Skripte an Zammad senden, anpassen.
sr: За већину корисника, :ref:`пример скрипти из водича кроз подешавање <checkmk-api-alerts>` ће бити сасвим довољан. Али ако желите прецизнију контролу—на пример, да отварате тикете високог и ниског приоритета за различите типове системских догађаја—онда ћете морати да прилагодите податке које те скрипте шаљу Zammad-у.

source: This custom script will automatically set all tickets it creates to **high priority** and **assign them to charlie@chrispresso.com**.
de: Dieses benutzerdefinierte Skript setzt alle Tickets, die es erstellt, automatisch auf **hohe Priorität** und **weist sie charlie@chrispresso.com** zu.
sr: Ова прилагођена скрипта ће аутоматски поставити све тикете које отвара на **високи приоритет** и **доделити их на charlie@chrispresso.com**.

source: How Does it Work?
de: Wie funktioniert das?
sr: Како то уствари функционише?

source: There are two kinds of data you can pass to the API, both in the form of key-value pairs:
de: Es gibt zwei Arten von Daten, die Sie an die API übergeben können, beide in Form von Schlüssel-Wert-Paaren:
sr: Постоје две врсте података које можете да проследите API-ју, обе у облику парова кључ/вредност:

source: Checkmk parameters
de: Checkmk-Parameter
sr: Checkmk параметри

source: are required, and make up the **contents** of the resulting tickets/articles. They also determine whether an event creates a new ticket or updates/closes an existing one.
de: sind erforderlich und bilden den **Inhalt** der resultierenden Tickets/Artikel. Sie bestimmen auch, ob ein Ereignis ein neues Ticket erstellt oder ein bestehendes aktualisiert/schließt.
sr: су обавезни и чине **садржај** примљених тикета/чланака. Они такође одређују да ли догађај отвара нов тикет или освежава/затвара постојећи.

source: These are the only values used in the sample scripts. **Use them as-is**; technically, they can be customized, but it's hard to imagine a good reason for it.
de: Dies sind die einzigen Werte, die in den Beispielskripten verwendet werden. **Verwenden Sie sie am besten genau so**. Sie können auch angepasst werden, aber uns fällt kein guter Grund dafür ein.
sr: Ово су једине вредности које се користе у примерима скрипти. **Користите их баш овако**; технички, могу се прилагодити, али је тешко замислити добар разлог за то.

source: Ticket attributes
de: Ticket Attribute
sr: Атрибути тикета

source: are optional, and can be used to **adjust settings** on newly created tickets (*e.g.,* set the owner, group, priority, or state).
de: sind optional und können verwendet werden, um **Einstellungen** für neu erstellte Tickets vorzunehmen (*z.B.* den Besitzer, die Gruppe, die Priorität oder den Status festzulegen).
sr: су опциони и могу се користити за **прилагођавање подешавања** за новоотворене тикете (*нпр.* постављање власника, групе, приоритета или стања).

source: If you want to customize your Checkmk alert script, do it with these. Simply add an extra “form” option for each one (``-F "key=value"``) to your script's ``curl`` command line, as in the example above.
de: Wenn Sie Ihr Checkmk-Warnskript anpassen wollen, können Sie dies mit diesen tun. Fügen Sie einfach eine zusätzliche "form"-Option für jede dieser Optionen (``-F "key=value"``) in die ``curl``-Befehlszeile Ihres Skripts ein, wie im obigen Beispiel.
sr: Ако желите да прилагодите своју Checkmk скрипту упозорења, урадите то на овај начин. Једноставно додајте опцију „form“ за сваку (``-F "кључ=вредност"``) групу у командној ``curl`` линији ваше скрипте, као у примеру изнад.

source: 💡 **It's just an API endpoint!**
de: 💡 **Es ist nur ein API-Endpunkt!**
sr: 💡 **То је само API путања!**

source: When using Checkmk integration, messages need to be formatted in a certain way, but that *doesn't mean the messages actually have to come from Checkmk*.
de: Wenn Sie die Checkmk-Integration verwenden, müssen die Nachrichten auf eine bestimmte Art und Weise formatiert werden, aber das bedeutet *nicht, dass die Nachrichten tatsächlich von Checkmk kommen müssen*.
sr: Када користите Checkmk интеграцију, поруке морају бити форматиране на одређени начин, али то *не значи да поруке заправо морају да долазе од Checkmk*.

source: If you use another monitoring tool that's not officially supported by Zammad, there's probably a way to make it work with your Checkmk callback URL.
de: Wenn Sie ein anderes Monitoring-Tool verwenden, das nicht offiziell von Zammad unterstützt wird, gibt es wahrscheinlich eine Möglichkeit, es mit Ihrer Checkmk-Callback-URL zum Laufen zu bringen.
sr: Ако користите други алат за праћење који Zammad званично не подржава, вероватно постоји начин да га натерате да ради са вашом Checkmk URL адресом повратног позива.

source: Checkmk Parameters
de: Checkmk-Parameter
sr: Checkmk параметери

source: When a notification is received, Zammad creates a new article containing the details of the event that triggered it:
de: Wenn eine Benachrichtigung eingeht, erstellt Zammad einen neuen Artikel mit den Einzelheiten des Ereignisses, das die Benachrichtigung ausgelöst hat:
sr: По примању упозорења, Zammad додаје нови чланак који садржи детаље догађаја који га је покренуо:

source: Checkmk article body
de: Checkmk Artikelinhalt
sr: Checkmk текст чланка

source: These details come from the fields listed below, which correspond to parameters provided by Checkmk (``$NOTIFY_*``).
de: Diese Angaben stammen aus den unten aufgeführten Feldern, die den von Checkmk bereitgestellten Parametern entsprechen (``$NOTIFY_*``).
sr: Ови детаљи потичу из поља наведених у наставку, која одговарају параметрима које обезбеђује Checkmk (``$NOTIFY_*``).

source: **Required fields are marked with an asterisk (\*).**
de: **Erforderliche Felder sind mit einem Stern (\*) gekennzeichnet.**
sr: **Обавезна поља су означена звездицом (\*).**

source: A unique ID for the system event. (``$NOTIFY_SERVICEPROBLEMID`` / ``$NOTIFY_HOSTPROBLEMID``)
de: Eine eindeutige ID für das Systemereignis. (``$NOTIFY_SERVICEPROBLEMID`` / ``$NOTIFY_HOSTPROBLEMID``)
sr: Јединствени ID за системски догађај. (``$NOTIFY_SERVICEPROBLEMID`` / ``$NOTIFY_HOSTPROBLEMID``)

source: The hostname of the system that the event originated from. (``$NOTIFY_HOSTNAME``)
de: Der Hostname des Systems, von dem das Ereignis ausgeht. (``$NOTIFY_HOSTNAME``)
sr: Назив хоста система из којег је настао догађај. (``$NOTIFY_HOSTNAME``)

source: Used to determine if a new event belongs to an existing ticket. Also used in the subject line of the resulting article (“<host> is <state>”).
de: Wird verwendet, um festzustellen, ob ein neues Ereignis zu einem bestehenden Ticket gehört. Wird auch in der Betreffzeile des resultierenden Artikels verwendet ("<Host> ist <Status>").
sr: Користи се за одређивање да ли нови догађај припада постојећем тикету. Такође се користи у предмету новонасталог чланка („<host> is <state>”).

source: The name of the service that the event originated from. (``$NOTIFY_SERVICEDESC``)
de: Der Name des Dienstes, von dem das Ereignis ausgeht. (``$NOTIFY_SERVICEDESC``)
sr: Назив сервиса из кога је догађај настао. (``$NOTIFY_SERVICEDESC``)

source: Used to determine if a new event belongs to an existing ticket.
de: Wird verwendet, um festzustellen, ob ein neues Ereignis zu einem bestehenden Ticket gehört.
sr: Користи се за одређивање да ли нови догађај припада постојећем тикету.

source: Displayed as ``-`` when omitted.
de: Wird als ``-`` angezeigt, wenn es weggelassen wird.
sr: Приказује се као ``-`` када се изостави.

source: The current state of the service or host in question. (``$NOTIFY_SERVICESTATE`` / ``$NOTIFY_HOSTSTATE``)
de: Der aktuelle Zustand des entsprechenden Dienstes oder Hosts. (``$NOTIFY_SERVICESTATE`` / ``$NOTIFY_HOSTSTATE``)
sr: Тренутно стање дотичног сервиса или хоста. (``$NOTIFY_SERVICESTATE`` / ``$NOTIFY_HOSTSTATE``)

source: Used to detect when a ticket should be auto-closed (*i.e.,* on ``OK``/``UP``). Also used in the subject line of the resulting article (“<host> is <state>”).
de: Wird verwendet, um zu erkennen, wann ein Ticket automatisch geschlossen werden soll (*d.h.* bei ``OK``/``UP``). Wird auch in der Betreffzeile des resultierenden Artikels verwendet ("<Host> ist <Status>").
sr: Користи се за откривање када би тикет требало да се аутоматски затвори (*тј.* на ``OK``/``UP``). Такође се користи у предмету новонасталог чланка („<host> is <state>”).

source: The output of the process that triggered the event. (``$NOTIFY_SERVICEOUTPUT`` / ``$NOTIFY_HOSTOUTPUT``)
de: Die Ausgabe des Prozesses, der das Ereignis ausgelöst hat. (``$NOTIFY_SERVICEOUTPUT`` / ``$NOTIFY_HOSTOUTPUT``)
sr: Излазни подаци процеса који је покренуо догађај. (``$NOTIFY_SERVICEOUTPUT`` / ``$NOTIFY_HOSTOUTPUT``)

source: The Object Manager attribute panel displays built-in and custom attribute names.
de: Die Attributeinstellungen des Objektmanagers zeigen integrierte und benutzerdefinierte Attributnamen an.
sr: Панел управљања атрибутима објекта приказује уграђене и прилагођене називе атрибута.

source: Find a complete list of ticket attributes in the Object Manager.
de: Eine vollständige Liste der Ticketattribute finden Sie im Objektmanager.
sr: Пронађите комплетну листу атрибута тикета у управљању објектима.

source: Ticket attributes are entirely optional, and can be used to customize the tickets that Checkmk creates. (Note that these attributes will be ignored if a new event belongs to an existing ticket.)
de: Ticket-Attribute sind völlig optional und können verwendet werden, um die Tickets, die Checkmk erstellt, individuell zu gestalten. (Beachten Sie, dass diese Attribute ignoriert werden, wenn ein neues Ereignis zu einem bestehenden Ticket erstellt wird.)
sr: Атрибути тикета су потпуно опциони и могу се користити за прилагођавање тикета које Checkmk креира. (Имајте на уму да ће ови атрибути бити занемарени ако нови догађај припада постојећем тикету.)

source: Why would you want to do this? Maybe you have only one IT guy, and all system monitoring issues should be automatically assigned to him. Or, maybe you're creating multiple notification rules so that database outages take higher priority than disk space warnings.
de: Warum sollten Sie das tun? Vielleicht haben Sie nur einen IT-Mitarbeiter, dem alle Probleme bei der Systemüberwachung automatisch zugewiesen werden sollen. Oder vielleicht erstellen Sie mehrere Benachrichtigungsregeln, so dass Datenbankausfälle höhere Priorität haben als Speicherplatzwarnungen.
sr: Зашто бисте желели ово да урадите? Можда имате само једног IT момка и сви проблеми праћења система би требали бити аутоматски додељени баш њему. Или, можда одређујете више правила за упозорења тако да прекиди у доступности базе података имају већи приоритет од упозорења о преосталом простору на диску.

source: In most cases, you'll probably want to set one of the following:
de: In den meisten Fällen werden Sie wahrscheinlich eine der folgenden Einstellungen vornehmen wollen:
sr: У већини случајева, вероватно ћете желети да подесите бар једно од следећег:

source: group
de: Gruppe

source: state
de: Status

source: priority
de: Priorität

source: but in practice, you can set almost any attribute, including :doc:`custom ones you created through the Object Manager </system/objects>`.
de: aber in der Praxis können Sie fast jedes Attribut setzen, einschließlich :doc:`benutzerdefinierter Attribute, die Sie über den Objektmanager </system/objects>` erstellt haben.
sr: али у пракси, можете подесити скоро све атрибуте, укључујући :doc:`прилагођене атрибуте које сте додали преко панела за управљање објектима </system/objects>`.

source: Please note that the following attributes are **not customizable**:
de: Bitte beachten Sie, dass die folgenden Attribute **nicht angepasst werden können**:
sr: Имајте на уму да се следећи атрибути се **не могу прилагодити**:

source: Which Values Can Be Set?
de: Welche Werte können eingestellt werden?
sr: Које вредности је могуће поставити?

source: 😵 **Invalid values → unpredictable behavior**
de: 😵 **Ungültige Werte → unvorhersehbares Verhalten**
sr: 😵 **Неисправне вредности → непредвидљиво понашање**

source: If you provide a value that Zammad doesn't understand (*e.g.,* ``-F "priority=high"``), it's not always clear what will happen. In some cases, a ticket will be created with the default values instead - but in others, it may not be created at all!
de: Wenn Sie einen Wert angeben, den Zammad nicht versteht (*z.B.* ``-F "priority=high"``), ist nicht immer klar, was passieren wird. In einigen Fällen wird ein Ticket stattdessen mit den Standardwerten erstellt - in anderen Fällen wird es aber vielleicht gar nicht erstellt!
sr: Ако наведете вредност коју Zammad не разуме (*нпр.* ``-F "priority=high"``), није увек сасвим јасно шта ће се догодити. У неким случајевима ће се уместо тога отворити тикет са подразумеваним вредностима — али у другим, можда неће бити уопште отворен!

source: So what values does Zammad understand, then? Well, it depends...
de: Welche Werte versteht Zammad denn nun? Nun, das kommt darauf an...
sr: Дакле, које вредности Zammad разуме? Па, зависи...

source: Use an email address or username:
de: Verwenden Sie eine E-Mail-Adresse oder einen Benutzernamen:
sr: Користите имејл адресу или корисничко име:

source: group & priority
de: Gruppe & Priorität

source: Refer to the dropdown menus in the ticket pane:
de: Beachten Sie die Dropdown-Menüs im Ticketbereich:
sr: Погледајте падајуће меније у панелу тикета:

source: See possible values for certain attributes in the ticket pane.
de: Siehe mögliche Werte für bestimmte Attribute im Ticketbereich.
sr: Погледајте могуће вредности за одређене атрибуте у панелу тикета.

source: 🙅 **Ticket state CANNOT be set this way!**
de: 🙅 **Der Ticketstatus kann auf diese Weise NICHT eingestellt werden!**
sr: 🙅 **Стање тикета НЕ МОЖЕ да се подеси на овај начин!**

source: Why? Because ``-F "state=..."`` is already used :ref:`as a Checkmk parameter <checkmk-parameter-state>`.
de: Warum? Weil ``-F "state=..."`` bereits :ref:`als ein Checkmk-Parameter <checkmk-parameter-state>` verwendet wird.
sr: Зашто? Зато што се ``-F "state=..."`` већ користи :ref:`као Checkmk параметар <checkmk-parameter-state>`.

source: Everything Else
de: Alles andere
sr: Све остало

source: To set any other attributes, it helps to know your way around the :docs:`rails console </admin/console.html>`. Valid values are those that you can set with a string:
de: Um andere Attribute zu setzen, hilft es, sich in der :docs:`rails console </admin/console.html>` auszukennen. Gültige Werte sind diejenigen, die Sie mit einer Zeichenkette setzen können:
sr: Да бисте подесили било које друге атрибуте, помоћи ће вам да знате да се снађете у :docs:`rails конзоли </admin/console.html>`. Важеће вредности су оне које можете поставити текстуалним низом:

source: These values can then be passed directly to the API:
de: Diese Werte können dann direkt an die API übergeben werden:
sr: Ове вредности се затим могу пренети директно у API:

source: How does it work?
de: Wie funktioniert das?
sr: Како то уствари функционише?

source: `Checkmk <https://checkmk.com/>`_ is a powerful IT monitoring tool that can send real-time status alerts to Zammad via email or REST API. Set these alerts up in Checkmk, and Zammad will automatically create, update, and close tickets based on the health of your system:
de: `Checkmk <https://checkmk.com/>`_ ist ein mächtiges IT-Tool für Monitoring, das Echtzeit-Alarme an Zammad via E-Mail oder REST-API senden kann. Konfigurieren Sie die Alarme in Checkmk und Zammad wird automatisch Tickets basierend auf der Systemstatus erstellen, aktualisieren und schließen:
sr: `Checkmk <https://checkmk.com/>`_ је моћан алат за IT праћење који може да шаље обавештења о статусу Zammad-а у реалном времену путем имејла или REST API. Подесите ова упозорења у Checkmk и Zammad ће аутоматски отварати, освежавати и затварати тикете на основу здравља вашег система:

source: Screenshot of ticket created by Checkmk notifications
de: Screenshot eines durch Checkmk-Benachrichtigungen erstellten Tickets
sr: Снимак екрана тикета отвореног на основу Checkmk упозорења

source: Multiple alerts, same ticket.
de: Mehrere Alarme, dasselbe Ticket.
sr: Више упозорења, исти тикет.

source: Setup Guide
de: Einrichtungs-Anleitung
sr: Водич кроз подешавање

source: Whenever the Checkmk integration is enabled, Zammad listens for messages on its API and over email. As long as those messages follow the required format, Zammad will create new tickets (or find and update existing ones) based on the message contents.
de: Immer wenn die Checkmk-Integration aktiviert ist, lauscht Zammad auf Nachrichten über seine API und per E-Mail. Solange diese Nachrichten dem erforderlichen Format entsprechen, erstellt Zammad neue Tickets (oder findet und aktualisiert bestehende) auf der Grundlage der Nachrichteninhalte.
sr: Кад год је Checkmk интеграција укључена, Zammad ослушкује захтеве на свом API-ју и путем имејла. Све док те поруке прате очекивани формат, Zammad ће отварати нове тикете (или пронаћи и освежити постојеће) на основу садржаја поруке.

source: That means that "setting up Checkmk integration" is simply a matter of **adding configuration to your Checkmk site**: telling it when to send these messages and what to say. To do that, you'll need to create a new **notification rule** (see `Checkmk's official docs <https://checkmk.com/cms_notifications.html>`_ for help with that).
de: Das bedeutet, dass die "Einrichtung der Checkmk-Integration" lediglich eine Frage der **Konfiguration Ihrer Checkmk-Seite** ist: Sie müssen definieren, wann diese Nachrichten gesendet werden sollen und was deren Inhalt sein soll. Dazu müssen Sie eine neue **Benachrichtigungsregel** erstellen (Hilfe dazu finden Sie in der offiziellen Checkmk-Dokumentation <https://checkmk.com/cms_notifications.html>`_).
sr: То значи да је „подешавање Checkmk интеграције“ једноставно питање **додавања конфигурације вашој Checkmk инстанци**: да јој кажете када да пошаље ове поруке и шта у њима да каже. Да бисте то урадили, мораћете да дефинишете нови **notification rule** (погледајте `Checkmk званичну документацију <https://checkmk.com/cms_notifications.html>`_ за додатну помоћ).

source: As part of this new rule, you'll have to choose a **notification method** (*i.e.,* a script to execute whenever the rule is triggered). This script will be written by you (samples below), and contain the logic for sending API/email messages to Zammad:
de: Als Teil dieser neuen Regel müssen Sie eine **Benachrichtigungsmethode** wählen (*d.h.* ein Skript, das ausgeführt wird, wenn die Regel ausgelöst wird). Dieses Skript wird von Ihnen geschrieben (Beispiele unten) und enthält die Logik zum Senden von API-/E-Mail-Nachrichten an Zammad:
sr: Као део овог новог правила, мораћете да изаберете **notification method** (*тј.* скрипту која ће се извршити кад год се правило покрене). Ову скрипту ћете доставити ви (примери су испод) и она ће садржати логику за слање API/имејл порука Zammad-у:

source: Checkmk "New Rule" dialog
de: Checkmk Dialog "New Rule"
sr: Checkmk дијалог за „New Rule“

source: Find your custom scripts in the Checkmk WATO under **Notifications > New Rule > Notification Method**.
de: Sie finden Ihre benutzerdefinierten Skripte in der Checkmk WATO unter **Notifications > New Rule > Notification Method**.
sr: Пронађите своје прилагођене скрипте у Checkmk WATO под **Notifications > New Rule > Notification Method**.

source: Once you're done setting up your new rule, you're all set! New tickets should start coming in and auto-updating any time your rule is triggered.
de: Sobald Sie Ihre neue Regel eingerichtet haben, sind Sie startklar! Neue Tickets sollten nun eingehen und jedes Mal automatisch aktualisiert werden, wenn die Regel ausgelöst wird.
sr: Када завршите са подешавањем новог правила, све је спремно! Нови тикети би требало да почну да стижу и аутоматски се освежавају сваки пут када се ваше правило окине.

source: (If you need help troubleshooting, be sure to check the :ref:`checkmk-recent-logs`.)
de: (Wenn Sie Hilfe bei der Fehlersuche benötigen, sollten Sie die :ref:`checkmk-recent-logs` überprüfen.)
sr: (Ако вам је потребна помоћ у решавању проблема, обавезно проверите :ref:`checkmk-recent-logs`.)

source: API Alerts
de: API-Warnungen
sr: API упозорења

source: To add these scripts in the Checkmk WATO, copy them into your Checkmk installation directory and make them executable. (Be sure to replace the ``zammad.example.com`` callback URL with the one found in your admin panel.)
de: Um diese Skripte in das Checkmk-WATO einzufügen, kopieren Sie sie in Ihr Checkmk-Installationsverzeichnis und machen sie ausführbar. (Stellen Sie sicher, dass Sie die Callback-URL ``zammad.example.com`` durch Ihre ersetzen, die Sie auch im Admin-Bereich finden.)
sr: Да бисте додали ове скрипте у Checkmk WATO, копирајте их у свој Checkmk инсталациони директоријум и учините их извршним. (Обавезно замените ``zammad.example.com`` URL адресу повратног позива оном која се налази у вашем администраторском панелу.)

source: Service notification
de: Service-Benachrichtigung
sr: Сервисна упозорења

source: For updates on the status of the software running on your server (*e.g.,* postgres).
de: Für Updates des Status der Software, die auf Ihrem Server läuft (*z.B.* Postgres).
sr: За свежавање статуса софтвера који ради на вашем серверу (*нпр.* postgres).

source: Host notification
de: Host-Benachrichtigung
sr: Упозорења о серверу

source: For updates on the status of the server itself.
de: Für Updates zum Status des Servers selbst.
sr: За освежавање статуса самог сервера.

source: 🤔 **What's with all the env vars?**
de: 🤔 **Was ist mit all den env vars?**
sr: 🤔 **Чему служе све ове променљиве окружења?**

source: Whenever Checkmk runs these scripts, it needs to provide some information about the event that triggered the notification. This information is passed in the form of these ``$NOTIFY_*`` environment variables.
de: Jedes Mal, wenn Checkmk diese Skripte ausführt, muss es einige Informationen über das Ereignis, das die Benachrichtigung ausgelöst hat, bereitstellen. Diese Informationen werden in Form der Umgebungsvariablen ``$NOTIFY_*`` übergeben.
sr: Кад год Checkmk покрене ове скрипте, мора да пружи неке информације о догађају који је окинуо упозорење. Ове информације се прослеђују у облику ових ``$NOTIFY_*`` променљивих из окружења.

source: You can specify additional parameters to pass to the script when you're setting up your notification rule, but the ones you see here are all provided by default.
de: Sie können beim Einrichten Ihrer Benachrichtigungsregel zusätzliche Parameter angeben, die an das Skript übergeben werden sollen, aber die hier gezeigten sind alle standardmäßig vorhanden.
sr: Можете да наведете додатне параметре које ћете проследити скрипти када прилагођавате своје правило упозорења, али они које видите овде су подразумевано обезбеђени.

source: Email Alerts
de: E-Mail-Benachrichtigungen
sr: Имејл упозорења
