Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: Zammad currently ignores user avatars. If the user is registered with e.g. Gravatar, Zammad will fetch the avatar from there if enabled. See :doc:`Zammad Image Service </settings/system/index>` for more.
de: Zammad ignoriert derzeit Benutzeravatare. Wenn der Benutzer z.B. bei Gravatar registriert ist, bezieht Zammad den Avatar von dort, falls aktiviert. Siehe :doc:`Zammad Bilder Service </settings/system/index>` für mehr.
sr: Zammad тренутно игнорише аватаре корисника. Уколико је корисник регистрован код нпр. Gravatar сервиса, Zammad ће преузети аватар одатле ако је укључено. Погледајте :doc:`Zammad услуга за слике </settings/system/index>` за више детаља.

source: Step 1 - Register a Microsoft App for Zammad
de: Schritt 1 - Registrieren einer Microsoft-App für Zammad
sr: Корак 1 - Региструјте Microsoft апликацију за Zammad

source: Login to the `Microsoft Azure Portal <https://portal.azure.com/>`_ and navigate to App registrations to create a new app. Provide the requested information as follows and register your app.
de: Melden Sie sich im `Microsoft Azure Portal <https://portal.azure.com/>`_ an und navigieren Sie zu App-Registrierungen, um eine neue App zu erstellen. Geben Sie die erforderlichen Informationen wie folgt an und registrieren Sie Ihre App.
sr: Пријавите се на `Microsoft Azure портал <https://portal.azure.com/>`_ и идите на App registrations да бисте додали нову апликацију. Наведите тражене информације на следећи начин и региструјте своју апликацију.

source: Any meaningful name fitting, this name will be displayed to users trying to authenticate with this app.
de: Wählen Sie einen aussagekräftigen Namen. Dieser wird Benutzern angezeigt, die versuchen, sich mit dieser Anwendung zu authentifizieren.
sr: Било који назив који има смисла је дозвољен, име ће бити приказано корисницима који покушавају да се аутентификују помоћу ове апликације.

source: Choose one of the above mentioned account types (see Limitations).
de: Wählen Sie einen der oben genannten Kontotypen (siehe Einschränkungen).
sr: Изаберите један од горе наведених типова налога (погледајте ограничења).

source: The correct account type depends on your use case. If you want to use the authentication internal only, choose the first option. If you're unsure, use the "Help me choose..." link.
de: Der richtige Kontotyp hängt von Ihrem Anwendungsfall ab. Wenn Sie nur die interne Authentifizierung verwenden möchten, wählen Sie die erste Option. Wenn Sie unsicher sind, verwenden Sie den Link "Hilfe bei der Auswahl...".
sr: Тачан тип налога зависи од вашег случаја коришћења. Ако желите да користите само интерну аутентификацију, изаберите прву опцију. Ако нисте сигурни, користите линк „Help me choose…“.

source: Select web and provide your callback URL. The callback URL looks like this: ``https://zammad.domain.tld/auth/microsoft_office365/callback``
de: Wählen Sie Web und geben Sie Ihre Callback-URL an. Die Callback-URL sieht wie folgt aus: ``https://zammad.domain.tld/auth/microsoft_office365/callback``
sr: Изаберите веб и наведите URL адресу повратног позива. Ваш URL повратног позива изгледа овако: ``https://zammad.domain.tld/auth/microsoft_office365/callback``

source: Screencast showing how to register a Microsoft app
de: Screencast zeigt, wie man eine Microsoft-Anwendung registriert
sr: Снимак екрана који показује како да региструјете Microsoft апликацију

source: Within **API permissions** add the following permissions:
de: Fügen Sie unter **API-Berechtigungen** die folgenden Berechtigungen hinzu:
sr: У оквиру **API permissions** додајте следеће дозволе:

source: You can find these permissions within *Microsoft Graph > Delegated permissions*.
de: Sie finden diese Berechtigungen unter *Microsoft Graph > Delegated permissions*.

source: Screencast showing how to add required API permissions
de: Screencast zeigt, wie man die erforderlichen API-Berechtigungen hinzufügt
sr: Снимак екрана који показује како да додате потребне API дозволе

source: Within **Certificates & secrets** create a new client secret. Note down the returned secret **value** for later. **Do not** use the secret ID!
de: Erstellen Sie unter **Zertifikate & Secrets** ein neues Client-Secret. Notieren Sie sich den zurückgegebenen **Wert** des Geheimnisses für später. **Verwenden Sie nicht** die geheime ID!
sr: У оквиру **Certificates & secrets** креирајте нови client secret. Забележите добијену **вредност** шифре за касније. **Немојте** користити тајни ID!

source: Screencast showing how to create a new app secret
de: Screencast zeigt, wie man ein neues Anwendungs-Secret erstellt
sr: Снимак екрана који показује како да направите нову шифру апликације

source: From **Overview** copy your apps *Application (client) ID*. If you're using a single tenant app, please also copy *Directory (tenant) ID*. You now have all required information for Zammad.
de: Kopieren Sie aus **Übersicht** die *Anwendungs-(Client-)ID* Ihrer Anwendung. Wenn Sie ein Single-Tenant-App verwenden, kopieren Sie bitte auch *Verzeichnis (Tenant) ID*. Sie haben nun alle erforderlichen Informationen für Zammad.
sr: Из **Overview** копирајте своје *Application (client) ID*. Ако користите апликацију само једног корисника, копирајте и *Directory (tenant) ID*. Сада имате све потребне информације за Zammad.

source: Screencast showing how to retreive application client and tenant IDs
de: Screencast zeigt, wie man die IDs von Client Anwendungen und Tenants abruft
sr: Снимак екрана који показује како да преузмете ID клијента и корисника апликације

source: Step 2 - Add App Credentials to Zammad
de: Schritt 2 - Hinzufügen der Anmeldedaten in Zammad
sr: Корак 2 - Додајте акредитиве апликације у Zammad

source: Navigate to *Settings > Security > Third-party Applications* within Zammad's admin settings. Scroll down to the section *Authentication via Microsoft* and fill in the required information.
de: Navigieren Sie zu *Einstellungen > Sicherheit > Anwendungen von Drittanbietern* in den Einstellungen von Zammad. Scrollen Sie nach unten zum Abschnitt *Anmelden über Microsoft* und geben Sie die erforderlichen Informationen ein.

source: This is your *Application (client) ID*.
de: Dies ist Ihre *Anwendungs-(Client-)ID*.
sr: Ово је ваш *Application (client) ID*.

source: This is your *client secret* (value).
de: Dies ist Ihr *Client Secret* (Wert).
sr: Ово је ваш *client secret* (вредност).

source: **optional** only required for apps that use account type *Accounts in this organizational directory only (Default Directory only - Single tenant).*
de: **optional** nur erforderlich für Anwendungen, die den Kontotyp *Accounts in this organizational directory only (Default Directory only - Single tenant).*
sr: **необавезно** потребно само за апликације које користе тип налога *Accounts in this organizational directory only (Default Directory only - Single tenant).*

source: Apply your settings by pressing submit and activate *Authentication via Microsoft*.
de: Übernehmen Sie Ihre Einstellungen, indem Sie auf Senden klicken und *Authentifizierung über Microsoft* aktivieren.
sr: Примените подешавања притиском на пошаљи и активирајте *Аутентификација преко Microsoft*.

source: Screencast showing how to add app credentials and activating the authentication method
de: Screencast zum Hinzufügen von Anmeldeinformationen für die Anwendung und zum Aktivieren der Authentifizierungsmethode
sr: Снимак екрана који показује како додати акредитиве апликације и активирати метод аутентификације

source: OpenID is an easy and safe way for people to reuse an existing account and user profile from an OpenID provider. Connect your OpenID provider (OP) as a single sign-on (SSO) method.
de: OpenID ist eine einfache und sichere Möglichkeit für Personen, ein bestehendes Konto und Benutzerprofil von einem OpenID-Anbieter wiederzuverwenden. Verbinden Sie Ihren OpenID-Anbieter (OP) als Single Sign-On (SSO)-Methode.
sr: OpenID је лак и једноставан начин да искористите постојећи налог и кориснички профил од OpenID провајдера. Повежите свој OpenID провајдер (OP) као метод јединствене пријаве (SSO).

source: The relying party (RP) is Zammad and the OpenID provider is a software service that you either host or subscribe to (e.g. `Keycloak <https://www.keycloak.org/>`_).
de: Die "relying party" (RP) ist Zammad und der OpenID-Provider ist ein Softwaredienst, den Sie entweder hosten oder abonnieren (z. B. `Keycloak <https://www.keycloak.org/>`_).
sr: Zammad је „relying party” (RP) а OpenID провајдер је сервис који или хостујете сами или га користите у облаку (нпр. `Keycloak <https://www.keycloak.org/>`_).

source: This guide assumes you are already using OpenID Connect within your organization (i.e. that your OP is fully set up).
de: In dieser Anleitung wird davon ausgegangen, dass Sie OpenID Connect bereits in Ihrer Organisation verwenden (d. h. dass Ihr OP vollständig eingerichtet ist).
sr: Овај водич претпоставља да већ користите OpenID Connect у својој организацији (тј. да је ваш OP у потпуности подешен).

source: The current implementation of OpenID Connect in Zammad requires OpenID Connect Discovery to simplify the configuration.
de: Die aktuelle Implementierung von OpenID Connect in Zammad erfordert OpenID Connect Discovery, um die Konfiguration zu vereinfachen.
sr: Тренутна имплементација OpenID Connect у Zammad-у захтева OpenID Connect Discovery сервис ради једноставног подешавања.

source: The connection between Zammad and your OP has to be secure. Both systems must be reachable via HTTPS. Self-signed certificates are not supported.
de: Die Verbindung zwischen Zammad und Ihrem OP muss gesichert sein. Beide Systeme müssen über HTTPS erreichbar sein. Selbstsignierte Zertifikate werden nicht unterstützt.
sr: Конекција између Zammad-а и вашег OP мора да буде сигурна. Оба система морају бити доступни преко HTTPS протокола. Самостално издати сертификати нису подржани.

source: Our instructions are based on connecting Zammad with Keycloak.
de: Unsere Anleitung basiert auf der Anbindung von Keycloak.
sr: Наша упутства су базирана на повезивању Zammad-а са Keycloak-ом.

source: PKCE is currently only supporting SHA256 as code challenge method.
de: PKCE unterstützt derzeit nur SHA256 als Code-Challenge-Methode.
sr: PKCE тренутно подржава само SHA256 као метод генерације кључа за проверу.

source: Step 1: Configure Your OP
de: Schritt 1: Konfigurieren Sie Ihren OP
sr: Корак 1: Подесите свој OP

source: Add a new Client
de: Einen neuen Client hinzufügen
sr: Додајте новог клијента

source: Create a new client in your OP with the following settings:
de: Erstellen Sie einen neuen Client in Ihrem OP mit den folgenden Einstellungen:
sr: Додајте новог клијента у вашем OP са следећим подешавањима:

source: Client ID: ``zammad`` (or any other name you prefer)
de: Client ID: ``zammad`` (oder ein anderer passender Name)
sr: ID клијента: ``zammad`` (или неки други назив ако преферирате)

source: In the **Logout settings** for the newly created client, set the **Backchannel logout URL** to ``https://your.zammad.domain/auth/openid_connect/backchannel_logout`` and switch on **Backchannel logout session required**.
de: Setzen Sie in den **Logout settings** für den neu erstellten Client die **Backchannel logout URL** auf ``https://your.zammad.domain/auth/openid_connect/backchannel_logout`` und schalten Sie die **Backchannel logout session required** ein.
sr: У **подешавањима одјаве** за ново-креираног клијента, подесите **URL адресу позадинског канала за одјаву** на ``https://your.zammad.domain/auth/openid_connect/backchannel_logout`` и укључите **захтевање позадинског канала за одјаву сесије**.

source: If you would like to use `PKCE <https://oauth.net/2/pkce/>`_, you need to switch to the **Advanced** tab and select **S256** in **Advanced settings** as the code challenge method for PKCE.
de: Wenn Sie `PKCE <https://oauth.net/2/pkce/>`_ verwenden möchten, müssen Sie auf den Tab **Erweitert** wechseln und **S256** in **Erweiterte Einstellungen** als Code-Challenge-Methode für PKCE auswählen.
sr: Уколико желите да користите `PKCE <https://oauth.net/2/pkce/>`_, мораћете да се пребаците на **Advanced** језичак и одаберете **S256** под **Advanced settings** као метод генерације PKCE кључа за проверу.

source: Step 2: Configure Zammad
de: Schritt 2: Zammad konfigurieren
sr: Корак 2: Подесите Zammad

source: Enable OpenID Connect and enter your OP's details in the Admin Panel under **Settings > Security > Third Party Applications > Authentication via OpenID Connect**:
de: Aktivieren Sie OpenID Connect und geben Sie die Daten Ihres OPs in Zammads Admin-Bereich unter **Einstellungen > Sicherheit > Anwendungen Dritter > Authentifizierung über OpenID Connect** ein:
sr: Укључите OpenID Connect и унесите детаље свог OP-а у администраторском панелу под **Подешавања > Безбедност > Апликације трећег лица > Аутентификација путем OpenID Connect**:

source: Example configuration of OpenID Connect
de: Beispielkonfiguration von OpenID Connect
sr: Пример подешавања OpenID Connect

source: Display name
de: Anzeigename
sr: Назив за приказ

source: Allows you to define a custom button name for OpenID Connect. This helps your users to understand better what the button on the login page does.
de: Ermöglicht es Ihnen, einen benutzerdefinierten Schaltflächennamen für OpenID Connect zu definieren. Dies hilft Ihren Benutzern, besser zu verstehen, was die Schaltfläche auf der Anmeldeseite bewirkt.
sr: Омогућава вам да одредите прилагођени назив дугмета за OpenID Connect. Ово помаже вашим корисницима да боље разумеју шта ради дугме на страници за пријаву.

source: Defaults to ``OpenID Connect``.
de: Die Voreinstellung ist ``OpenID Connect``.
sr: Подразумевано је ``OpenID Connect``.

source: The client ID you defined in your OP.
de: Die Client ID, die Sie in Ihrem OP definiert haben.
sr: ID клијента који сте дефинисали у вашем OP.

source: The issuer URL of your OP. Used for discovery.
de: Die Issuer-URL Ihres OPs. Wird für die Erkennung verwendet.
sr: URL адреса издавача вашег OP. Користи се за откривање подешавања.

source: UID field
de: UID-Feld
sr: UID поље

source: Here you can define an attribute that uniquely identifies the user. If unset, ``sub`` is used.
de: Hier können Sie ein Attribut definieren, das den Benutzer eindeutig identifiziert. Ist es nicht gesetzt, wird ``sub`` verwendet.
sr: Овде можете одредити назив атрибута који јединствено идентификује корисника. Уколико није подешено, биће коришћен ``sub`.

source: The scopes that Zammad should request from the OP. Defaults to ``openid``, ``email`` and ``profile``.
de: Die Scoped, die Zammad vom OP abfragen soll. Standardmäßig sind dies ``openid``, ``email`` und ``profile``.
sr: Опсези које Zammad треба да затражи од OP. Подразумевано укључује ``openid``, ``email``и ``profile``.

source: Currently only SHA256 as code challenge method is supported.
de: Derzeit wird nur SHA256 als Code-Challenge-Methode unterstützt.
sr: Тренутно је подржан само SHA256 као метод генерације кључа за проверу.

source: See :ref:`automatic account linking <automatic-account-linking>` for details on how to link existing Zammad accounts to OP accounts.
de: Siehe :ref:`Automatische Konto-Verbindung <automatic-account-linking>` für Details, wie man bestehende Zammad Konten mit OP Konten verknüpft.
sr: Погледајте :ref:`аутоматско повезивање налога <automatic-account-linking>` за детаље о томе како да повежете постојеће Zammad налоге са OP налозима.

source: Connect your SAML (Security Assertion Markup Language) identity provider as a single sign-on (SSO) method. SAML is an open standard for SSO authentication (among other things). Sign-ins are shared across multiple **service providers** and managed by a central **identity provider** (IdP).
de: Verbinden Sie Ihren SAML (Security Assertion Markup Language)-Identitätsanbieter als SSO-Methode (Single Sign-On). SAML ist ein offener Standard für die SSO-Authentifizierung (u.a.). Anmeldungen werden von mehreren **Dienstanbietern** gemeinsam genutzt und von einem zentralen **Identitätsanbieter** (Identity provider, IdP) verwaltet.
sr: Повежите Zammad са вашoм SAML (Security Assertion Markup Language) апликацијом за јединствену пријаву (SSO). SAML је отворени стандард за SSO аутентификацију (између осталог). Пријаве су подељене на више **сервисних провајдера** и њима управља централни **провајдер идентитета** (IdP).

source: In this case, the service provider is Zammad, and the IdP is a software service that you either host or subscribe to (e.g. `Keycloak <https://www.keycloak.org/>`_, `Redhat SSO Server <https://access.redhat.com/products/red-hat-single-sign-on>`_, `ADFS <https://docs.microsoft.com/en-us/windows-server/identity/active-directory-federation-services>`_, or `Okta <https://www.okta.com/>`_).
de: In diesem Fall ist der Dienstanbieter Zammad, und der IdP ist ein Softwaredienst, den Sie entweder selbst hosten oder abonnieren (z.B. `Keycloak <https://www.keycloak.org/>`_, `Redhat SSO Server <https://access.redhat.com/products/red-hat-single-sign-on>`_, `ADFS <https://docs.microsoft.com/en-us/windows-server/identity/active-directory-federation-services>`_, oder `Okta <https://www.okta.com/>`_).
sr: У овом случају, сервисни провајдер је Zammad, а IdP је софтверски сервис који или хостујете сами или се претплатите на њега (нпр. `Keycloak <https://www.keycloak.org/>`_, `Redhat SSO Server <https://access.redhat.com/products/red-hat-single-sign-on>`_, `ADFS <https://docs.microsoft.com/en-us/windows-server/identity/active-directory-federation-services>`_ или `Okta <https://www.okta.com/>` _).

source: This guide assumes you are already using SAML within your organization (i.e. that your IdP is fully set up).
de: Die Anleitung geht davon aus, dass Sie SAML bereits in Ihrer Organisation verwenden (d.h. dass Ihr IdP vollständig eingerichtet ist).
sr: Овај водич претпоставља да већ користите SAML у својој организацији (тј. да је ваш IdP у потпуности подешен).

source: Basic Configuration
de: Basis-Konfiguration
sr: Основна подешавања

source: This section describes the setup of an IdP in a general way. See :ref:`saml-guides` for setup guides for Keycloak and Microsoft SAML.
de: Dieser Abschnitt beschreibt die Einrichtung eines IdP in allgemeiner Form. Außerdem gibt es :ref:`Einrichtungsanleitungen <saml-guides>` für Keycloak und Microsoft SAML.
sr: Овај одељак описује уопштено подашавање IdP. Погледајте :ref:`saml-guides` за водич кроз подешавања Keycloak и Microsoft SAML провајдера.

source: Configure Your IdP
de: Konfigurieren Sie Ihren IdP
sr: Подесите свој IdP

source: Add Zammad as a Client/App
de: Zammad als Client/Anwendung hinzufügen
sr: Додајте Zammad као клијента/апликацију

source: Import Zammad into your IdP using the XML configuration found at ``https://your.zammad.domain/auth/saml/metadata``.
de: Importieren Sie Zammad in Ihren IdP unter Verwendung der XML-Konfiguration, die Sie unter ``https://your.zammad.domain/auth/saml/metadata`` finden.
sr: Увезите Zammad у свој IdP користећи XML конфигурацију која се налази на ``https://your.zammad.domain/auth/saml/metadata``.

source: If your IdP doesn't support XML import, you will have to configure Zammad as a new client/app manually using the above XML metadata file for reference.
de: Wenn Ihr IdP den XML-Import nicht unterstützt, müssen Sie Zammad manuell als neuen Client/App konfigurieren und dabei die oben genannte XML-Metadaten-Datei als Referenz verwenden.
sr: Уколико ваш IdP не подржава XML увоз, мораћете да подесите Zammad као новог клијента/апликацију ручно, користећи горњу XML датотеку мета података као референцу.

source: For instance, when you see this tag:
de: Wenn Sie zum Beispiel diesen Tag sehen:
sr: На пример, када видите ову ознаку:

source: Set the **Assertion Consumer Service Binding URL** (sometimes also listed as **Valid Redirect URIs**) to ``http://your.zammad.domain/auth/saml/callback``.
de: Setzen Sie die **Assertion Consumer Service Binding URL** (manchmal auch als **Valid Redirect URIs** bezeichnet) auf ``http://your.zammad.domain/auth/saml/callback``.
sr: Подесите **Assertion Consumer Service Binding URL** (понекад је наведен и као **Valid Redirect URIs**) на ``http://your.zammad.domain/auth/saml/callback``.

source: Set Up User Attribute Mapping
de: Benutzerattribut-Zuordnung einrichten
sr: Подесите мапирање корисничких атрибута

source: Zammad requests the following user attributes (or “properties”) from the IdP:
de: Zammad fordert die folgenden Benutzerattribute (oder "Eigenschaften") vom IdP an:
sr: Zammad захтева следеће корисничке атрибуте (или „properties“) од IdP-а:

source: Email address (``email``)
de: E-Mail Adresse (``email``)
sr: Имејл адреса (``email``)

source: Full name (``name``)
de: Vollständiger Name (``name``)
sr: Пуно име и презиме (``name``)

source: Given name (``first_name``)
de: Vorname (``first_name``)
sr: Име (``first_name``)

source: Family name (``last_name``)
de: Nachname (``last_name``)
sr: Презиме (``last_name``)

source: You may need to set up “mappers” (or “mappings”) to tell your IdP how user attributes in SAML correspond to those in Zammad. For a more detailed breakdown, refer to the XML metadata file referenced in the previous section.
de: Möglicherweise müssen Sie "Mapper" (oder "Mappings") einrichten, um Ihrem IdP mitzuteilen, welche Benutzerattribute in SAML mit welchen in Zammad übereinstimmen. Eine detailliertere Aufschlüsselung finden Sie in der XML-Metadaten-Datei, auf die im vorherigen Abschnitt verwiesen wurde.
sr: Можда ћете морати да подесите „mappers“ (или „mappings“) да бисте свом IdP-у рекли како кориснички атрибути у SAML-у одговарају онима у Zammad-у. За детаљнију анализу погледајте XML датотеку мета података наведену у претходном одељку.

source: Configuration Guides
de: Konfigurationsanleitung
sr: Водичи кроз подешавања

source: You can find specific configuration guides for:
de: Sie finden Konfigurationsanleitungen für:
sr: Можете пронаћи одговарајуће водиче кроз подешавања за:

source: If your are using another IdP, adapt it to your needs. For a description of the fields in Zammad, read on below.
de: Wenn Sie einen anderen IdP verwenden, passen Sie die Schritte entsprechend an. Für eine Beschreibung der Felder in Zammad lesen Sie weiter unten.
sr: Уколико користите неки други IdP, прилагодите га својим потребама. За опис поља у Zammad-у, наставите испод.

source: General Zammad Configuration
de: Allgemeine Zammad-Konfiguration
sr: Општа Zammad подешавања

source: Enable SAML and enter your IdP's details in the Admin Panel under **Settings > Security > Third Party Applications > Authentication via SAML**:
de: Aktivieren Sie SAML und geben Sie die Details Ihres IdP im Admin Bereich unter **Einstellungen > Sicherheit > Anwendungen von Drittanbietern > Anmeldung über SAML** ein:
sr: Укључите SAML и унесите детаље свог IdP-а у администраторском панелу под **Подешавања > Безбедност > Апликације трећег лица > Аутентификација путем SAML**:

source: Example configuration of SAML part 1
de: Beispielkonfiguration von SAML Teil 1
sr: Пример подешавања SAML део 1

source: Allows you to define a custom button name for SAML. This helps your users to understand better what the button on the login page does.
de: Ermöglicht es Ihnen, einen eigenen Namen für den SAML-Button zu definieren. Das kann hilfreich sein, damit Ihre Benutzer verstehen, was die Schaltfläche auf der Anmeldeseite genau bewirkt.
sr: Омогућава вам да одредите прилагођени назив дугмета за SAML. Ово помаже вашим корисницима да боље разумеју шта ради дугме на страници за пријаву.

source: Defaults to ``SAML``.
de: Die Voreinstellung ist ``SAML``.
sr: Подразумевано је ``SAML``.

source: IDP SSO target URL
de: IDP SSO Ziel-URL
sr: IDP SSO URL путања
