Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: Select the agents that are responsible for the group. These agents will then see caller log entries and call notifications fitting to said queue.
de: Wählen Sie die Agenten aus, die für die Gruppe zuständig sind. Diese Agenten sehen dann Anruferprotokolle und Anrufbenachrichtigungen, die zu dieser Warteschleife gehören.
sr: Изаберите оператере који су одговорни за групу. Ови оператери ће тада видети записе евиденције позива и обавештења о позивима која се уклапају у наведени ред.

source: Screenshot showing the caller log filter table with pre filled sample data
de: Screenshot der Anrufprotokoll-Filtertabelle mit vorausgefüllten Beispieldaten
sr: Снимак екрана који приказује табелу филтера евиденције позиваоца са унапред попуњеним примером

source: With recent logs Zammad allows you to view the latest calls for the CTI functionality. This usually comes in handy, when you're looking for errors.
de: Mit den "Aktuellsten Protokollen" ermöglicht es Zammad Ihnen, die letzten Anrufe für die CTI-Integration zu sehen. Das kann im Fehlerfall hilfreich sein.
sr: Са недавним евиденцијама Zammad вам омогућава да видите најновије позиве за CTI функцију. Ово обично добро дође када исправљате грешке.

source: Screenshot showing several incoming requests within Recent logs section.
de: Screenshot mit mehreren eingehenden Anfragen im Abschnitt "Aktuellste Protokolle".
sr: Снимак екрана који приказује неколико долазних позива у одељку Недавни уноси евиденције.

source: I'm just here to clear floats up.
de: Ich bin nur ein Hilfskonstrukt.
sr: Овде сам само да помогнем.

source: By clicking on the entry of interest, Zammad will provide more details on the call in question. You'll see the payload it received and also the response that was sent.
de: Wenn Sie auf den gewünschten Eintrag klicken, zeigt Zammad weitere Einzelheiten zu dem betreffenden Anruf an. Sie sehen dann den empfangenen Payload und die gesendete Antwort.
sr: Кликом на одговарајући унос, Zammad ће дати више детаља о позиву у питању. Видећете податке који су примљени, као и одговор који је послат.

source: Screenshot showing detailed information of a specific log entry of recent logs
de: Screenshot mit detaillierten Informationen zu einem bestimmten Protokolleintrag der Aktuellsten Protokolle
sr: Снимак екрана који приказује детаљне информације о одређеном уносу евиденције

source: My Phone page stays blank, signalling does work...
de: Meine Telefonliste bleibt leer, die Anruf-Signalisierung funktioniert...
sr: Преглед позива је празан, сигнализација ради...

source: If you've made sure that signalling works (check Recent logs) and your Caller Log still stays empty, please ensure that you only configured one CTI integration version. Specifically defining more than one agent mapping on the different integration variants will be the issue.
de: Wenn Sie sich in den "Aktuellsten Protokollen" vergewissert haben, dass die Anruf-Signalisierung funktioniert und Ihr Anruferprotokoll trotzdem leer bleibt, stellen Sie bitte sicher, dass Sie nur eine CTI-Integration konfiguriert haben. Wenn Sie mehr als eine Agentenzuordnung in verschiedenen Integrationen definieren, ist das wahrscheinlich das Problem.
sr: Ако сте се уверили да сигнализација функционише (проверите Недавне уносе евиденције) и да ваша евиденција позива и даље остаје празна, проверите да ли сте подесили само једну верзију CTI интеграције. Дефинисање више од једног оператера на различите варијанте интеграције може представљати проблем.

source: Clear the not needed agent mapping and reload your browser page.
de: Löschen Sie die Zuordnung nicht benötigter Agenten und laden Sie Ihre Browserseite neu.
sr: Обришите мапирање оператера који вам није потребан и поново учитајте страницу претраживача.

source: By mapping your agents extension to their existing Zammad users, Zammad can provide a new ticket dialog or open the user profile for the agent that picks up the call.
de: Indem Sie die Durchwahlen Ihrer Agenten den bestehenden Zammad-Benutzern zuordnen, kann Zammad einen neuen Ticket-Dialog bereitstellen oder das Benutzerprofil des Anrufers für den Agenten öffnen, der den Anruf entgegennimmt.
sr: Мапирањем локала ваших оператера на њихове постојеће Zammad кориснике, Zammad може да обезбеди дијалог новог тикета или да отвори кориснички профил за оператера који преузима позив.

source: This speeds up ticket aiding, no matter if it's for existing tickets or new ones!
de: Das beschleunigt die Bearbeitung von Tickets, egal ob es sich um bestehende oder neue Tickets handelt!
sr: Ово убрзава обраду тикета, без обзира да ли се ради о постојећим или новим тикетима!

source: To see it work from the agent's perspective, have a look on :user-docs:`user documentation </extras/caller-log.html>`.
de: Um zu sehen, wie es aus der Sicht von Agenten funktioniert, sehen Sie sich :user-docs:`Benutzerdokumentation </extras/caller-log.html>` an.
sr: Да бисте видели како функционише из перспективе оператера, погледајте :user-docs:`корисничку документацију </extras/caller-log.html>`.

source: The integration relies on Placetel's legacy product "Placetel Pro". If you use their current "Webex for Placetel" product, it doesn't work. Our `community thread <https://community.zammad.org/t/zammad-integration-missing-in-placetel/16363/9>`_ has some more information.
de: Die Integration basiert auf Placetels altem Produkt "Placetel Pro". Wenn Sie deren aktuelles Produkt "Webex for Placetel" verwenden, funktioniert es nicht. In unserem `Community-Thread <https://community.zammad.org/t/zammad-integration-missing-in-placetel/16363/9>`_ finden Sie weitere Informationen.
sr: Интеграција се ослања на застарели Placetel производ под називом „Placetel Pro”. Уколико користите њихов тренутни производ „Webex for Placetel”, неће функционисати. Наша `тема на форуму <https://community.zammad.org/t/zammad-integration-missing-in-placetel/16363/9>`_ садржи додатне информације.

source: You need an administrative Placetel account for your organization.
de: Sie benötigen ein Placetel-Administrator-Konto für Ihre Organisation.
sr: Потребан вам је администраторски Placetel налог за вашу организацију.

source: Your Zammad instance must be allowed to communicate to external services.
de: Ihre Zammad-Instanz muss mit externen Diensten zu kommunizieren können.
sr: Вашој Zammad инстанци мора бити дозвољено да комуницира са удаљеним сервисима.

source: Placetel must be able to reach your Zammad instance.
de: Placetel muss in der Lage sein, Ihre Zammad-Instanz zu erreichen.
sr: Placetel мора бити у могућности да приступи вашој Zammad инстанци.

source: Learn how to configure Placetel to enable Zammad and Placetel to communicate with each other.
de: Erfahren Sie, wie Sie Placetel konfigurieren, damit Zammad und Placetel miteinander kommunizieren können.
sr: Научите како да подесите Placetel да бисте омогућили Zammad-у и Placetel-у да међусобно комуницирају.

source: The here listed endpoint settings are relevant for the :doc:`integration configuration with Placetel <provider-configurations/placetel>`.
de: Die hier aufgeführten Endpunkt-Einstellungen sind relevant für die :doc:`Konfiguration der Placetel-Integration <provider-configurations/placetel>`.
sr: Овде наведена подешавања путање су релевантна за :doc:`подешавање Placetel интеграције <provider-configurations/placetel>`.

source: Endpoint
de: Endpunkt
sr: Путања

source: This endpoint will be required for the Zammad integration within the Placetel web interface.
de: Dieser Endpunkt wird für die Zammad-Integration innerhalb der Placetel-Weboberfläche benötigt.
sr: Ова путања ће бити потребна за Zammad интеграцију у Placetel корисничком интерфејсу.

source: You'll receive this token within the ``Web API`` menu. Make sure to copy this value, it's only shown once!
de: Dieses Token erhalten Sie im Menü ``Web API``. Achten Sie darauf, diesen Wert zu kopieren, er wird nur einmal angezeigt!
sr: Добићете овај кључ у оквиру менија ``Web API``. Обавезно копирајте ову вредност, она се приказује само једном!

source: Phone Extension to Agent Mapping
de: Zuordnung von Telefonanschlüssen zu Agenten
sr: Мапирање локала на оператере

source: Screenshot showing sample user mappings in between Placetel and Zammad
de: Screenshot mit Beispielen für Benutzerzuordnungen zwischen Placetel und Zammad
sr: Снимак екрана који приказује примере мапирања корисника између Placetel-а и Zammad-а

source: You can find your agents Placetel username combination required within ⚙️ PBX → VoIP destinations. Within the "Advanced settings" section you're looking for "SIP user name" and "SIP server".
de: Sie finden die für Ihre Agenten erforderliche Placetel-Benutzernamen-Kombination unter ⚙️ PBX → VoIP destinations. Im Abschnitt "Advanced settings" finden Sie "SIP user name" und "SIP server".
sr: Неопходну комбинацију корисничког имена за своје оператере можете пронаћи у оквиру ⚙️ PBX → VoIP destinations. У одељку „Advanced settings“ тражите „SIP user name“ и „SIP server“.

source: Combine these two like so: ``<sip-user-name>@<sip-server>``.
de: Kombinieren Sie beides wie folgt: ``<SIP-Benutzername>@<SIP-Server>``.
sr: Комбинујте ово две вредности на следећи начин: ``<sip-user-name>@<sip-server>``.

source: Sample VoIP credentials for a Placetel user
de: Beispiel für VoIP-Zugangsdaten für einen Placetel-Benutzer
sr: Пример VoIP креденцијала за Placetel корисника

source: Setup Placetel connection for Zammad
de: Placetel-Verbindung für Zammad einrichten
sr: Подесите Placetel везу за Zammad

source: This configuration step requires a *full* administrative Placetel account. You may receive forbidden error messages with Placetel in case your permissions are not high enough.
de: Dieser Konfigurationsschritt erfordert ein *vollständiges* administratives Placetel-Konto. Sie können Fehlermeldungen erhalten, wenn Ihre Berechtigungen dafür nicht ausreichen.
sr: Овај корак подешавања захтева администраторски Placetel налог *пуног приступа*. Могуће је да ћете добити поруке о грешкама забране од Placetel-а у случају да ваше дозволе нису довољно високе.

source: The following actions can be configured via the `Placetel web interface <https://web.placetel.de>`_.
de: Die folgenden Aktionen können über `Placetels Webschinterface <https://web.placetel.de>`_ konfiguriert werden.
sr: Следеће радње се могу подесити преко `Placetel корисничког интерфејса <https://web.placetel.de>`_.

source: Step 1: Activate Zammad integration
de: Schritt 1: Aktivieren der Zammad-Integration
sr: Корак 1: Активирајте Zammad интеграцију

source: Within Integrations, scroll down to Partner integrations and select Zammad.
de: Scrollen Sie innerhalb von Integrationen nach unten zu Partnerintegrationen und wählen Sie Zammad.
sr: У оквиру Integrations, скролујте надоле до Partner integrations и изаберите Zammad.

source: You can alternatively filter by "Ticket Systems" to reduce the number of entries on the page. You'll still want to look for Partner integrations. 🤓
de: Sie können alternativ nach "Ticket-Systemen" filtern, um die Anzahl der Einträge auf der Seite zu reduzieren. 🤓
sr: Алтернативно, можете филтрирати према „Ticket Systems“ да бисте смањили број уноса на страници. И даље ћете желети да потражите Partner integrations. 🤓

source: Within the Zammad integration now press "Activate". A new tab ``API`` becomes available - open this tab.
de: Innerhalb der Zammad-Integration klicken Sie nun auf "Aktivieren". Ein neuer Tab ``API`` wird verfügbar - öffnen Sie diesen Tab.
sr: У оквиру Zammad интеграције сада притисните „Activate“. Нов језичак ``API`` постаје доступан - отворите га.

source: Now tick "Enable Call Control / Notify API" and paste the Placetel endpoint from your Zammad instance into the field "URL of your API endpoint". Save to apply the settings
de: Setzen Sie nun ein Häkchen bei "Enable Call Control / Notify API" und fügen Sie den Placetel-Endpunkt aus Ihrer Zammad-Instanz in das Feld "URL of your API endpoint" ein. Speichern, um die Einstellungen zu übernehmen
sr: Сада означите „Enable Call Control / Notify API“ и налепите Placetel путању из ваше Zammad инстанце у поље „URL of your API endpoint“. Сачувајте да бисте применили подешавања.

source: Screencast showing how to activate the Zammad integration
de: Screencast, der zeigt, wie die Zammad-Integration aktiviert wird
sr: Снимак екрана који показује како да укључите Zammad интеграцију

source: Step 2: Generate API Token for Placetel
de: Schritt 2: API-Token für Placetel generieren
sr: Корак 2: Генеришите API кључ за Placetel

source: Go back to the integrations page and scroll down to "Web API". Generate a new API token by using the "Create a new API token" button.
de: Gehen Sie zurück zur Seite "Integrationen" und scrollen Sie nach unten zu "Web API". Erzeugen Sie ein neues API-Token, indem Sie die Schaltfläche "Neues API-Token erstellen" verwenden.
sr: Вратите се на страницу интеграције и померите се надоле до „Web API“. Генеришите нови API кључ помоћу дугмета „Create a new API token“.

source: If you already generated a token either use your existing token or reset it by using above mentioned button. Placetel will ask you to conform this reset.
de: Wenn Sie bereits einen Token generiert haben, verwenden Sie entweder Ihren bestehenden Token oder setzen Sie ihn mit der oben genannten Schaltfläche zurück. Placetel wird Sie auffordern, diese Rücksetzung zu bestätigen.
sr: Ако сте већ генерисали кључ или користите свој постојећи кључ или га ресетујте користећи горе поменуто дугме. Placetel ће од вас тражити да потврдите ово ресетовање.

source: Please keep in mind that existing API scripts may no longer work due to token resets!
de: Bitte beachten Sie, dass bestehende API-Skripte aufgrund der Neu-Generierung des Tokens möglicherweise nicht mehr funktionieren!
sr: Имајте на уму да постојеће API скрипте можда више неће радити због ресетовања кључа!

source: Copy the provided API token and insert it into the "API Token" field within Zammad's Placetel integration.
de: Kopieren Sie das bereitgestellte API-Token und fügen Sie es in das Feld "API Token" in der Placetel-Integration von Zammad ein.
sr: Копирајте наведени API кључ и налепите га у поље „API кључ“ у оквиру Zammad-ове Placetel интеграције.

source: Apply your changes by using the "Save" button on the bottom of the Placetel integration page and activate the Placetel integration.
de: Übernehmen Sie Ihre Änderungen über die Schaltfläche "Speichern" am unteren Rand der Placetel-Integrationsseite und aktivieren Sie die Placetel-Integration.
sr: Примените своје промене помоћу дугмета „Сачувај“ при дну странице и укључите Placetel интеграцију.

source: Screencast showing how to retrieve an API token from Placetel for Zammad
de: Screencast, der zeigt, wie man ein API-Token von Placetel für Zammad abruft
sr: Снимак екрана који показује како да преузмете API кључ са Placetel-а за Zammad

source: Step 3: Restrict the numbers to notify on
de: Schritt 3: Beschränken Sie die zu benachrichtigenden Nummern
sr: Корак 3: Ограничите бројеве за обавештавање

source: Having a lot of numbers that shouldn't be used for notifying Zammad? Within the the Integrations page of the Placetel web interface, go to "Notify API".
de: Haben Sie viele Nummern, die nicht für die Benachrichtigung in Zammad verwendet werden sollen? Gehen Sie auf der Integrations-Seite der Placetel-Weboberfläche auf "Notify API".
sr: Имате много бројева које не би требало користити за обавештавање Zammad-а? На страници Integrations корисничког интерфејса Placetel-а идите на „Notify API“.

source: Lower on the page Placetel allows you to restrict the numbers to notify on. You'll find this within the "External routing API" part.
de: Weiter unten auf der Seite ermöglicht Placetel die Einschränkung der zu benachrichtigenden Nummern. Sie finden dies im Abschnitt "External routing API".
sr: При дну на странице Placetel вам омогућава да ограничите бројеве за обавештавање. Ово ћете пронаћи у делу „External routing API“.

source: Screenshot showing a sample selection of phone numbers to use for the Placetels notify API
de: Screenshot mit einer Beispielauswahl von Telefonnummern für die Placetel Notify API
sr: Снимак екрана који приказује пример избора телефонских бројева који ће се користити за Placetel notify API

source: This menu point also provides a API request log from Placetel view. Just open "Recent responses of your API endpoint" to learn more.
de: Dieser Menüpunkt bietet auch ein API-Anfrageprotokoll aus Placetel-Sicht. Öffnen Sie einfach "Recent responses of your API endpoint", um mehr zu erfahren.
sr: Ова ставка менија такође пружа евиденцију API захтева из Placatel перспективе. Отворите „Recent responses of your API endpoint“ да бисте сазнали више.

source: If you want to see Zammad's perspective, use the "Recent Logs" part from within the Placetel integration page.
de: Wenn Sie Zammads Perspektive sehen möchten, verwenden Sie den Bereich "Aktuellste Protokolle" auf der Placetel-Integrationsseite in Zammad.
sr: Ако желите да видите Zammad-ову перспективу, користите део „Недавни уноси евиденције“ на страници за Placetel интеграцију.

source: Screenshot showing sample log entries for Placetels API calls to Zammad
de: Screenshot mit Beispielprotokolleinträgen für Placetels API-Anfragen an Zammad
sr: Снимак екрана који приказује уносе евиденција за Placetel API позиве за Zammad

source: Step 4 (optional): Further configurations for Placetel
de: Schritt 4 (optional): Weitere Konfigurationen für Placetel
sr: Корак 4 (опционо): Даља подешавања за Placetel

source: If needed, you can now configure Zammad's Placetel integration in more detail. You can learn more about your options here: :ref:`Placetel integration settings <placetel_settings>`.
de: Bei Bedarf können Sie nun die Placetel-Integration von Zammad detaillierter konfigurieren. Erfahren Sie hier mehr über Ihre Optionen :ref:`Placetel-Integrationseinstellungen <placetel_settings>`.
sr: Ако је потребно, сада можете детаљније да подесите Zammad-ову Placetel интеграцију. Можете сазнати више о опцијама у :ref:`подешавању Placetel интеграције <placetel_settings>`.

source: Setup Sipgate connection for Zammad
de: Sipgate-Verbindung für Zammad einrichten
sr: Повежите Sipgate за Zammad–ом

source: Please also note that the availability of API addons highly depends on your package trier. Usage of sipgate.io packages *is not free*, please check their `pricing page <https://www.sipgate.io/pricing>`_ before!
de: Bitte beachten Sie auch, dass die Verfügbarkeit von API-Addons stark von Ihrem Paket abhängt. Die Nutzung von sipgate.io-Paketen ist *nicht kostenlos*, bitte prüfen Sie vorher die `Preisübersicht <https://www.sipgate.io/pricing>`_ !
sr: Такође имајте на уму да доступност API додатака у великој мери зависи од вашег пакета услуга. Коришћење sipgate.io пакета *није бесплатно*, молимо проверите њихову `страницу са ценама <https://www.sipgate.io/pricing>`_ пре него што наставите!

source: Step 1: Book sipgate.io package
de: Schritt 1: Paket sipgate.io buchen
sr: Корак 1: Купите sipgate.io пакет

source: Skip to step 2 if you already have the package booked!
de: Gehen Sie zu Schritt 2, wenn Sie das Paket bereits gebucht haben!
sr: Пређите на корак 2 ако већ имате купљен пакет!

source: Login to an administrative Sipgate account and navigate to ``Accountverwaltung``. You'll see several different options depending on your booked packages. Select ``Verträge & Produkte`` to continue.
de: Loggen Sie sich in einen administrativen Sipgate-Account ein und navigieren Sie zu ``Accountverwaltung``. Abhängig von Ihren gebuchten Paketen sehen Sie verschiedene Optionen. Wählen Sie ``Verträge & Produkte`` um fortzufahren.
sr: Пријавите се на администраторски Sipgate налог и идите на ``Accountverwaltung``. Видећете неколико различитих опција у зависности од купљног пакета. Изаберите ``Verträge & Produkte`` да бисте наставили.

source: Scroll down to the section ``Zusätzliche Produkte buchen`` and look for ``sipgate.io`` - select this product by using the ``Produkte anzeigen``-Button.
de: Scrollen Sie nach unten in den Bereich ``Zusätzliche Produkte buchen`` und suchen Sie nach ``sipgate.io`` - wählen Sie dieses Produkt über den ``Produkte anzeigen``-Button aus.
sr: Скролујте надоле до одељка ``Zusätzliche Produkte buchen`` и потражите ``sipgate.io`` - изаберите овај производ помоћу дугмета ``Produkte anzeigen``.

source: On the next page select either one of the ``sipgate.io`` packages or ``Push-API Package Free``. Follow the dialogue by booking the addon. You'll be returned to your contract overview and now should see the selected addon in your list.
de: Auf der nächsten Seite wählen Sie entweder eines der ``sipgate.io`-Pakete oder ``Push-API Package Free``. Folgen Sie dem Dialog, um das Addon zu buchen. Sie gelangen zurück zu Ihrer Vertragsübersicht und sollten nun das ausgewählte Addon in Ihrer Liste sehen.
sr: На следећој страници изаберите било који од ``sipgate.io`` пакета или ``Push-API Package Free``. Пратите дијалог тако што ћете купити додатак. Бићете враћени на преглед вашег уговора и сада би требало да видите изабрани додатак на вашој листи.

source: The availability for ``sipgate.io`` packages and their levels highly depends on the overall account type and product you've booked with Sipgate.
de: Die Verfügbarkeit von ``sipgate.io``-Paketen und deren Levels hängt von der Art des Accounts und dem Produkt ab, das Sie bei Sipgate gebucht haben.
sr: Доступност пакета ``sipgate.io`` и њихови нивои у великој мери зависе од укупног типа налога и производа који сте резервисали код Sipgate-а.

source: Screencast showing the process on how to book the required sipgate.io addon
de: Screencast, der den Prozess der Buchung des benötigten sipgate.io-Addons zeigt
sr: Снимак екрана који приказује процес како да купите потребан sipgate.io додатак

source: Step 2: Configure webhook for Zammad
de: Schritt 2: Konfigurieren Sie den Webhook für Zammad
sr: Корак 2: Подесите повратни позив за Zammad

source: Within your ``Accountverwaltung`` navicate to your product ``sipgate.io``. In the newly opened tab, switch from "Clients" to "Webhooks" and paste the endpoint URLs from your Zammad instance like so:
de: Navigieren Sie innerhalb Ihrer ``Accountverwaltung`` zu Ihrem Produkt ``sipgate.io``. Wechseln Sie im neu geöffneten Tab von "Clients" zu "Webhooks" und fügen Sie die Endpunkt-URLs aus Ihrer Zammad-Instanz wie folgt ein:
sr: У оквиру вашег ``Accountverwaltung`` одељка идите на свој ``sipgate.io`` производ. У новоотвореном језичку, пребаците се са „Clients“ на „Webhooks“ и налепите URL адресе путањи са ваше Zammad инстанце на следећи начин:

source: Inbound endpoint to "Incoming"
de: Eingehender Endpunkt auf "Incoming"
sr: Долазна путања за „Incoming“

source: Outbound endpoint to "Outgoing"
de: Ausgehender Endpunkt auf "Outgoing"
sr: Одлазна путања за „Outgoing“

source: Ensure to select at least one call group or phoneline within "Sources". Other wise Sipgate will not indicate any incoming or outgoing calls to Zammad.
de: Stellen Sie sicher, dass Sie mindestens eine Rufgruppe oder Telefonleitung unter "Sources" auswählen. Andernfalls wird Sipgate keine eingehenden oder ausgehenden Anrufe an Zammad anzeigen.
sr: Обавезно изаберите најмање једну групу позива или телефонску линију у оквиру „Sources“. Иначе, Sipgate неће назначити никакве долазне или одлазне позиве Zammad-у.

source: Screencast showing how to add Zammad's endpoint URLs to sipgate.ios webhook configuration
de: Screencast, der zeigt, wie die Endpunkt-URLs von Zammad zur sipgate.ios-Webhook-Konfiguration hinzugefügt werden
sr: Снимак екрана који показује како да додате URL адресе путања Zammad-а у подешавање sipgate.io повратних позива
