Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: In Zammad you can add your own fields to tickets, users, organizations and even groups (these are called "objects"). These fields are called object attributes. This can be useful if you need to add further information to a ticket or any other object in Zammad and the information doesn't fit in any existing field.
de: In Zammad können Sie Ihre eigenen Felder zu Tickets, Benutzern, Organisationen und sogar Gruppen hinzufügen (diese werden "Objekte" genannt). Diese Felder werden als Objektattribute bezeichnet. Dies kann nützlich sein, wenn Sie weitere Informationen zu einem Ticket oder einem anderen Objekt in Zammad hinzufügen müssen und die Informationen in kein vorhandenes Feld passen.

source: Try to avoid deleting attributes (and disable them instead) as Zammad might run into unexpected conditions if they are referenced somewhere.
de: Versuchen Sie, das Löschen von Attributen zu vermeiden (und deaktivieren Sie sie stattdessen), da Zammad unvorhergesehen reagieren kann, wenn irgendwo auf sie verwiesen wird.
sr: Покушајте да избегнете брисање атрибута (и уместо тога их само искључите) јер Zammad може наићи на неочекиване услове ако се поља још увек помињу негде.

source: Here's an overview of object attributes. On the upper right you can add new attributes. By default, there will be no custom fields - standard attributes will be grayed out, you can't delete or change those. You can edit custom attributes (they are displayed in black font and have a trash bin on the right side) just by clicking on them.
de: Hier finden Sie eine Übersicht über die Objektattribute. Oben rechts können Sie neue Attribute hinzufügen. Standardmäßig gibt es keine benutzerdefinierten Felder - Standardattribute sind ausgegraut, Sie können diese nicht löschen oder ändern. Sie können benutzerdefinierte Attribute bearbeiten (sie werden in schwarzer Schrift angezeigt und haben einen Mülleimer auf der rechten Seite), indem Sie einfach auf sie klicken.
sr: Ево прегледа атрибута. У горњем десном углу можете додати нове атрибуте. Подразумевано, нема прилагођених поља – стандардни атрибути ће бити засивљени, не можете их избрисати или изменити. Кликом на прилагођене атрибуте (биће приказани регуларном бојом и имаће иконицу канте за отпатке са десне стране) можете их уредити.

source: Attributes you add to Zammad, no matter if they have default values or not, will not update existing information. This means a new ticket field technically will be empty unless you populate it.
de: Attribute, die Sie zu Zammad hinzufügen, egal ob sie Standardwerte haben oder nicht, aktualisieren bestehende Informationen (z.B. Tickets) nicht. Das bedeutet, dass ein neues Ticketfeld technisch gesehen leer sein wird, wenn Sie es nicht ausfüllen.
sr: Атрибути које додате у Zammad, без обзира да ли имају подразумеване вредности или не, неће утицати на постојеће информације. То значи да ће ново поље за тикет технички бити празно све док га не попуните.

source: Especially in ticket scope this also means that newly added attributes will be indicated as "changed" to agents that view the ticket. This may interfere with Zammad's tabs behavior.
de: Insbesondere im Ticketbereich bedeutet dies auch, dass neu hinzugefügte Attribute den Agenten, die das Ticket ansehen, als "geändert" angezeigt werden. Dies kann das Verhalten von Zammad beeinträchtigen.
sr: Посебно у оквиру тикета, ово такође значи да ће новододати атрибути бити означени као „измењени“ оператерима који прегледају тикет. Ово може да омета понашање језичака у Zammad-у.

source: Ordering Attributes
de: Anordnung der Attribute
sr: Промена редоследа атрибута

source: You can (re-)arrange the attribute order in the UI by specifying a number that Zammad uses for ordering. The relevant field is called **Position**. It even allows you to insert custom object attributes between the default attributes. In case two attributes have the same position value, Zammad will sort alphabetically by name automatically.
de: Sie können die Reihenfolge der Attribute in der Benutzeroberfläche (neu) ordnen, indem Sie eine Zahl angeben, die Zammad für die Reihenfolge verwendet. Das entsprechende Feld heißt **Position**. Sie können sogar benutzerdefinierte Objektattribute zwischen den Standardattributen einfügen. Falls zwei Attribute den gleichen Positionswert haben, sortiert Zammad automatisch alphabetisch nach Namen.

source: Please note that you cannot change the positioning of default attributes.
de: Bitte beachten Sie, dass Sie die Positionierung der Standardattribute nicht ändern können.

source: Screenshot showing custom attribute entries ordered in between default ones
de: Screenshot mit benutzerdefinierten Attributen, die zwischen den Standardattributen angeordnet sind
sr: Снимак екрана који приказује уносе прилагођених атрибута са положајем између подразумеваних атрибута

source: Updating Database After Adding or Editing Attributes
de: Aktualisierung der Datenbank nach dem Hinzufügen oder Bearbeiten von Attributen
sr: Освежавање базе података након додавања или уређивања атрибута

source: When adding or changing attributes, Zammad will not apply the changes instantly, but instead shows you the changed attributes first. If you're ready to go, just click on "Update Database" to apply the changes to Zammad. If you made a mistake or just want to discard your changes, click "Discard changes".
de: Wenn Sie Attribute hinzufügen oder ändern, übernimmt Zammad die Änderungen nicht sofort, sondern zeigt Ihnen zunächst die geänderten Attribute an. Wenn Sie fertig sind, klicken Sie einfach auf "Datenbank aktualisieren", um die Änderungen in Zammad zu übernehmen. Wenn Sie einen Fehler gemacht haben oder Ihre Änderungen einfach verwerfen wollen, klicken Sie auf "Änderungen verwerfen".
sr: Када додајете или мењате атрибуте, Zammad неће одмах применити измене, већ вам прво показује измењене атрибуте. Ако сте спремни да наставите, само кликните на „Освежи базу података“ да бисте применили промене. Ако сте погрешили или само желите да одбаците промене, кликните на „Откажи промене“.

source: After applying the changes with "Update Database", a restart of Zammad is **mandatory**. In most cases, the restart of the service works out of the box (see :docs:`console commands </admin/console/zammad-settings.html>` for more information). However, if your system is configured differently and you don't perform the restart, you may experience unexpected behavior or even errors. You may want to do this kind of configuration during maintenance windows.
de: Nach der Übernahme der Änderungen mit "Datenbank aktualisieren" ist ein Neustart von Zammad **zwingend erforderlich**. In den meisten Fällen funktioniert der Neustart des Dienstes von selbst (siehe :docs:`Konsolenbefehle </admin/console/zammad-settings.html>` für weitere Informationen). Wenn Ihr System jedoch anders konfiguriert ist und Sie den Neustart nicht durchführen, kann es zu unerwartetem Verhalten oder sogar zu Fehlern kommen. Sie sollten diese Art der Konfiguration während der Wartungsfenster durchführen.
sr: Након примене измена путем „Освежи базу података“, поновно покретање Zammad-ових сервиса је **обавезно**. У већини случајева, ово ће бити извршено аутоматски (погледајте :docs:`конзолне команде </admin/console/zammad-settings.html>` за више информација). Међутим, уколико је ваш систем подешен на нестандардан начин и не извршите поновно покретање, можете доћи у неочекивану ситуацију или чак узроковати грешке. Можда ћете желети да оваква подешавања мењате искључиво током режима одржавања.

source: Changes on objects require you to update the database to apply these changes.
de: Bei Änderungen an Objekten müssen Sie die Datenbank aktualisieren, um diese Änderungen zu übernehmen.
sr: Измене на објектима захтевају да освежите базу података да бисте применили ове измене.

source: System Attributes
de: System-Attribute
sr: Системски атрибути

source: Zammad comes with pre-configured attributes. Some of them can't be edited via UI (or at all). This is required for proper operation of Zammad and not a bug.
de: Zammad wird mit vorkonfigurierten Attributen geliefert. Einige von ihnen können nicht über die Benutzeroberfläche (oder grundsätzlich nicht) bearbeitet werden. Dies ist für den ordnungsgemäßen Betrieb von Zammad erforderlich und kein Fehler.
sr: Zammad долази са унапред конфигурисаним атрибутима. Неки од њих тренутно не пружају могућност уређивања путем корисничког интерфејса (или уопште). Ови атрибути су обавезни за исправно функционисање Zammad-а и није у питању грешка.

source: Ticket State
de: Ticket-Status
sr: Стање тикета

source: If the pre-configured states aren't enough for you or you want to change them, you can do so by clicking on the cogwheel icon in the state row in the ticket tab. But you should be careful when changing pre-configured states. This can lead to unwanted behavior in some cases.
de: Wenn Ihnen die vorkonfigurierten Status nicht ausreichen oder Sie sie ändern möchten, können Sie dies tun, indem Sie auf das Zahnradsymbol in der Statuszeile im Tab Ticket klicken. Sie sollten jedoch vorsichtig sein, wenn Sie vorkonfigurierte Status ändern. Dies kann in manchen Fällen zu unerwünschtem Verhalten führen.
sr: Уколико вам предефинисана стања нису довољна или желите да их измените, то можете урадити кликом на иконицу зупчаника у реду са атрибутом стања у језичку тикета. Али будите пажљиви кад мењате предефинисана стања. У неким случајевима ово може довести до нежељеног понашања.

source: Screenshot showing highlighted ticket state attribute
de: Screenshot mit hervorgehobenem Ticketstatus-Attribut
sr: Снимак екрана који приказује наглашен атрибут стања тикета

source: Handling of states
de: Verwalten von Status
sr: Руковање стањима

source: In the state configuration screen, you can add new states, disable states or change states.
de: Im Statuskonfigurationsbildschirm können Sie neue Status hinzufügen, deaktivieren oder ändern.
sr: У екрану подешавања стања можете додати нова стања, искључити постојећа или их изменити.

source: Screenshot showing table of default ticket states
de: Screenshot mit Tabelle der Standard-Ticketstatus
sr: Снимак екрана који приказује табелу подразумеваних стања тикета

source: The `merged` state can't be changed because it is a required system state. Otherwise, the merging of tickets would lead to errors.
de: Der Status `zusammengefasst` kann nicht geändert werden, da er ein erforderlicher Systemstatus ist. Andernfalls würde das Zusammenfassen von Tickets zu Fehlern führen.
sr: Стање `спојено` се не може изменити јер је обавезно за исправно функционисање система. У супротном, спајање тикета може довести то грешака.

source: To add a new state, click on the "New Ticket State" button in the top right corner. To change an existing state, simply click on the affected state. This opens an edit dialog.
de: Um einen neuen Status hinzuzufügen, klicken Sie auf die Schaltfläche "Neuer Ticketstatus" in der oberen rechten Ecke. Um einen bestehenden Status zu ändern, klicken Sie einfach auf den betreffenden Status. Daraufhin öffnet sich ein Bearbeitungsdialog.
sr: Да бисте додали стање, кликните на дугме „Ново стање тикета” у горњем десном углу. За измену постојећег стања, једноставно кликните на дотично стање. Ово ће отворити дијалог за уређивање.

source: You can also clone a state or set them to "Default for new tickets" or "Default for follow-ups" by clicking on the ⁝ action button and select the desired function.
de: Sie können auch einen Status klonen oder ihn als "Standard bei neuen Tickets" oder "Standard bei Rückfragen" setzen, indem Sie auf die Schaltfläche ⁝ Aktion klicken und die gewünschte Funktion auswählen.
sr: Такође можете клонирати стање или га поставити на „подразумевано за нове тикете” или „подразумевано за наставке” кликом на ⁝ дугме радњи и одабиром жељене функције.

source: *Default for new tickets* means that this state is used for every newly created ticket.
de: *Standard bei neuen Tickets* bedeutet, dass dieser Status für jedes neu erstellte Ticket verwendet wird.
sr: *Подразумевано за нове тикете* значи да ће ово стање бити коришћено за све новоотворене тикете.

source: *Default for follow-ups* means that this state is used if the ticket is re-opened after it was closed.
de: *Standard bei Rückfragen* bedeutet, dass dieser Status verwendet wird, wenn das Ticket nach seiner Schließung erneut geöffnet wird.
sr: *Подразумевано за наставке* значи да ће ово стање бити коришћено уколико се тикет поново отвори након што је био затворен.

source: Ticket state in detail
de: Ticketstatus im Detail
sr: Детаљније о стању тикета

source: Below you can find a description for each field and option. Please head over to the :ref:`example <example-state>` to see the edit dialog.
de: Nachfolgend finden Sie eine Beschreibung für jedes Feld und jede Option. Schauen Sie sich das :ref:`Beispiel <example-state>` an, um den Bearbeitungsdialog zu sehen.
sr: Испод можете пронаћи опис сваког поља и опције. Идите на :ref:`пример <example-state>` да бисте видели како изгледа дијалог за уређивање.

source: This is the name of the state and what you and your agents are seeing when choosing a state somewhere (e.g. in tickets, trigger configuration).
de: Dies ist der Name des Status und das, was Sie und Ihre Agenten sehen, wenn sie irgendwo einen Status auswählen (z. B. in Tickets, Triggerkonfiguration).
sr: Ово је назив стања и шта ви и ваши оператери видите када негде бирате стање (нпр. у тикетима, подешавању окидача).

source: There are different state types you can choose from. By default, Zammad comes with one state per state type.
de: Es gibt verschiedene Statustypen, aus denen Sie wählen können. Standardmäßig wird Zammad mit einem Status pro Statustyp ausgeliefert.
sr: Има више различитих типова стања које можете одабрати. Подразумевано, Zammad долази са једним стањем по сваком типу стања.

source: **new**: for states for tickets that are new and it hasn't been worked on them
de: **Neu**: für Tickets, die neu sind und an denen noch nicht gearbeitet wurde
sr: **ново**: за стања тикета који су нови и који још увек нису обрађени

source: **open**: for states for tickets that are in progress and agents are working on them
de: **offen**: für Tickets, die in Bearbeitung sind und an denen Agenten arbeiten
sr: **отворено**: за стања тикета који су у процесу и оператери раде на њима

source: **pending reminder**: for states for tickets that are in progress and you want to set a reminder. (default example: *pending reminder*)
de: **warten auf Erinnerung**: für Tickets, die in Bearbeitung sind und zu denen Sie eine Erinnerung bekommen möchten. (Standardbeispiel: *Warten auf Erinnerung*)
sr: **чека на подсетник**: за стања тикета који су у процесу и за које желите да поставите подсетник. (подразумевани пример: *чека на подсетник*)

source: **pending action**: for states for tickets that are waiting for a specified time and then change their state (default example: *pending close*)
de: **Anstehende Aktion**: für Tickets, die für eine bestimmte Zeit warten und dann ihren Zustand ändern (Standardbeispiel: *Warten auf Schließung*)
sr: **радња на чекању**: за стања тикета који чекају на одређено време и тада мењају своје стање (подразумевани пример: *чека на затварање*)

source: **closed**: for states for tickets that are finished and do not need to be processed further
de: **geschlossen**: für Tickets, die abgeschlossen sind und nicht weiter bearbeitet werden müssen
sr: **затворено**: за стања тикета који су обрађени и које више није неопходно процесуирати

source: ⚠️ Choosing the correct state type is important! If you are in doubt, have a look on the default states and their types!
de: ⚠️ Die Wahl des richtigen Statustyps ist wichtig! Im Zweifelsfall sollten Sie einen Blick auf die Standardstatus und ihre Typen werfen!
sr: ⚠️ Важно је одабрати исправан тип стања! Ако сумњате у свој избор, погледајте подразумевана стања и њихове типове!

source: Ignore escalation
de: Eskalation ignorieren
sr: Игнориши ескалације

source: Here you can define whether tickets of this state will count to escalation time or not.
de: Hier können Sie festlegen, ob Tickets dieses Status auf die Eskalationszeit angerechnet werden sollen oder nicht.
sr: Овде можете одредити да ли ће се тикети у овом стању рачунати за време ескалације.

source: You can create a note for the state to inform other admins about the state. This has no effect on tickets.
de: Sie können eine Notiz für den Status erstellen, um andere Administratoren über den Status zu informieren. Dies hat keine Auswirkungen auf Tickets.
sr: Можете додати напомену за стање да бисте обавестили друге администраторе о овом стању. Ово нема ефекта на тикете.

source: Set the state to *active* or *inactive*.
de: Setzen Sie den Status auf *aktiv* oder *inaktiv*.
sr: Поставите стање на *укључено* или *искључено*.

source: it is technically possible to set all states to inactive. To keep Zammad working in such a case, the inactive flag of one of the states is ignored.
de: Es ist technisch möglich, alle Status auf "inaktiv" zu setzen. Damit Zammad auch in einem solchen Fall funktioniert, wird das Inaktiv-setzen eines der Status ignoriert.
sr: Технички је могуће искључити сва стања. Да бисте обезбедили да Zammad настави да функционише, једно од искључених стања ће бити аутоматски активирано.

source: Ticket state example
de: Beispiel für einen Ticketstatus
sr: Пример стања тикета

source: Let's assume we want to create a new state which indicates that the ticket has to wait for a response of a third party (e.g. service contractor or manufacturer) and we want to to be able to set a reminder.
de: Nehmen wir an, wir möchten einen neuen Status erstellen, der anzeigt, dass das Ticket auf eine Antwort eines Dritten (z.B. eines Dienstleisters oder Herstellers) warten muss, und wir möchten eine Erinnerung setzen können.
sr: Хајде да претпоставимо да желимо да додамо ново стање који означава да тикет чека на одговор трећег лица (нпр. подизвођача или произвођача) и желимо да поставимо подсетник.

source: First we give the new state a proper name. In this example we call it "waiting for manufacturer".
de: Zunächst geben wir dem neuen Zustand einen Namen. In diesem Beispiel nennen wir ihn "Warten auf den Hersteller".
sr: Прво дајемо назив новом стању. У овом примеру називамо га „чека на произвођача”.

source: As state type we choose "pending reminder". This indicates that the ticket is still open and we can set a reminder. This reminder can be useful if our manufacturer sometimes isn't responding or we want to remind him to give us an answer.
de: Als Statustyp wählen wir "warten auf Erinnerung". Dies zeigt an, dass das Ticket noch offen ist und wir eine Erinnerung einstellen können. Diese Erinnerung kann nützlich sein, wenn unser Hersteller manchmal nicht antwortet oder wir ihn daran erinnern wollen, uns eine Antwort zu geben.
sr: Као тип стања одабиремо „чека на подсетник”. Ово означава да је тикет и даље отворен и можемо поставити подсетник. Овај подсетник може бити користан уколико наш произвођач понекад не реагује или желимо да их подсетимо за нам доставе одговор.

source: We choose "no" for "ignore escalation" because we want to escalate the tickets even if we are waiting on the manufacturer's feedback.
de: Wir wählen "nein" für "Eskalation ignorieren", weil wir die Tickets auch dann eskalieren wollen, wenn wir auf die Rückmeldung des Herstellers warten.
sr: Одабиремо „не” за „игнориши ескалације” зато што желимо да ескалирамо тикете чак иако чекамо на одговор произвођача.

source: The **result** in the creation dialog will look like this:
de: Das **Ergebnis** im Erstellungsdialog sieht dann so aus:
sr: **Резултат** у дијалогу новог тикета ће изгледати овако:

source: Screenshot showing ticket state creation dialog with example
de: Screenshot zeigt Dialog zur Erstellung eines Ticketstatus mit Beispiel
sr: Снимак екрана који приказује дијалог за додавање новог стања тикета са примером

source: Ticket Priority
de: Ticket-Priorität
sr: Приоритет тикета

source: If the pre-configured priorities aren't enough for you or you want to change them, you can do so by clicking on the cogwheel icon in the priority row in the ticket tab:
de: Wenn Ihnen die vorkonfigurierten Prioritäten nicht ausreichen oder Sie sie ändern möchten, können Sie dies tun, indem Sie auf das Zahnradsymbol in der Prioritätszeile in der Registerkarte Ticket klicken:
sr: Уколико вам предефинисани приоритети нису довољни или желите да их измените, то можете урадити кликом на иконицу зупчаника у реду са атрибутом приоритета у језичку тикета:

source: Screenshot showing highlighted ticket priority attribute
de: Screenshot mit hervorgehobenem Ticketprioritätsattribut
sr: Снимак екрана који приказује наглашен атрибут приоритета тикета

source: Handling of priorities
de: Verwalten von Prioritäten
sr: Руковање приоритетима

source: In the priority configuration screen, you can add new priorities, disable priorities or change priorities.
de: In der Ansicht für die Prioritätskonfiguration können Sie neue Prioritäten hinzufügen, deaktivieren oder ändern.
sr: У екрану подешавања приоритета можете додати нове приоритете, искључити постојеће или их изменити.

source: Screenshot showing table of default ticket priorities
de: Screenshot mit Tabelle der Standard-Ticketprioritäten
sr: Снимак екрана који приказује табелу подразумеваних приоритета тикета

source: To add a new priority, click on the "New Priority" button in the top right corner. To change an existing priority, simply click on the affected priority. This opens an edit dialog.
de: Um eine neue Priorität hinzuzufügen, klicken Sie auf die Schaltfläche "Neue Priorität" in der oberen rechten Ecke. Um eine bestehende Priorität zu ändern, klicken Sie einfach auf die betreffende Priorität. Daraufhin öffnet sich ein Bearbeitungsdialog.
sr: Да бисте додали нови приоритет, кликните на дугме „Нови приоритет” у горњем десном углу. За измену постојећег приоритета, једноставно кликните на дотични приоритет. Ово ће отворити дијалог за уређивање.

source: You can also clone a priority or set them to "Default for new tickets" by clicking on the ⁝ action button and select the desired function.
de: Sie können auch eine Priorität klonen oder sie als "Standard bei neuen Tickets" setzen, indem Sie auf die Schaltfläche ⁝ Aktion klicken und die gewünschte Funktion auswählen.
sr: Такође можете клонирати приоритет или га поставити на „подразумевано за нове тикете” кликом на ⁝ дугме радњи и одабиром жељене функције.

source: *Default for new tickets* means that this priority is used for every newly created ticket.
de: *Standard bei neuen Tickets* bedeutet, dass diese Priorität für jedes neu erstellte Ticket verwendet wird.
sr: *Подразумевано за нове тикете* значи да ће овај приоритет бити коришћен за све новоотворене тикете.

source: Priorities in detail
de: Prioritäten im Detail
sr: Детаљније о приоритетима

source: Below you can find a description for each field and option.
de: Nachfolgend finden Sie eine Beschreibung für jedes Feld und jede Option.
sr: Испод можете наћи опис сваког поља и опције.

source: This is the name of the priority and what you and your agents are seeing when choosing a priority somewhere (e.g. in tickets, trigger configuration).
de: Dies ist der Name der Priorität und das, was Sie und Ihre Agenten sehen, wenn Sie irgendwo eine Priorität auswählen (z.B. in Tickets, Trigger-Konfiguration).
sr: Ово је назив приоритета и шта ви и ваши оператери видите када негде бирате приоритет (нпр. у тикетима, подешавању окидача).

source: Highlight color
de: Highlight-Farbe
sr: Боја истицања
