Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: In the new dialog, paste *the webhook endpoint URL* from Rocket Chat into **Endpoint** field.
de: Fügen Sie im neuen Dialogfeld *die Webhook-Endpunkt-URL* von Rocket Chat in das Feld **Endpunkt** ein.
sr: У новом дијалогу налепите *Webhook endpoint URL* из Rocket Chat-а у поље **Путања**.

source: Optionally, you can set **Messaging Username** which will be used to post the Zammad notifications.
de: Optional können Sie einen **Benutzernamen** festlegen, der für die Veröffentlichung der Zammad-Benachrichtigungen verwendet werden soll.
sr: Опционо, можете да подесите **Корисничко име за поруке** које ће се користити за постављање Zammad обавештења.

source: Optionally, you can also set **Messaging Channel**, if you would like to post to a different target channel than configured in the Rocket Chat incoming integration.
de: Optional können Sie auch einen **Messaging Channel** einstellen, wenn Sie an einen anderen Zielkanal posten möchten als in der Rocket Chat Eingangsintegration konfiguriert.
sr: Опционо, такође можете да подесите **Канал за поруке**, ако желите да објављујете на каналу другачијем од онога који је подешен у Rocket Chat долазној интеграцији.

source: Configuring Rocket Chat Webhook endpoint
de: Konfigurieren des Rocket Chat Webhook-Endpunkts
sr: Подешавање путање Rocket Chat повратног позива

source: As a last step, you need to create a :doc:`Trigger <generic-notifications-trigger>` for posting a notification to the Rocket Chat channel under certain conditions.
de: Als letzten Schritt müssen Sie einen :doc:`Trigger <generic-notifications-trigger>` erstellen, um unter bestimmten Bedingungen eine Benachrichtigung an den Rocket Chat-Kanal zu senden.
sr: Као последњи корак, потребно је да направите :doc:`окидач <generic-notifications-trigger>` за постављање обавештења у Rocket Channel канал под одређеним условима.

source: From now on, whenever a ticket is created or updated in your Zammad system, a suitable notification will be posted in the configured Rocket Chat Channel. The notification will contain the link to the ticket, updated data and :ref:`content of the last article <rocket-chat-removing-article-body>`. It will also be :user-docs:`color coded </basics/service-ticket/settings/state.html#state-colors>` according to its latest state.
de: Von nun an wird jedes Mal, wenn ein Ticket in Ihrem Zammad-System erstellt oder aktualisiert wird, eine entsprechende Benachrichtigung in dem konfigurierten Rocket Chat-Kanal gepostet. Die Benachrichtigung enthält den Link zum Ticket, die aktualisierten Daten und den :ref:`Inhalt des letzten Artikels <rocket-chat-removing-article-body>`. Außerdem wird sie entsprechend ihrem letzten Status :user-docs:`farblich gekennzeichnet</basics/service-ticket/settings/state.html#state-colors>`.
sr: Од сада, кад год се тикет отвори или освежи у вашем Zammad систему, одговарајуће обавештење ће бити објављено у подешеном Rocket Chat каналу. Обавештење ће садржати линк до тикета, освежене податке и :ref:`садржај последњег чланка <rocket-chat-removing-article-body>`. Такође ће бити означен :user-docs:`бојом </basics/service-ticket/settings/state.html#state-colors>` према најновијем стању.

source: Removing Article Content from the Rocket Chat Notification
de: Entfernen des Artikelinhalts aus der Rocket Chat-Benachrichtigung
sr: Уклањање садржаја чланка из Rocket Chat обавештења

source: Custom Payload for Rocket Chat Webhook
de: Benutzerdefinierter Payload für Rocket Chat Webhook
sr: Прилагођени подаци за Rocket Chat повратни позив

source: Custom Payload with Article Content for Rocket Chat Webhook
de: Benutzerdefinierter Payload mit Artikelinhalt für Rocket Chat Webhook
sr: Прилагођени подаци са садржајем чланка за Rocket Chat повратни позив

source: Custom Payload w/o Article Content for Rocket Chat Webhook
de: Benutzerdefinierter Payload ohne Artikelinhalt für Rocket Chat Webhook
sr: Прилагођени подаци без садржаја чланка за Rocket Chat повратни позив

source: Slack Notifications
de: Benachrichtigungen für Slack
sr: Slack обавештења

source: Follow the steps below to configure a webhook for receiving Zammad notifications in a Slack channel.
de: Führen Sie die folgenden Schritte aus, um einen Webhook für den Empfang von Zammad-Benachrichtigungen in einem Slack-Kanal zu konfigurieren.
sr: Пратите доле наведене кораке да бисте подесили повратни позив за примање Zammad обавештења у Slack каналу.

source: Step 1 - Setup Incoming WebHooks App in your Slack Channel
de: Schritt 1 - Einrichten der "Incoming WebHooks App" in Ihrem Slack-Kanal
sr: Корак 1 - Подесите апликацију Incoming WebHooks у вашем Slack каналу

source: In your target Slack Channel, click on the channel name in the upper left part of the screen to get to channel details.
de: Klicken Sie im gewünschten Slack-Kanal auf den Kanalnamen im oberen linken Teil des Bildschirms, um zu den Kanaldetails zu gelangen.
sr: У вашем циљном Slack каналу кликните на назив канала у горњем левом делу екрана да бисте дошли до детаља о каналу.

source: Accessing Channel Details in a Slack Channel
de: Anzeige der Kanaldetails in einem Slack-Kanal
sr: Приступ детаљима Slack канала

source: Switch to **Integrations** tab and click on **Add an App** button.
de: Wechseln Sie zum Tab **Integrations** und klicken Sie auf die Schaltfläche **Add an App**.
sr: Пређите на језичак **Integrations** и кликните на дугме **Add an App**.

source: Adding an App to Slack Channel
de: Hinzufügen einer App zum Slack-Kanal
sr: Додавање апликације у Slack канал

source: On the next screen, search for an app called *Incoming WebHooks* and click on **Install** button next to it.
de: Suchen Sie auf dem nächsten Bildschirm nach einer Anwendung namens *Incoming WebHooks* und klicken Sie auf die Schaltfläche **Installieren** daneben.
sr: На следећем екрану потражите апликацију под називом *Incoming WebHooks* и кликните на дугме **Install** поред ње.

source: Searching for Creating Incoming Webhook Connector
de: Suche nach eingehendem Webhook-Connector
sr: Претрага за Incoming Webhook апликацију

source: You will be redirected to the Slack App Directory website, where you can add the app.
de: Sie werden auf die Website des "Slack App Directory" weitergeleitet, wo Sie die App hinzufügen können.
sr: Бићете преусмерени на веб страну Slack App Directory, где можете да додате апликацију.

source: Click on **Add to Slack** button.
de: Klicken Sie auf die Schaltfläche **Zu Slack hinzufügen**.
sr: Кликните на дугме **Add to Slack**.

source: Adding Incoming WebHooks App to Slack
de: Hinzufügen von "Incoming WebHooks App" zu Slack
sr: Додавање апликације Incoming WebHooks у Slack

source: On the next screen, in **Post to Channel** choose your channel from the list and click on **Add Incoming WebHooks integration** button.
de: Wählen Sie auf dem nächsten Bildschirm unter **Post to Channel** Ihren Channel aus der Liste aus und klicken Sie auf die Schaltfläche **Add Incoming WebHooks integration**.
sr: На следећем екрану, у **Post to Channel** изаберите свој канал из листе и кликните на дугме **Add Incoming WebHooks integration**.

source: Configuring Post to Channel Settings of Incoming WebHooks App
de: Konfigurieren von "Post to Channel"-Einstellungen der Incoming WebHooks App
sr: Подешавање поставки за објављивање у каналу апликације Incoming WebHooks

source: In the final screen, scroll down to **Integration Settings**.
de: Scrollen Sie in der letzten Ansicht nach unten zu **Integrationseinstellungen**.
sr: На последњем екрану померите се надоле до **Integration Settings**.

source: Make sure to copy **Webhook URL** to clipboard and save it for later. You can do this in one click via the **Copy URL** link shown right below the field.
de: Achten Sie darauf, die **Webhook-URL** in die Zwischenablage zu kopieren und sie für später zu speichern. Sie können dies mit einem Klick über den Link **URL kopieren** tun, der direkt unter dem Feld angezeigt wird.
sr: Обавезно копирајте **Webhook URL** у привремену меморију и сачувајте га за касније. То можете да урадите једним кликом преко везе **Copy URL** приказане одмах испод поља.

source: You can also fill **Customize Name** field with an appropriate username for the incoming webhooks integration, as this will be used for all of the notification messages in the channel.
de: Sie können im Feld **Customize Name** einen geeigneten Benutzernamen für die eingehende Webhook-Integration hinterlegen, da dieser für alle Benachrichtigungen im Kanal verwendet wird.
sr: Такође можете да попуните поље **Customize Name** одговарајућим корисничким именом за долазну интеграцију повратних позива, јер ће се то користити за све поруке обавештења у каналу.

source: Optionally, you can **Customize Icon** which will be used as the avatar.
de: Optional können Sie das **Customize Icon** anpassen, das als Avatar verwendet wird.
sr: Опционо, можете да кликнете на **Customize Icon** за подешавање сличице која ће се користити као аватар.

source: Integration Settings of Incoming WebHooks App
de: Integrationseinstellungen der Incoming WebHooks App
sr: Подешавања интеграције преко Incoming WebHooks апликације

source: Finally, save your app configuration by clicking **Save Settings**.
de: Speichern Sie abschließend Ihre App-Konfiguration, indem Sie auf **Einstellungen speichern** klicken.
sr: На крају, сачувајте подешавања апликације кликом на **Save Settings**.

source: In the subsequent modal dialog, select **Slack Notifications** as the pre-defined webhook.
de: Wählen Sie im folgenden Dialogfeld **Slack Notifications** als vordefinierten Webhook aus.
sr: У следећем модалном дијалогу изаберите **Slack обавештења** за шаблон повратног позива.

source: New Slack Notifications Pre-defined Webhook modal
de: Dialog "Neuer Webhook" für vordefinierte Slack-Benachrichtigungen
sr: Дијалог новог повратног позива по шаблону Slack обавештења

source: In the new dialog, paste **Webhook URL** from Slack App into **Endpoint** field.
de: Fügen Sie im neuen Dialogfeld die **Webhook-URL** der Slack-App in das Feld **Endpunkt** ein.
sr: У новом дијалогу, налепите **Webhook URL** из Slack апликације у поље **Путања**.

source: Configuring Slack Webhook endpoint
de: Konfigurieren des Slack Webhook-Endpunkts
sr: Подешавање путање Slack повратног позива

source: As a last step, you need to create a :doc:`Trigger <generic-notifications-trigger>` for posting a notification to the Slack channel under certain conditions.
de: Als letzten Schritt müssen Sie einen :doc:`Trigger <generic-notifications-trigger>` erstellen, um unter bestimmten Bedingungen eine Benachrichtigung an den Slack-Kanal zu senden.
sr: Као последњи корак, потребно је да направите :doc:`окидач <generic-notifications-trigger>` за постављање обавештења у Slack канал под одређеним условима.

source: From now on, whenever a ticket is escalated or has reached escalation warning in your Zammad system, a suitable notification will be posted in the configured Slack Channel. The notification will contain the link to the ticket, escalation information and :ref:`content of the last article <slack-removing-article-body>`. It will also be :user-docs:`color coded </basics/service-ticket/settings/state.html#state-colors>` according to its latest state.
de: Von nun an wird jedes Mal, wenn ein Ticket in Ihrem Zammad-System eskaliert ist oder eine Eskalationswarnung erreicht hat, eine entsprechende Benachrichtigung im konfigurierten Slack-Kanal gepostet. Die Benachrichtigung enthält den Link zum Ticket, Eskalationsinformationen und den :ref:`Inhalt des letzten Artikels <slack-removing-article-body>`. Sie wird auch entsprechend dem letzten Status :user-docs:`farblich gekennzeichnet </basics/service-ticket/settings/state.html#state-colors>`.
sr: Од сада, кад год је тикет ескалиран или је достигао упозорење о ескалацији у вашем Zammad систему, одговарајуће обавештење ће бити објављено у подешеном Slack каналу. Обавештење ће садржати линк до тикета, информације о ескалацији и :ref:`садржај последњег чланка <slack-removing-article-body>`. Такође ће бити означен :user-docs:`бојом </basics/service-ticket/settings/state.html#state-colors>` према најновијем стању.

source: Removing Article Content from the Slack Notification
de: Entfernen des Artikelinhalts aus der Slack-Benachrichtigung
sr: Уклањање садржаја чланка из Slack обавештења

source: Custom Payload for Slack Webhook
de: Benutzerdefinierter Payload für Slack Webhook
sr: Прилагођени подаци за Slack повратни позив

source: Custom Payload with Article Content for Slack Webhook
de: Benutzerdefinierter Payload mit Artikelinhalt für Slack Webhook
sr: Прилагођени подаци са садржајем чланка за Slack повратни позив

source: Custom Payload w/o Article Content for Slack Webhook
de: Benutzerdefinierter Payload ohne Artikelinhalt für Slack Webhook
sr: Прилагођени подаци без садржаја чланка за Slack повратни позив

source: Webhook Logs and Troubleshooting
de: Webhook Protokolle und Fehlerbehebung
sr: Евиденција повратних позива и решавање проблема

source: Logs
de: Protokolle
sr: Евиденција

source: Zammad provides a history of your recent webhook events, helping you monitor and debug interactions with third-party services. You can access them under **Recent Logs** in the webhook settings.
de: Zammad zeigt einen Verlauf der letzten Webhook-Ereignisse, der Ihnen hilft, Interaktionen mit Diensten von Drittanbietern zu überwachen und zu beheben. Sie können diese unter **Aktuellste Protokolle** in den Webhook-Einstellungen finden.
sr: Zammad пружа историјат ваших скорих догађаја повратних позива, олакшавајући вам мониторинг и исправљање грешака у комуникацији са сервисима трећих лица. Можете му приступити под **Недавни уноси евиденције** у подешавањима повратних позива.

source: Each log entry contains details about the webhook request and response, allowing you to troubleshoot issues. Clicking on a request link opens a detailed modal with the following information:
de: Jeder Protokolleintrag enthält Details über die Webhook-Anfrage und -Antwort, so dass Sie Probleme beheben können. Wenn Sie auf einen Link klicken, wird ein Dialog mit den folgenden Informationen geöffnet:
sr: Сваки унос евиденције садржи детаљео захтеву и одговору повратног позива, омогућавајући вам решавање проблема. Кликом на захтев отвара се дијалог са детаљима који садрже следеће информације:

source: **Direction**: Always ``out``, indicating outgoing requests from Zammad.
de: **Richtung**: Immer ``out``, was auf ausgehende Anfragen von Zammad hinweist.
sr: **Правац**: Увек ``out``, сигнализира одлазне захтеве из Zammad-а.

source: **URL**: The destination URL where Zammad sent the request.
de: **URL**: Die Ziel-URL, an die Zammad die Anfrage gesendet hat.
sr: **URL**: Циљна URL адреса на коју је Zammad послао захтев.

source: **Method**: Always ``POST``.
de: **Methode**: Immer ``POST``.
sr: **Метод**: Увек ``POST``.

source: **Status**: The HTTP status code received from the remote server. A successful request returns a ``2xx`` code.
de: **Status**: Der vom angesprochenen Server empfangene HTTP-Statuscode. Eine erfolgreiche Anfrage liefert einen ``2xx`` Code.
sr: **Статус**: HTTP статусни код примљен од удаљеног сервера. Успешан захтев враћа ``2xx`` код.

source: **Request**: Displays the HTTP request headers and payload that Zammad sent.
de: **Anfrage**: Zeigt die Header der HTTP-Anfrage und die Nutzdaten an, die Zammad gesendet hat.
sr: **Захтев**: Приказује HTTP заглавља захтева и податке које је послао Zammad.

source: **Response**: Shows the response headers from the remote server.
de: **Antwort**: Zeigt die Header der Antwort des angesprochenen Servers an.
sr: **Одговор**: Приказује заглавља одговора удаљеног сервера.

source: **Created at**: The timestamp when Zammad sent the request.
de: **Erstellt am**: Der Zeitstempel, zu dem Zammad die Anfrage gesendet hat.
sr: **Додато у**: временска ознака када је Zammad послао захтев.

source: Debugging Webhook Issues
de: Debuggen von Webhook-Problemen
sr: Исправљање грешака повратних позива

source: If a webhook fails (e.g. receiving a ``4xx`` or ``5xx`` status code), check the request and response details to diagnose the issue. Common causes include incorrect URLs, authentication errors, or server-side failures.
de: Wenn ein Webhook fehlschlägt (z.B. einen ``4xx`` oder ``5xx`` Statuscode als Antwort erhält), überprüfen Sie die Anfrage- und Antwortdetails, um das Problem zu diagnostizieren. Häufige Ursachen sind falsche URLs, Authentifizierungsfehler oder serverseitige Fehler.
sr: Уколико повратни позив не успе (нпр. пријемом ``4xx`` или ``5xx`` статусног кода), проверите детаље захтева и одговора за дијагностику проблема. Чести узроци су неисправне URL адресе, грешке при аутентификацији или грешке сервера.

source: Before deploying webhooks in production, you can use testing tools to inspect and debug requests. If you do so, make sure to exclude any sensitive or personal data.
de: Bevor Sie Webhooks in der Produktion einsetzen, können Sie Testwerkzeuge verwenden, um Anfragen zu prüfen und zu debuggen. Wenn Sie dies tun, achten Sie darauf, dass Sie keine sensiblen oder persönlichen Daten enthalten sind.
sr: Пре пуштања повратних позива у продукцију, можете користити тест алатке за инспекцију захтева и исправљање грешака. Уколико то и учините, обратите пажњу да уклоните осетљиве или личне податке.

source: The following tools/services might be helpful:
de: Die folgenden Tools/Dienste könnten hilfreich sein:
sr: Следеће алатке/сервиси могу бити од помоћи:

source: `Beeceptor <https://beeceptor.com/>`_: A free tool to capture and inspect webhook requests in real time. Set up a temporary endpoint to verify the payload structure and headers.
de: `Beeceptor <https://beeceptor.com/>`_: Ein kostenloses Tool, um Webhook-Anfragen in Echtzeit zu erfassen und zu überprüfen. Richten Sie einen temporären Endpunkt ein, um die Nutzdaten-Struktur und Header zu überprüfen.
sr: `Beeceptor <https://beeceptor.com/>`_: Бесплатан алат за пресретање и инспекцију повратних позива у реалном времену. Подесите привремену путању за проверу структуре података и заглавља.

source: `Webhook.site <https://webhook.site/>`_: Another useful alternative for real-time request logging and debugging.
de: `Webhook.site <https://webhook.site/>`_: Eine weitere nützliche Alternative für die Protokollierung und das Debugging von Echtzeit-Anfragen.
sr: `Webhook.site <https://webhook.site/>`_: Још једна корисна алтернатива за евиденцију захтева и исправљање грешака у реалном времену.

source: **🤓 A more personal payload...**
de: **🤓 Ein persönlicherer Payload...**
sr: **🤓 Подаци из личне карте...**

source: Your Zammad instance also provides an example for the default payload. This payload *does fit your installation* and includes your custom objects!
de: Ihre Zammad-Instanz liefert ein Beispiel für einen Standard-Payload mit. Dieser Payload *passt zu Ihrer Konfiguration* und enthält Ihre benutzerdefinierten Objekte!
sr: Ваша Zammad инстанца такође пружа пример за подразумеванe податке. Структура примера *одговара вашој инсталацији* и укључује ваше прилагођене објекте!

source: Example Payload provides a payload for the particular instance
de: Beispiel Payload berücksichtigt die Konfiguration für die jeweilige Instanz
sr: Пример података приказује структуру за одређену инстанцу

source: Request Headers
de: Anfrage Header
sr: Заглавља захтева

source: Zammad sends the following headers in each webhook POST request:
de: Zammad sendet die folgenden Header in jeder Webhook-POST-Anfrage:
sr: Zammad шаље следећа заглавља при сваком POST захтеву повратног позива:

source: The name of the originating trigger
de: Der Name des auslösenden Triggers
sr: Назив изворног окидача

source: A unique, random ID string
de: Eine eindeutige, zufällige Zeichenkette
sr: Јединствени, насумични ID

source: The SHA-1 hash of your HMAC-SHA1 signature token (assuming you provided one when creating your trigger)
de: Der SHA-1-Hash Ihres HMAC-SHA1-Signatur-Tokens (vorausgesetzt, Sie haben bei der Erstellung Ihres Triggers einen solchen angegeben)
sr: SHA-1 отисак вашег HMAC-SHA1 кључа за потпис (под претпоставком да сте га навели приликом додавања окидача)

source: Default JSON Payload
de: Standard-JSON-Nutzlast
sr: JSON структура подразумеваних података

source: When the webhook payload is not customized, requests will include default payload depending on the webhook type.
de: Wenn der Webhook-Payload nicht angepasst ist, enthalten die Anfragen je nach Webhook-Typ Standard-Payloads.
sr: Када подаци повратног позива нису прилагођени, захтеви ће користити подразумеване податке у зависности од типа повратног позива.

source: Regular Webhooks (example)
de: Reguläre Webhooks (Beispiel)
sr: Стандардни повратни позиви (пример)

source: For better readability, all empty and ``null`` values have been omitted from the sample payload above. That means the webhooks you receive *will include additional fields not shown here*.
de: Zur besseren Lesbarkeit wurden alle leeren und ``null`` Werte im obigen Beispiel-Payload weggelassen. Das bedeutet, dass die Webhooks, die Sie erstellen, *zusätzliche, hier nicht aufgeführte Felder enthalten*.
sr: Ради боље читљивости, све празне и ``null`` вредности су изостављене из примера података изнад. То значи да повратни позиви могу *укључивати додатна поља која нису приказана овде*.

source: Webhooks will also include fields for any relevant :doc:`custom objects </system/objects>` defined in your system.
de: Webhooks enthalten auch Felder für alle relevanten :doc:`benutzerdefinierten Objekte </system/objects>`, die in Ihrem System angelegt sind.
sr: Повратни позиви ће такође укључити поља за све релевантне :doc:`прилагођене објекте </system/objects>` дефинисане у вашем систему.

source: Attachments are *not included*; links to attachments *are* (authentication required).
de: Anhänge sind *nicht enthalten*; Links zu Anhängen *sind enthalten* (Authentifizierung erforderlich).
sr: Прилози *нису укључени*; везе до прилога *јесу* (потребна је аутентификација).

source: Linked tickets are *not included*.
de: Verknüpfte Tickets sind *nicht enthalten*.
sr: Повезани тикети *нису укључени*.

source: None of the following **user attributes** are included:
de: Keines der folgenden **Benutzerattribute** ist enthalten:
sr: Ниједан од следећих **корисничких атрибута** није укључен:

source: Pre-defined Webhooks
de: Vordefinierte Webhooks
sr: Повратни позиви по шаблону

source: Each pre-defined webhook template provides a special payload designed for a particular service. See :doc:`/manage/webhook/examples` for more information.
de: Jede vordefinierte Webhook-Vorlage bietet einen speziellen Payload für einen bestimmten Dienst. Siehe :doc:`/manage/webhook/examples` für weitere Informationen.
sr: Сваки шаблон повратног позива садржи посебну структуру података, дизајнирану за одређен сервис. Погледајте :doc:`примере </manage/webhook/examples>` за више информација.

source: Composer Settings
de: Editor-Einstellungen
sr: Подешавања уредника текста

source: In the composer settings, you can adjust different settings regarding handling of text and articles. Open the settings by clicking the cogwheel in the top right corner of the ticket detail view.
de: In den Editor-Einstellungen können Sie verschiedene Einstellungen zur Behandlung von Texten und Artikeln vornehmen. Öffnen Sie die Einstellungen, indem Sie auf das Zahnrad in der oberen rechten Ecke der Ticket Detailansicht klicken.
sr: У подешавању уредника можете изменити различита подешавања у вези обраде текста и чланака. Отворите подешавања кликом на зупчаник у горњем десном углу детаљног приказа тикета.
