Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: When cloning, text modules with all attributes are duplicated and can be edited later.
de: Beim Klonen werden die Textbausteine mit allen Attributen dupliziert und können später bearbeitet werden.
sr: Приликом клонирања, текстуални исечци са свим атрибутима се дуплирају и могу се касније уређивати.

source: Import of Text Modules via CSV File
de: Import von Textbausteinen über eine CSV-Datei
sr: Увоз текстуалних исечака преко CSV датотеке

source: With the import action you can download a sample CSV file and upload your own CSV file.
de: Beim Import von Textmodulen können Sie eine Beispiel-CSV-Datei herunterladen und Ihre eigene CSV-Datei auf Basis der Beispieldatei hochladen.
sr: Са акцијом увоза можете преузети пример CSV датотеке и отпремити сопствену CSV датотеку.

source: To reduce the error rate of unwanted mass changes, a test import is carried out first and a summary appears at the end. If you agree with the summary, the CSV import will be executed.
de: Um die Fehlerquote (z.B. durch unbeabsichtigtes Ändern bestehender Vorlagen) zu reduzieren, wird zunächst ein Testimport durchgeführt und am Ende eine Zusammenfassung angezeigt. Wenn Sie mit der Zusammenfassung einverstanden sind, wird der CSV-Import durchgeführt.
sr: Да би се смањила стопа грешака нежељених промена при масовној радњи, прво се врши пробни увоз и на крају се приказује резиме. Ако се слажете са резимеом, CSV увоз ће бити извршен.

source: Time Accounting
de: Zeiterfassung
sr: Обрачун времена

source: If you want to know how much time you need for each project or ticket, enable the time accounting (turn on the switch on the top left side of the page).
de: Wenn Sie wissen möchten, wie viel Zeit Sie für ein Projekt oder Ticket benötigen, aktivieren Sie die Zeiterfassung (Schalter oben links auf der Seite).
sr: Ако желите да знате колико вам је времена потребно за сваки ваш пројекат или тикет, омогућите обрачун времена (укључите прекидач у горњем левом углу стране).

source: Time Accounting Management Screen in Zammad
de: Verwaltung der Zeiterfassung in Zammad
sr: Екран за управљање обрачуном времена у Zammad-у

source: How it Works
de: Wie es funktioniert
sr: Како то тачно ради

source: Zammad's time accounting uses ticket **Selector** (filter) to check if a ticket is considered for the time accounting or not. If a ticket is applicable, Zammad will request the agent to provide how much time was needed to process the current ticket step.
de: In Zammads Zeiterfassung wird ein **Selektor** (Filter) verwendet, um zu prüfen, ob ein Ticket für die Zeiterfassung in Frage kommt oder nicht. Falls zutreffend fragt Zammad den Agent nach dem Aktualisieren des Tickets, wie viel Zeit für die Bearbeitung benötigt wurde.
sr: Zammad-ов обрачун времена користи **избор услова** тикет (филтер) да провери да ли се тикет узима у обзир за обрачун времена или не. Ако је обрачун применљив на тикет, Zammad ће захтевати од оператера да унесе колико је времена било потребно за обраду тренутног корака тикета.

source: In order for Zammad to bring up the time accounting dialog to an agent, the agent has to update the ticket together with an article of any type. The article part is mandatory.
de: Damit Zammad den Zeiterfassungsdialog für einen Agenten aufruft, muss der Agent einen Artikel beliebigen Typs aktualisieren/erstellen. Das Ändern/Hinzufügen eines Artikels ist zwingende Voraussetzung.
sr: Да би Zammad приказао дијалог обрачуна времена оператеру, оператер мора да освежи тикет заједно са чланком било ког типа. Чланак је обавезан.

source: However, the time accounting dialog is not mandatory and can be canceled by your agents if needed. You cannot enforce time accounting.
de: Der Zeiterfassungsdialog ist jedoch nicht zwingend und kann bei Bedarf von Ihren Mitarbeitern abgebrochen werden. Sie können die Zeiterfassung nicht erzwingen.
sr: Међутим, дијалог за обрачун времена није обавезан и ваши оператери га могу поништити ако је неопходно. Не можете приморати обрачун времена.

source: If a ticket is no longer considered for the time accounting, the already accounted time will be preserved.
de: Wenn ein Ticket nicht mehr für die Zeiterfassung berücksichtigt wird, bleibt die bereits erfasste Zeit erhalten.
sr: Ако се тикет више не узима у обзир за обрачун времена, већ обрачунато време ће бити сачувано.

source: The selector applies to the ticket state before any attribute changes have been saved. That means if your agent is e.g. going to close a ticket alongside writing an article, the ticket selector has to match the ticket state before closing for the time accounting dialog to appear.
de: Die Auswahl wird auf den Ticketstatus angewendet, bevor die Attributänderungen gespeichert wurden. Das bedeutet, wenn Ihr Mitarbeiter z.B. ein Ticket schließt, nachdem er einen Artikel erstellt hat, muss die Auswahl mit dem Ticketstatus vor dem Schließen übereinstimmen, damit der Zeiterfasungsdialog erscheint.
sr: Избор услова се примењује на стање тикета пре него што се сачувају било какве промене атрибута. То значи да ако је ваш оператер нпр. хтео да затвори тикет упоредо са писањем чланка, избор услова тикета мора да се подудара са стањем тикета пре затварања да би се појавио дијалог за обрачун времена.

source: Time Accounting Ticket Selector
de: Ticketauswahl für Zeiterfassung
sr: Обрачун времена

source: By default, agents account time as a unitless numerical input. However, it is possible to show a specific unit by configuring **Unit** setting, which provides several options:
de: Standardmäßig geben Agenten die Zeit als einheitenlosen Wert an. Es ist jedoch möglich, eine bestimmte Einheit anzuzeigen, indem Sie die Einstellung **Einheit** konfigurieren, die mehrere Optionen bietet:
sr: Подразумевано, оператери обрачунавају време као нумерички унос без јединица. Међутим, могуће је приказати одређену јединицу подешавањем **Јединица**, које нуди неколико опција:

source: no unit
de: keine Einheit
sr: без јединице

source: Default behavior, no unit is shown next to the time value.
de: Standardverhalten, keine Einheit wird neben dem Zeitwert angezeigt.
sr: Подразумевано понашање, јединица се не приказује поред вредности времена.

source: hour(s)
de: Stunde(n)
sr: сат(а)

source: Shows ``hour(s)`` as the unit next to the time value.
de: Zeigt ``Stunde(n)`` als Einheit neben dem Zeitwert an.
sr: Приказује ``сат(а)`` као јединицу поред вредности времена.

source: quarter-hour(s)
de: Viertelstunde(n)
sr: четврт сат(а)

source: Shows ``quarter-hour(s)`` as the unit next to the time value.
de: Zeigt ``Viertelstunde(n)`` als Einheit neben dem Zeitwert an.
sr: Приказује ``четврт сат(а)`` као јединицу поред вредности времена.

source: minute(s)
de: Minute(n)
sr: минут(а)

source: Shows ``minute(s)`` as the unit next to the time value.
de: Zeigt ``Minute(n)`` als Einheit neben dem Zeitwert an.
sr: Приказује ``минут(а)`` као јединицу поред временске вредности.

source: custom unit
de: Eigene Einheit
sr: прилагођена јединица

source: Shows a custom unit that can be specified as free input.
de: Zeigt eine benutzerdefinierte Einheit an, die als freie Eingabe angegeben werden kann.
sr: Приказује прилагођену јединицу која се може навести као слободан унос.

source: Time Accounting Unit
de: Zeiterfassungs-Einheit
sr: Јединица обрачунатог времена

source: The configurable time accounting unit is used only for display!
de: Die konfigurierbare Einheit wird nur zur Anzeige verwendet!
sr: Подешавање јединице за обрачун времена се користи само за приказ!

source: No numerical transformation will be applied to the values, the unit is merely used to indicate to the agents in which units their time is accounted. The original time values will be preserved.
de: Es wird keine Umrechnung o.ä. vorgenommen. Die Einheit wird lediglich verwendet, um den Agenten anzuzeigen, in welchen Einheiten ihre Zeit abgerechnet wird. Die ursprünglichen Zeitwerte werden beibehalten.
sr: На вредности се неће применити никаква нумеричка трансформација, јединица се само користи да укаже оператерима у којим јединицама се рачуна њихово време. Оригиналне временске вредности ће бити сачуване.

source: Time Accounting Unit when Recording
de: Zeiteinheit bei der Zeiterfassung
sr: Јединица обрачунатог времена приликом снимања

source: Activity Types
de: Aktivitäts-Typen
sr: Врсте активности

source: **Activity Types** can be used to group the different ticket time accounting entries together. For example, entries that are relevant to a "Billing" type.
de: Mit Hilfe von **Aktivitäts-Typen** können die verschiedenen Zeiterfassungseinträge für Tickets zusammengefasst werden. Zum Beispiel Einträge, die für die "Abrechnung" relevant sind.
sr: **Врсте активности** се могу користити за груписање сличних записа обрачуна времена. На пример, сви записи који се односе на „Billing”.

source: Time Accounting Activity Types
de: Zeiterfassung Aktivitäts-Typen
sr: Врсте активности обрачунатог времена

source: When you enable the recording of the **Activity Type**, the agents will be able to select a type from this list.
de: Wenn Sie die Erfassung der **Aktivitäts-Typen** aktivieren, können die Agenten einen Typ aus einer Liste auswählen.
sr: Када омогућите снимање **Врста активности**, оператери ће моћи да изаберу врсту из ове листе.

source: Time Accounting Activity Type Selection for Agents
de: Aktivitätstypen der Zeiterfassung für Agenten
sr: Избор врсте активности обрачуна времена за оператере

source: Additionally, a column with an associated activity type will be rendered for an entry in the **Activity** table under the **Accounted Time** tab.
de: Zusätzlich wird eine Spalte mit dem erfassten Aktivitäts-Typ für jeden Eintrag in der Tabelle Aktivität im Tab Zeiterfassung angezeigt.
sr: Поред тога, колона са повезаном врстом активности биће приказана за сваки унос у табели **Активност** у језичку **Обрачунато време**.

source: You can manage available activity types in this screen like any other Zammad object. Only active types will be available for the selection when recording new times. If an activity type has accounted time, it is still displayed in tickets and included in the accounted time overview.
de: Sie können die verfügbaren Aktivitäts-Typen in dieser Ansicht wie jedes andere Zammad-Objekt verwalten. Bei der Erfassung neuer Zeiten stehen nur aktive Typen zur Auswahl. Hat ein Aktivitäts-Typ aufgezeichnete Zeit, wird sie weiterhin in Tickets angezeigt und ist in der Übersicht der erfassten Zeiten enthalten.
sr: Можете управљати доступним врстама активности на овом екрану као за сваки други Zammad објекат. Само активне врсте ће бити доступне за избор приликом снимања нових времена. Уколико врста активности има обрачунато време, и даље је приказано у тикетима и укључено у преглед обрачуна времена.

source: New Time Accounting Activity Type Dialog
de: Dialog Neuer Aktivitäts-Typ in Zeiterfassung
sr: Дијалог нове врсте активности обрачуна времена

source: Activity types can be set as default, and in that case they will be pre-selected for the agents when they are asked to account their time. It is also possible to unset default activity type, in which case no type will be pre-selected and the agents can make their choice.
de: Ein Aktivitäts-Typ kann als Standard eingestellt werden und ist dann bei der Erfassung vorausgewählt. Es ist möglich, den Standard-Typ zu deaktivieren. In diesem Fall wird keine Vorauswahl bei der Zeiterfassung getroffen.
sr: Врсте активности се могу поставити као подразумеване, и у том случају оне ће бити унапред одабране за оператере када се од њих тражи да обрачунају своје време. Такође је могуће поништити подразумевану врсту активности, у ком случају ниједна врста неће бити унапред одабрана и оператери могу сами да је изаберу.

source: Accounted Time
de: Erfasste Zeit
sr: Обрачунато време

source: Under the **Accounted Time** tab, Zammad provides a section for reviewing all accounted times for your tickets. Accounted times are displayed per years and months.
de: Unter der Registerkarte **Berechnete Zeit** bietet Zammad einen Bereich, in dem Sie alle erfassten Zeiten für Ihre Tickets einsehen können. Die erfassten Zeiten werden nach Jahren und Monaten gruppiert angezeigt.
sr: У језичку **Обрачнутао време**, Zammad пружа одељак за преглед свих обрачунатих времена ваших тикета. Обрачуната времена су приказана по годинама и месецима.

source: If you have tickets that are overlapping several months, you can differentiate by *time units* and *time units total* (e.g. to allow partial billing) in the downloaded file.
de: Wenn Sie Tickets haben, die sich über mehrere Monate erstrecken, können Sie in der heruntergeladenen Datei nach *time unit* und *time units total* differenzieren (z.B. um eine Teilabrechnung zu ermöglichen).
sr: Уколико имате тикете који се преклапају више месеци, можете разликовати *временске јединице* и *укупне временске јединице* (нпр. за делимичну наплату) у преузетој датотеци.

source: Select the right month
de: Wählen Sie den richtigen Monat
sr: Изаберите одговарајући месец

source: Usually you want to bill accounted time of other months than the current one. Just select the relevant year and month to receive the accounted times and ticket information.
de: Vermutlich wollen Sie die erfassten Zeiten anderer Monate als die des aktuellen Monats abrechnen. Wählen Sie dazu das entsprechende Jahr und den Monat aus, um die erfassten Zeiten und Ticketinformationen des gewünschten Monats zu erhalten.
sr: Обично желите да обрачунате време у другим месецима од тренутног. Само изаберите одговарајућу годину и месец да бисте добили обрачуната времена и информације о тикете.

source: Screenshot showing a selection for year and month on time accounting
de: Screenshot mit einer Auswahl für Jahr und Monat in der Zeiterfassungs-Übersicht
sr: Снимак екрана који приказује избор за годишњи и месечни обрачун времена

source: Tickets and their accounted time
de: Tickets und deren erfasste Zeit
sr: Тикети и њихово обрачунато време

source: Zammad allows you to receive the accounted information just like you need them. For this you currently have four options to review and also download the relevant data as CSV.
de: Sie können die erfassten Zeiten in Zammad so bekommen, wie Sie sie benötigen. Dazu haben Sie aktuell vier Möglichkeiten einschließlich einem CSV-Download.
sr: Zammad вам омогућава да добијете информације обрачуна баш онако како су вам потребне. За ово тренутно имате четири опције за преглед и преузимање релевантних података као CSV.

source: To download the CSV data, use the download button right next to each heading (e.g. "Ticket").
de: Um die CSV-Daten herunterzuladen, verwenden Sie die Download-Schaltfläche direkt neben der jeweiligen Überschrift (z.B. "Ticket").
sr: Да бисте преузели CSV датотеку, користите дугме за преузимање одмах поред сваког наслова (нпр. „Тикет“).

source: This can also be automated with API calls.
de: Dies kann auch durch API-Aufrufe automatisiert werden.
sr: Ово такође можете бити аутоматизовано помоћу API позива.

source: Only the first 20 entries are shown for each table. To see all of them, simply download the records in CSV.
de: In jeder Tabelle werden nur die ersten 20 Einträge angezeigt. Um alle Einträge zu sehen, laden Sie sich die Datensätze im CSV-Format herunter.
sr: За сваку табелу је приказано само првих 20 уноса. Да бисте их све видели, једноставно преузмите записе у CSV формату.

source: Activity
de: Aktivität
sr: Активност

source: This filter works similar to the ticket filter, with one exception: You'll find each *individual* time accounting step of your agents. This is what you'd also see in the ticket's history before Zammad 5.2.
de: Dieser Filter funktioniert ähnlich wie der Ticketfilter, mit einer Ausnahme: Sie finden hier jede *einzelne* Zeiterfassungsposition Ihrer Bearbeiter. Das ist das, was Sie auch in der Ticket-Historie vor Zammad 5.2 sehen konnten.
sr: Овај филтер функционише слично филтеру тикета, са једним изузетком: наћи ћете сваки *појединачни* корак обрачуна времена ваших оператера. Ово је оно што бисте такође видели у историјату тикета пре Zammad верзије 5.2.

source: In this list you'll see the following ticket information:
de: In dieser Liste finden Sie die folgenden Ticketinformationen:
sr: У овој листи ћете видети следеће информације о тикетима:

source: Number
de: Nummer
sr: Број

source: Customer
de: Kunde
sr: Клијент

source: Organization of customer (if applicable)
de: Organisation des Kunden (falls zutreffend)
sr: Организација клијента (ако постоји)

source: Agent that accounted the time
de: Agent, der Zeit erfasst hat
sr: Оператер који је обрачунао време

source: Time units accounted in the current activity
de: In der Aktivität verbuchte Zeiteinheiten
sr: Јединице времена урачунате у текућу активност

source: Activity type (if enabled)
de: Aktivitäts-Typ (falls aktiviert)
sr: Врста активности (ако је укључено)

source: Created at
de: Erstellt am
sr: Додато у

source: This filter contains all relevant tickets from the selected month.
de: Dieser Filter enthält alle relevanten Tickets aus dem ausgewählten Monat.
sr: Овај филтер садржи све релевантне тикете из одабраног месеца.

source: Agent currently assigned (ticket owner)
de: Derzeit zugewiesener Agent (Besitzer)
sr: Тренутно додељени оператер (власник тикета)

source: Time units accounted in the current month
de: Im laufenden Monat verbuchte Zeiteinheiten
sr: Обрачунате јединице времена у текућем месецу

source: Time units total (time accounted during ticket life)
de: Zeiteinheiten insgesamt (während der Ticketlaufzeit verbuchte Zeit)
sr: Укупне временске јединице (време обрачунато током трајања тикета)

source: Closed at (if applicable)
de: Geschlossen am (falls zutreffend)
sr: Затворено у (ако постоји)

source: This provides you a per user filter on accounted time units. Each user has a total of time accounted in the current month (over all applicable tickets).
de: Dies bietet Ihnen einen Filter für die verbuchten Zeiteinheiten pro Benutzer. Jeder Benutzer hat eine Gesamtzeit, die im aktuellen Monat verbucht wurde (aus allen Tickets).
sr: Ово вам пружа филтер по кориснику за обрачунате временске јединице. Сваки корисник има обрачунато укупно време у текућем месецу (за све тикете који се подударају).

source: Organization
de: Organisation
sr: Организација

source: This provides a list of all organizations where customers have caused accounted time in that month.
de: Hier finden Sie eine Liste aller Organisationen, bei denen Kunden in diesem Monat eine Zeiterfassung verursacht haben.
sr: Ово пружа листу свих организација у којима су клијенти изазвали обрачунато време у том месецу.

source: You can also see entries for customers that are part of a primary organization. Users without an organization can be found in the Customer filter.
de: Sie können auch Einträge für Kunden sehen, die Teil einer primären Organisation sind. Benutzer ohne Organisation finden Sie im Kundenfilter.
sr: Такође можете видети уносе за клијенте који су део примарне организације. Корисници без организације могу се наћи у филтеру за клијенте.

source: Triggers
de: Trigger
sr: Окидачи

source: Use triggers to set up all kinds of **if-this-then-that** automation workflows. For time-based or recurring automation workflows, try :doc:`schedulers </manage/scheduler>` instead.
de: Verwenden Sie Trigger, um alle Arten von **wenn-dies-dann-das** Automatisierungen einzurichten Für zeitbasierte oder wiederkehrende Automatisierungen sollten Sie stattdessen die :doc:`Automatisierung </manage/scheduler>` verwenden.
sr: Користите окидаче да бисте поставили токове аутоматизације типа **ако-ово-онда-оно**. За временске или честе токове аутоматизације, пробајте :doc:`планере </manage/scheduler>` уместо овога.

source: The first thing to know about triggers is that **you're already using them**. From the moment you set up Zammad, it starts sending auto-replies to all incoming emails. Recognize this line?
de: Das erste, was Sie über Trigger wissen sollten, ist, dass **Sie diese bereits verwenden**. Sobald Sie Zammad eingerichtet haben, werden automatische Antworten auf alle eingehenden E-Mails gesendet. Erkennen Sie den Text?
sr: Прва ствар коју треба знати о окидачима је да их **већ користите**. Од тренутка када подесите Zammad, он почиње да шаље аутоматске одговоре на све долазне имејл поруке. Да ли препознајете ову поруку?

source: Screenshot of auto-reply notification in ticket view
de: Screenshot der Auto-Antwort-Benachrichtigung in der Ticketansicht
sr: Снимак екрана обавештења о аутоматском одговору у приказу тикета

source: It means that the ticket is from an incoming customer email and that the customer received this message in response:
de: Es bedeutet, dass das Ticket von einer eingehenden Kunden-E-Mail stammt und dass der Kunde diese Nachricht als Antwort erhalten hat:
sr: То значи да је тикет направљен од долазне имејл поруке клијента и да је клијент добио ову поруку као одговор:

source: Screenshot of auto-reply in customer's inbox
de: Screenshot einer automatischen Antwort im Posteingang des Kunden
sr: Снимак екрана аутоматског одговора у пријемном сандучету клијента

source: This auto-reply message is a **trigger**. You can disable it, modify it, or create new ones for all sorts of automation tasks on the Trigger page of the admin panel:
de: Diese automatische Antwort ist ein **Trigger**. Sie können Trigger deaktivieren, ändern oder neue "Trigger" im Verwaltungsbereich erstellen:
sr: Ова порука са аутоматским одговором је **окидач**. Можете га онемогућити, изменити или додати нове за све врсте задатака аутоматизације на страници окидача у административном панелу:

source: Screenshot of “Triggers” page in admin panel
de: Screenshot der "Trigger" in den Einstellungen
sr: Снимак екрана странице „Окидачи“ у административном панелу

source: How Do Triggers Work
de: Wie funktionieren Trigger

source: Triggers consist of three parts:
de: Trigger bestehen aus drei Teilen:
sr: Окидачи се састоје од три дела:

source: **Activators:** define "when the question is asked?"
de: **Aktivatoren:** Definieren "wann die Frage gestellt wird?"
sr: **Извршиоци:** одређују „када се поставља питање?”

source: **Conditions:** answer the question "when should this trigger fire?"
de: **Bedingungen:** beantworten die Frage "Wann soll dieser Trigger ausgelöst werden?"
sr: **Услови:** одговарају на питање „када треба извршити окидач?”

source: **Actions:** answer the question "what should happen when it does?"
de: **Aktionen:** Beantworten die Frage "Was soll bei der Ausführung passieren?"
sr: **Радње:** одговарају на питање „шта треба да се деси по извршавању?”

source: Triggers are evaluated in alphabetical order by **name.** In some situations, triggers might be the wrong choice, see :doc:`/manage/trigger/limitations` for more information.
de: Trigger werden in alphabetischer Reihenfolge nach ihrem **Namen** ausgeführt. In manchen Situationen können Trigger jedoch die falsche Wahl sein, siehe :doc:`/manage/trigger/limitations` für weitere Informationen.
sr: Окидачи се извршавају по абецедном реду, према **називу.** У неким ситуацијама окидачи могу бити погрешан избор, погледајте :doc:`ограничења </manage/trigger/limitations>` за више информација.

source: **🤓 Emails can adjust some behavior on their own**
de: **🤓 E-Mails können einige Verhaltensweisen selbständig auslösen**
sr: **🤓 Имејл окидачи могу утицати на нека своја понашања**

source: See :doc:`/channels/email/email-headers` for more information.
de: Siehe :doc:`/channels/email/email-headers` für weitere Informationen.
sr: Погледајте :doc:`овде </channels/email/email-headers>` за више информација.

source: Activators
de: Aktivierung
sr: Активација

source: Triggers support two types of activators:
de: Trigger unterstützen zwei Arten von Aktivierungen:
sr: Окидачи подржавају две врсте активације:
