Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: The main section of the screen holds a table where you can find all available writing tools. The table includes the name of the tool, an optional description in the **Note** column as well as an information about an optional limitation to specific groups.
de: Der Hauptbereich enthält eine Tabelle, in der Sie alle verfügbaren Schreibassistent-Werkzeuge finden können. Die Tabelle enthält den Namen des Werkzeugs, eine optionale Beschreibung in der Spalte **Notiz** sowie die Information über eine optionale Beschränkung auf bestimmte Gruppen.

source: You can **Clone** or **Delete** existing tools via ︙ action menu. To edit a tool, simply click on its row. To add a new one, click the ``New Writing Assistant Tool`` button in the header. Use cases for such individual tools could be:
de: Sie können vorhandene Werkzeuge **Klonen** oder **Löschen** über das Aktionsmenü ︙. Um ein Werkzeug zu bearbeiten, klicken Sie einfach auf dessen Zeile. Um ein neues Werkzeug hinzuzufügen, klicken Sie auf die Schaltfläche ``Neues Schreibassistent-Werkzeug`` in der Kopfzeile. Anwendungsfälle für solche individuellen Werkzeuge können zum Beispiel sein:

source: Translation
de: Übersetzung

source: Apply company and/or sector specific wording
de: Unternehmens- und/oder branchenspezifische Formulierungen anwenden

source: Change the mood of the text
de: Die Stimmung eines Textes ändern

source: Reduce or eliminate subjective or uninformative parts
de: Subjektive oder nicht informative Bestandteile reduzieren oder entfernen

source: Combine different instructions in one tool
de: Kombinieren verschiedener Anweisungen in einem Werkzeug

source: Configuration
de: Konfiguration
sr: Подешавања

source: Adding or editing a tool opens a dialog where you can configure it. If you want to add a new tool, consider cloning an existing one to have a good starting point. Read on for an explanation of each field.
de: Wenn Sie ein Werkzeug hinzufügen oder bearbeiten, öffnet sich ein Dialog, in dem Sie die Konfiguration vornehmen können. Wenn Sie ein neues Werkzeug hinzufügen möchten, können Sie ein bestehendes klonen, um eine gute Grundlage zu haben. Lesen Sie weiter, um eine Beschreibung der einzelnen Felder zu sehen.

source: Add a name for the write assistant tool. This is what your agents see when they access the write assistant tools.
de: **Name**: Fügen Sie einen Namen für das Schreibassistent-Werkzeug hinzu. Dies ist das, was Ihre Agenten sehen, wenn sie auf die Werkzeuge zugreifen.

source: Custom instructions
de: Benutzerdefinierte Anweisungen

source: Provide detailed instructions for the AI. This is a very important part of the configuration. They get included in the system prompt and tell the AI what to do with a given text. To get proper responses, the instructions should be constructed in a certain way:
de: Geben Sie detaillierte Anweisungen für die KI. Dies ist ein sehr wichtiger Teil der Konfiguration. Sie werden in den System-Prompt mitaufgenommen und sagen der KI, wie mit einem bestimmten Text umgegangen werden soll. Um gute Antworten von der KI zu erhalten, sollten die Anweisungen in einer bestimmten Weise aufgebaut sein:

source: They should be unambiguous and precise.
de: Sie sollten unmissverständlich und präzise sein.

source: They can include one or more examples.
de: Sie können ein oder mehrere Beispiele enthalten.

source: They should not include superfluous or redundant information.
de: Sie sollten keine überflüssigen oder redundanten Informationen enthalten.

source: They can specify an output format to keep the formatting and structure (namely HTML, see examples below).
de: Sie können ein Ausgabeformat angeben, um die Formatierung und Struktur beizubehalten (nämlich HTML, siehe Beispiele unten).

source: You can even use variables by typing ``::``. This triggers a list of available variables where you can choose from. By using a variable, you can include object specific information in the instructions.
de: Sie können sogar Variablen verwenden, indem Sie ``::`` eingeben. Dies triggert eine Liste der verfügbaren Variablen, aus der Sie auswählen können. Durch die Verwendung einer Variable können Sie objektspezifische Informationen in die Anweisungen aufnehmen.

source: To help you build good instructions, we collected a few snippets which may be helpful, depending on your use case. Pick fitting ones and include it in your custom instructions and/or consider cloning an existing text tool and adjust it.
de: Um Ihnen bei der Erstellung guter Anweisungen zu helfen, haben wir einige Schnipsel zusammengestellt, die je nach Anwendungsfall hilfreich sein können. Wählen Sie die passenden aus und fügen Sie sie in Ihre benutzerdefinierten Anweisungen ein und/oder überlegen Sie, ob Sie ein vorhandenes Textwerkzeug klonen und anpassen möchten.

source: Groups
de: Gruppen
sr: Групе

source: Define groups which can access the write assistance tool. If no group is selected (moved on the left side by clicking on it), the tool is available for tickets in all groups.
de: **Gruppen**: Legen Sie die Gruppen fest, die auf das Schreibwerkzeug zugreifen können. Wenn keine Gruppe ausgewählt ist (per Klick auf die linke Seite verschoben), ist das Werkzeug für Tickets in allen Gruppen verfügbar.

source: Agents can access **all** writing assistance tools (including the restricted ones) during ticket creation as long as no group is selected.
de: Agenten können bei der Erstellung von Tickets auf **alle** Schreibassistenten zugreifen (auch auf die eingeschränkten), solange keine Gruppe ausgewählt ist.

source: Note
de: Notiz
sr: Напомена

source: Add a note about the write tool for other admins and explain what it it is for. This information gets displayed in the table of tools. It is **not** considered as context for the AI.
de: Fügen Sie eine Notiz über das Schreibwerkzeug für andere Administratoren hinzu und erklären Sie, wozu es dient. Diese Information wird in der Tabelle der Werkzeuge angezeigt. Sie wird **nicht** als Kontext für die KI verwendet.

source: Active
de: Aktiv
sr: Активно

source: Set the write assistant tool to active or inactive.
de: Setzen Sie das Schreibassistent-Werkzeug auf aktiv oder inaktiv.

source: After creating or editing, you should test if the result is as expected. In case you are not happy, feel free to adjust the instructions until it fits your expectations.
de: Nach der Erstellung oder Bearbeitung sollten Sie testen, ob das Ergebnis Ihren Erwartungen entspricht. Falls Sie nicht zufrieden sind, können Sie die Anweisungen anpassen, bis sie Ihren Erwartungen entsprechen.

source: Usage for Agents
de: Verwendung für Agenten

source: If enabled, agents have access to the default tools as well as the custom tools which are available for the group or are not limited to any group. They simply have to select the text they want to check/change and select the writing assistant tool they want to use. The :user-docs:`AI section in the user documentation </extras/ai-features.html>` includes additional information.
de: Wenn diese Option aktiviert ist, haben die Agenten Zugriff auf die Standardwerkzeuge sowie auf die benutzerdefinierten Werkzeuge, die für die Gruppe verfügbar sind oder auf keine Gruppe beschränkt sind. Sie müssen lediglich den Text markieren, den sie prüfen/ändern wollen, und das gewünschte Schreibassistenz-Werkzeug auswählen. Die :user-docs:`KI-Seite in der Benutzerdokumentation </extras/ai-features.html>` enthält zusätzliche Informationen.

source: The chat feature in Zammad allows visitors of your website to initiate chats with agents. You can find the settings in the admin panel under "Channels".
de: Die Chat-Funktion in Zammad ermöglicht es Besuchern Ihrer Website, Chats mit Agenten zu initiieren. Sie finden die Einstellungen im Admin-Bereich unter "Kanäle".
sr: Функција ћаскања у Zammad-у омогућује посетиоцима вашег веб сајта да започну ћаскање са оператерима. Подешавања можете пронаћи у администраторском панелу под „Канали”.

source: The feature is built to assist for proper customer support. And this is how it works:
de: Die Funktion wurde entwickelt, um eine gute Kundenbetreuung zu ermöglichen. Und so funktioniert's:
sr: Функција је развијена да припомогне у пружању одговарајуће подршке. Ево на који начин ради:

source: The chat widget will only be displayed to customers, if at least one agent is available and has capacity.
de: Das Chat-Widget wird den Kunden nur dann angezeigt, wenn mindestens ein Agent verfügbar ist und über Kapazitäten verfügt.
sr: Додатак за ћаскање ће вити приказан клијентима само ако је бар један оператер доступан и још увек има капацитета.

source: Agents can define how many simultaneous chat sessions they want to accept.
de: Agenten können festlegen, wie viele gleichzeitige Chat-Sitzungen sie zulassen möchten.
sr: Оператери могу одредити колико истовремених сесија ћаскања желе да прихвате.

source: An agent is set to inactive, if the agent doesn't accept new chat requests or is offline. Because of this, your agents can take breaks without having your customers to wait.
de: Ein Agent wird auf inaktiv gesetzt, wenn er keine neuen Chat-Anfragen annimmt oder offline ist. So können Ihre Agenten Pausen machen, ohne dass Ihre Kunden warten müssen.
sr: Оператер се сматра неактивним ако не прихвата нове захтеве за ћаскање или је недоступан. Услед овога, ваши оператери могу да направе паузе без да ваши клијенти чекају.

source: You can define different topics for chats and agents can select for which topic they want to accept chat sessions.
de: Sie können verschiedene Themen für Chats festlegen und die Agenten können auswählen, für welches Thema sie Chatsitzungen annehmen möchten.
sr: Можете одредити различите теме ћаскања и оператери могу одабрати за које теме желе да преузимају сесије ћаскања.

source: No automatic answer is send to the customer.
de: Es wird keine automatische Antwort an die Kunden gesendet.
sr: Неће бити слања аутоматских одговора клијенту.

source: Zammad sends an auto response as soon as the agents accepts the chat request. This message is configurable by each agent individually.
de: Zammad sendet eine automatische Antwort, sobald der Agent die Chat-Anfrage annimmt. Diese Nachricht ist von jedem Agenten individuell konfigurierbar.
sr: Zammad ће послати аутоматски одговор у случају да оператер прихвати захтев за ћаскање. Ова порука је подесива од стране сваког оператера појединачно.

source: Zammad will try to adapt your main website colors to the chat. You can also adjust the colors to customize it to your corporate design.
de: Zammad versucht, die Farben Ihrer Haupt-Website an den Chat anzupassen. Sie können die Farben auch ändern, um sie an Ihr Corporate Design anzupassen.
sr: Zammad ће покушати да прилагоди главне боје вашег сајта ћаскању. Такође можете подесити боје за прилагођавање свом корпоративном дизајну.

source: General
de: Allgemein
sr: Уопштено

source: The area for configuring the chat can be found in the admin panel under **Channels > Chat**.
de: Die Konfiguration des Chats befindet sich im Admin-Bereich unter **Kanäle > Chat**.
sr: Област за подешавање ћаскања се може наћи у административном панелу под **Канали > Ћаскање**.

source: You can set up chats for different websites and edit them independently. Use the "Topics" function if you need a separation or you have specialized agents for different topics. Your agents can choose then for which topic they want to accept chats.
de: Sie können Chats für verschiedene Websites einrichten und diese unabhängig voneinander bearbeiten. Verwenden Sie die Funktion "Themen", wenn Sie eine Trennung benötigen oder Sie spezialisierte Agenten für verschiedene Themen haben. Ihre Agenten können dann wählen, für welche Themen sie Chats annehmen möchten.
sr: Можете подесити ћаскања за различите веб сајтове и уређивати их самостално. Користите функцију „Теме” уколико вам је неопходна сепарација или имате специјализоване оператере за различите теме. Ваши оператери могу одабрати за коју тему желе да прихватају ћаскања.

source: The integrated designer helps the chat widget to adapt to the website color. Zammad tries to fetch your website based on your FQDN. If this fails or you want to override the preview, you can enter a URL manually and click on load. You can get a preview for different devices by selecting the different preview modes.
de: Der integrierte Designer passt das Chat-Widget an die Farbe der Website an. Zammad versucht, Ihre Website anhand Ihres FQDN abzurufen. Wenn dies fehlschlägt oder Sie die Vorschau übersteuern möchten, können Sie eine URL manuell eingeben und auf "Laden" klicken. Sie können eine Vorschau für verschiedene Geräte sehen, indem Sie zwischen den Vorschau-Breiten wechseln.
sr: Интегрисани дизајнер вам помаже у адаптацији додатка за ћаскање бојама веб сајта. Zammad ће покушати да учита вашу презентацију на основу домена. Уколико ово не успе или желите да преиначите изглед, можете ручно унети URL адресу и кликнути за учитавање. Можете добити преглед за различите уређаје одабиром одговарајућег мода за приказ.

source: If you don't like the proposed design, you can manually adjust it. Adjust the color and apply a flat design if needed.
de: Wenn Ihnen das vorgeschlagene Design nicht gefällt, können Sie es manuell anpassen. Passen Sie die Farbe an und aktivieren Sie bei Bedarf ein flaches Design.
sr: Уколико вам се не свиђа предложени дизајн, можете га ручно дотерати. Прилагодите боју и укључите пљоснат дизајн по жељи.

source: Chat Restrictions
de: Chat-Einschränkungen
sr: Ограничења ћаскања

source: You offer a chat for your target group, but you don't want to activate chat for certain IP addresses or countries? Then you have the possibility to block the wished IP addresses and countries fast and easily via the chat configuration in the admin panel. The configuration panel looks like this:
de: Sie bieten einen Chat für Ihre Zielgruppe an, möchten aber den Chat für bestimmte IP-Adressen oder Länder nicht freischalten? Dann haben Sie die Möglichkeit, die gewünschten IP-Adressen und Länder schnell und einfach über die Chat-Konfiguration im Admin-Panel zu sperren. Das Konfigurationspanel sieht wie folgt aus:
sr: Нудите ћаскање за своју циљну групу, али не желите да активирате ћаскање за одређене IP адресе или земље? Имате могућност да брзо и једноставно блокирате жељене IP адресе и земље путем конфигурације ћаскања у панелу администратора. Конфигурациони панел изгледа овако:

source: You can also find more information about the chat customization in the admin area.
de: Weitere Informationen über die Chat-Anpassung finden Sie auch im Verwaltungsbereich.
sr: Такође можете пронаћи више информација о прилагођавању ћаскања у области администрације.

source: Website Implementation
de: Implementierung in Ihrer Website
sr: Убацивање у веб сајт

source: Requirements
de: Anforderungen
sr: Услови

source: Zammad chat comes in two flavors: a version with and without jQuery. You can choose which one you prefer by toggling the **With jQuery** switch that will display the appropriate code snippet below.
de: Den Zammad-Chat gibt es in zwei Varianten: eine Version mit und eine ohne jQuery. Sie können wählen, welche Sie bevorzugen, indem Sie den Schalter **Mit jQuery** umschalten, der den entsprechenden Code unten anzeigt.
sr: Zammad ћаскање долази у две варијанте: са и без jQuery. Можете одабрати жељену варијанту путем дугмета **Са jQuery** које ће приказати одговарајући исечак кода испод.

source: For jQuery version, if you don't already use it on your website, make sure to first include it like this:
de: Wenn Sie die jQuery-Version noch nicht auf Ihrer Website verwenden, sollten Sie sie zunächst wie folgt einbinden:
sr: За jQuery варијанту, уколико га не користите већ на свом сајту, убаците га на следећи начин:

source: Usage
de: Verwendung
sr: Употреба

source: You have two options to implement the chat on your website:
de: Sie haben zwei Möglichkeiten, den Chat auf Ihrer Website zu implementieren:
sr: Имате две опције да примените ћаскање на свом сајту:

source: Automatically show the chat (that's the default setting)
de: Automatisch den Chat anzeigen (das ist die Standardeinstellung)
sr: Аутоматско приказивање ћаскање (ово је подразумевано понашање)

source: or manually open the chat.
de: oder öffnen Sie den Chat manuell.
sr: или ручно отварање ћаскања.

source: Insert the widget code into the source code of every page on which you want the chat to be visible on. It should be placed at the end of the page's source code before the ``</body>`` closing tag.
de: Fügen Sie den Widget-Code in den Quellcode jeder Seite ein, auf welcher der Chat sichtbar sein soll. Er sollte am Ende des Quellcodes der Seite vor dem schließenden ``</body>``-Tag platziert werden.
sr: Уметните код додатка у изворни код сваке стране на којој желите да ћаскање буде видљиво. Неопходно је убацити га на крај изворног кода стране пре затвореног ``</body>`` елемента.

source: Result
de: Ergebnis
sr: Резултат

source: The final result will look like the following:
de: Das Endergebnis wird wie folgt aussehen:
sr: Коначни резултат ће изгледати овако:

source: Accounts
de: Konten
sr: Налози

source: Use the **New Email Account** dialog to connect your account.
de: Verwenden Sie das Dialogfeld **Neues E-Mail-Konto**, um Ihr Konto zu verbinden.
sr: Користите дијалог **Нови: Имејл** да бисте повезали свој налог.

source: New Email Account dialog
de: Neuer Email-Account-Dialog
sr: Дијалог новог имејл налога

source: Send and receive email at **additional email addresses**, all through the same mailbox/account.
de: Senden und Empfangen Sie Mails von **zusätzlichen E-Mail-Adressen** durch den selben E-Mail-Account.
sr: Шаљите и примајте е-пошту на **додатних имејл адреса**, а све преко истог поштанског сандучета/налога.

source: Add email address dialog
de: Dialog E-Mail-Adresse hinzufügen
sr: Дијалог додавања имејл адресе

source: Edit the configuration of existing accounts in the **Accounts Panel**.
de: Bearbeiten Sie die Einstellungen eines bereits vorhandenen Benutzers im **Benutzer Panel**.
sr: Измените подешавање постојећих налога у **Панелу налога**.

source: Existing accounts can be edited from the Accounts panel.
de: Existierende Accounts können in der Accountverwaltung angepasst werden.
sr: Постојећи налози се могу уређивати из панела налога.

source: Configure the outgoing mail provider for **system notifications**. (Self-hosted installations only.)
de: Konfigurieren Sie den ausgehenden Email-Dienst für **Systembenachrichtigungen**. (Nur für selbst gehostete Installationen.)
sr: Подесите провајдера одлазне поште за **системска обавештења**. (Само за инсталације које сами хостујете.)

source: Account Setup
de: Account-Einrichtung
sr: Подешавање налога

source: Setting up a new email account? Here's what all the settings do.
de: Legen Sie einen neuen Email-Account an? Das bedeuten die Einstellungen.
sr: Подешавате нов имејл налог? Ево шта раде сва ова подешавања.

source: ☠️ **But first, a word of warning!** The import process does things you might not expect:
de: ☠️ **Zu aller erst ein Warnung!** Der Abholprozess tut Dinge, die Sie ggf. nicht erwarten:
sr: ☠️ **Али прво, реч упозорења!** Процес увоза ради ствари које можда не очекујете:

source: By default, Zammad will **delete all emails** in your inbox during the import process. Use the *Experts* dialog to :ref:`disable this behavior <email-experts-keep-messages-on-server>`.
de: Standardmäßig **löscht Zammad alle E-Mails** in Ihrem Posteingang während des Importvorgangs. Verwenden Sie den *Experten*-Dialog, um dieses :ref:`Verhalten zu deaktivieren <email-experts-keep-messages-on-server>`.
sr: Подразумевано, Zammad ће **обрисати све имејл поруке** из вашег сандучета приликом увоза. Користите дијалог *Стручњаци* да бисте :ref:`онемогућили ово понашање <email-experts-keep-messages-on-server>`.

source: Zammad will **send an auto-reply message to every email it imports** (including the old ones!). Use the *Experts* dialog to :ref:`change this behavior <email-experts-import-as>` or to :doc:`disable auto-replies </manage/trigger>` prior adding an email account and to turn it back on once all your messages have been imported.
de: Zammad **schickt eine automatische Eingangsbenachrichtigung an den Absender jeder importierten E-Mail** (auch für alte E-Mails!). Verwenden Sie den *Experten*-Dialog, um :ref:`dieses Verhalten zu ändern <email-experts-import-as>` oder :doc:`deaktivieren Sie Auto-Antworten </manage/trigger>` vor dem Hinzufügen eines E-Mail Kontos und schalten sie wieder ein, sobald alle Ihre Konten importiert wurden.
sr: Zammad ће **послати аутоматски одговор на сваку имејл поруку коју увезе** (укључујући и пређашње!). Користите дијалог *Стручњаци* да би сте :ref:`променили ово понашање <email-experts-import-as>` или :doc:`искључите аутоматске одговоре </manage/trigger>` пре него што додате имејл налог, и укључите их поново када све ваше поруке буду увезене.

source: **Gmail / G Suite users:**
de: **Gmail / G-Suite Benutzer:**
sr: **Gmail / G Suite корисници:**

source: To add a Google account, create a dedicated :doc:`Google channel </channels/google/basic-setup>`.
de: Um ein Google Konto hinzuzufügen, erstellen Sie einen speziell dafür vorgesehenen :doc:`Google Kanal </channels/google/basic-setup>`.
sr: Да бисте додали Google налог, подесите додатан :doc:`Google канал </channels/google/index>`.

source: **Microsoft 365 users:**
de: **Microsoft 365-Benutzer:**
sr: **Корисници Microsoft 365:**

source: To add a Microsoft 365 account, create a dedicated :doc:`Microsoft 365 IMAP Email channel </channels/microsoft365/accounts>` or :doc:`Microsoft 365 Graph Email channel </channels/microsoft365-graph/accounts>`.
de: Um ein Microsoft 365 Konto hinzuzufügen, erstellen Sie einen dedizierten :doc:`Microsoft 365 IMAP E-Mail Kanal </channels/microsoft365/accounts>` oder :doc:`Microsoft 365 Graph E-Mail Kanal </channels/microsoft365-graph/accounts>`.
sr: Да бисте додали Microsoft 365 налог, подесите посебан :doc:`Microsoft 365 IMAP имејл канал </channels/microsoft365/accounts>` или :doc:`Microsoft 365 Graph имејл канал </channels/microsoft365-graph/accounts>` .

source: Basic
de: Grundlegend
sr: Основни

source: In most cases, Zammad is smart enough to figure out your email provider's configuration based on your email address alone. If the correct configuration could not be retrieved, Zammad asks you to provide the correct parameters manually.
de: In den meisten Fällen kann Zammad die Konfiguration Ihres E-Mail-Anbieters allein anhand Ihrer E-Mail-Adresse ermitteln. Wenn die richtige Konfiguration nicht abgerufen werden konnte, fordert Zammad Sie auf, die richtigen Parameter manuell einzugeben.
sr: У већини случајева, Zammad је довољно паметан да пронађе конфигурацију вашег имејл провајдера само на основу ваше имејл адресе. Ако се исправна конфигурација не може закључити, Zammad тражи од вас да ручно унесете исправне параметре.

source: Screenshot showing basic email account setup inbound
de: Screenshot, der die Admin-Einstellungen in Zammad zeigt
sr: Снимак екрана који приказује основно подешавање долазног имејл налога

source: Basic email account setup inbound
de: Grundlegende Einrichtung eines eingehenden E-Mail-Kontos
sr: Основно подешавање долазног имејл налога

source: Organization & Department Name
de: Organisation & Abteilungsname
sr: Назив организације и одељења

source: The display name used for outgoing email.
de: Der Anzeigename wird auch für ausgehende Emails verwendet.
sr: Назив за приказ који се користи за одлазне имејл поруке.

source: Screenshot of customer inbox with email from "Chrispresso Sales"
de: Screenshot des Posteingangs eines Kunden mit einer E-Mail von "Chrispresso Sales"
sr: Снимак екрана пријемног сандучета клијената са имејлом од „Chrispresso Sales“
