Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: Screenshot shows menu with "View from user's perspective" option.
de: Screenshot zeigt das Menü mit der Option "Aus Benutzersicht ansehen".
sr: Снимак екрана који приказује мени опцију „Погледај из перспективе корисника”.

source: Use the ⋮ **Actions** menu to 👁️ **View from user's perspective**.
de: Benutzen Sie das ⋮ **Aktionen**-Menü, um 👁️ **Aus Benutzersicht ansehen**.
sr: Користите мени ⋮ **Радње** да бисте одабрали 👁 **Погледај из перспективе корисника**.

source: The **View from user's perspective** button allows you to “hijack” another user's session and confirm firsthand what they can and can't do (or see) when they're logged in.
de: Mit der Schaltfläche **Aus Benutzersicht ansehen** können Sie die Sitzung eines anderen Benutzers "kapern" und aus direkt sehen, was dieser tun und sehen kann und was nicht, wenn er angemeldet ist.
sr: Радња **Погледај из перспективе корисника** омогућава вам да „отмете“ сесију другог корисника и из прве руке потврдите шта они могу, а шта не могу да ураде (или виде) када су пријављени.

source: This is especially useful when you need to verify that you've set up custom permissions correctly for non-admin users.
de: Dies ist insbesondere nützlich, wenn Sie überprüfen müssen, ob Sie benutzerdefinierte Berechtigungen korrekt eingerichtet haben.
sr: Ово је посебно корисно када треба да проверите да ли сте исправно подесили прилагођене дозволе за кориснике који нису администратори.

source: When finished, use the **Back to my view ✕** button at the top of the page. If you try to exit by logging out, the "hijacked" user session will be restored when you log back in.
de: Wenn Sie fertig sind, verwenden Sie die Schaltfläche **Zurück zu meiner Ansicht ✕** oben auf der Seite. Wenn Sie versuchen, die Ansicht durch Abmelden zu verlassen, wird die "gekaperte" Benutzersitzung wiederhergestellt, wenn Sie sich erneut anmelden.
sr: Када завршите, користите дугме **Иди назад на мој преглед ✕** при врху странице. Ако покушате да изађете тако што ћете се одјавити, „отета“ корисничка сесија ће бити повраћена када се поново пријавите.

source: Screenshot shows the view of another user's account.
de: Screenshot zeigt die Ansicht durch einen anderen Benutzer.
sr: Снимак екрана који приказује перспективу корисника.

source: **⚠ With great power comes with great responsibility.**
de: **⚠ Mit großer Macht kommt auch große Verantwortung.**
sr: **⚠ Уз велику моћ долази и велика одговорност.**

source: This feature is not a simulation; entering this mode will boot the user from their session, and any actions you take (responding to tickets, changing passwords, :doc:`logging hours worked </manage/time-accounting>`) will actually be performed from the user's account.
de: Diese Funktion ist keine Simulation! Wenn Sie diese Funktion nutzen, wird der Benutzer - sofern angemeldet - aus seiner Sitzung geworfen und alle Aktionen, die Sie durchführen (z.B. Beantwortung von Tickets, Änderung des Passworts, :doc:`Erfassung der geleisteten Arbeitsstunden </manage/time-accounting>`), werden tatsächlich mit dem Konto des Benutzers ausgeführt.
sr: Ова функција није симулација; улазак у овај режим ће избацити корисника из његове сесије, а све радње које предузмете (одговарање на тикете, промена лозинке, :doc:`обрачун времена </manage/time-accounting>`) ће се заправо извршити са корисничког налога.

source: (On the other hand, if the user logs back in, you'll be booted, too.)
de: (Wenn sich der Benutzer jedoch wieder anmeldet, werden auch Sie aus der Sitzung geworfen.)
sr: (С друге стране, ако се корисник поново пријави, ви ћете бити избачени такође.)

source: 🔑 Manage Two-Factor Authentication
de: 🔑 Verwalten der Zwei-Faktoren-Authentifizierung
sr: 🔑 Управљање двофакторском аутентификацијом

source: Screenshot shows menu with highlighted "Manage Two-Factor Authentication" option.
de: Screenshot zeigt das Menü mit der hervorgehobenen Option "Zwei-Faktor-Authentifizierung verwalten".
sr: Снимак екрана који приказује наглашену опцију „Управљање двофакторском аутентификацијом”.

source: Use the ⋮ **Actions** menu to remove a user's configured two-factor method.
de: Verwenden Sie das Menü ⋮ **Aktionen**, um die konfigurierte Zwei-Faktoren-Methode eines Benutzers zu entfernen.
sr: Користите мени ⋮ **Радње** да бисте уклонили подешени кориснички метод двофакторске аутентификације.

source: Screenshot shows dialog to delete a user's 2FA method.
de: Screenshot zeigt Dialog zum Löschen der 2FA-Methode eines Benutzers.
sr: Снимак екрана који приказује дијалог уклањања метода двофакторске аутентификације корисника.

source: It's possible to remove a single or all of the user's configured methods, if they lose access. They can then set it up again by themselves via *Avatar > Profile > Password & Authentication*.
de: Es ist möglich, einzelne oder alle konfigurierten Methoden eines Benutzers zu entfernen, wenn er den Zugang verliert. Er kann sie dann selbst über "Avatar > Profil > Passwort & Authentifizierung" wieder einrichten.
sr: Могуће је уклонити једну или све корисничке подешене методе ако изгубе приступ. Потом могу поново сами да га подесе преко *Аватар > Профил > Лозинка и аутентификација*.

source: Webhooks are a way to integrate Zammad with other web services or applications, allowing them to subscribe to live updates about tickets instead of having to poll the Zammad server every *n* minutes.
de: Webhooks sind eine Möglichkeit, Zammad in andere Webdienste oder Anwendungen zu integrieren. Dadurch können diese Live-Updates zu Tickets abonnieren, anstatt Zammad alle *n* Minuten abzufragen.
sr: Повратни позиви су начин да се Zammad интегрише са другим веб сервисима или апликацијама, омогућавајући им да се претплате на освежавања тикета уместо да морају да испитују Zammad сервер сваких *n* минута.

source: ⌛ **Webhooks may not arrive immediately.**
de: ⌛ **Webhooks kommen möglicherweise nicht sofort an.**
sr: ⌛ **Повратни позиви можда неће бити обављени одмах.**

source: Webhooks are sent out with the same priority and order as email triggers. If webhook dispatch fails (e.g. because the receiving server is misconfigured), Zammad will retry up to four times.
de: Webhooks werden mit der gleichen Priorität und in der gleichen Reihenfolge wie per Trigger ausgelöste E-Mails verschickt. Wenn die Ausführung des Webhooks fehlschlägt (z.B. weil der empfangende Server falsch konfiguriert ist), versucht Zammad es bis zu vier Mal erneut.
sr: Повратни позиви се шаљу са истим приоритетом и редоследом као и имејл окидачи. Ако слање побратног позива не успе (нпр. зато што је долазни сервер погрешно подешен), Zammad ће покушати поново до четири пута.

source: Webhooks are available for :doc:`/manage/trigger` and :doc:`/manage/scheduler`.
de: Webhooks sind für :doc:`/manage/trigger` und :doc:`/manage/scheduler` verfügbar.
sr: Повратни позиви су доступни за :doc:`окидаче </manage/trigger>` и :doc:`планере </manage/scheduler>`.

source: How do Webhooks Work
de: Wie funktionieren Webhooks
sr: Како повратни позиви уствари раде

source: Under the hood, Zammad sends a POST request to a third-party URL ("API endpoint") you specify in the New Webhook dialog. The application server behind this URL/endpoint must be configured to receive messages from Zammad and handle the provided payload accordingly.
de: Unter der Haube sendet Zammad eine POST-Anfrage an eine Drittanbieter-URL ("API-Endpunkt"), die Sie im Dialogfeld "Neuer Webhook" angeben. Der Anwendungsserver hinter dieser URL/Endpunkt muss so konfiguriert sein, dass er Nachrichten von Zammad empfängt und die bereitgestellten Nutzdaten entsprechend verarbeitet.
sr: Испод хаубе, Zammad шаље POST захтев на URL трећег лица („Путања“) који наведете у дијалогу новог повратног позива. Сервер апликација иза ове URL адресе/путање мора бити подешен да прима поруке од Zammad-а и у складу са тим обради примљене податке.

source: Webhooks can be created both from scratch and from pre-defined templates.
de: Webhooks können sowohl komplett neu als auch aus vordefinierten Vorlagen erstellt werden.
sr: Повратни позиви се могу додати и од нуле и од унапред дефинисаних шаблона.

source: When created from scratch, regular webhook payloads by default contain the following JSON data about new/updated tickets:
de: Wenn Sie Webhooks komplett neu erstellen, enthalten reguläre Webhook-Payloads standardmäßig die folgenden JSON-Daten zu neuen/aktualisierten Tickets:
sr: Када се додају од нуле, уобичајени подаци повратног позива подразумевано садрже следећу JSON структуру о новим/освеженим тикетима:

source: ticket attributes/metadata
de: Ticket-Attribute/Metadaten
sr: атрибути тикета/метаподаци

source: associated article(s)
de: zugehörige(r) Artikel
sr: повезани чланци

source: associated users (e.g. article senders, owners, etc.)
de: jeweilige Benutzer (z.B. Absender von Artikeln, Besitzer usw.)
sr: повезани корисници (нпр. пошиљаоци чланака, власници, итд.)

source: associated user roles
de: jeweilige Benutzerrollen
sr: повезане улоге корисника

source: associated user organizations (if applicable)
de: jeweilige Organisationen der Benutzer (falls vorhanden)
sr: повезане корисничке организације (ако постоје)

source: associated groups
de: jeweilige Gruppen
sr: повезане групе

source: On the other hand, pre-defined webhooks are designed to work with specific services, containing special payloads that these services understand.
de: Andererseits sind vordefinierte Webhooks für die Zusammenarbeit mit bestimmten Diensten konzipiert und enthalten spezielle Nutzdaten, die diese Dienste verstehen.
sr: С друге стране, унапред дефинисани повратни позиви су дизајнирани да раде са одређеним сервисима, који садрже посебне податке које ови сервиси очекују.

source: In both cases, however, it is possible to further customize the webhook payload to your own needs.
de: In beiden Fällen ist es jedoch möglich, den Webhook-Payload weiter an Ihre eigenen Bedürfnisse anzupassen.
sr: У оба случаја, међутим, могуће је додатно прилагодити податке повратног позива вашим сопственим потребама.

source: Adding Webhooks
de: Hinzufügen von Webhooks
sr: Додавање повратних позива

source: Defining a webhook allows you to use a specific endpoint in several triggers or schedulers.
de: Wenn Sie einen Webhook definieren, können Sie einen bestimmten Endpunkt in mehreren Triggern oder Automatisierungen verwenden.
sr: Дефинисање повратног позива вам омогућава коришћење једне специфичну путање у неколико окидача или планера.

source: **Default Zammad webhook payloads are specific**
de: **Die Standard Zammad-Webhook-Payloads sind individuell**
sr: **Подразумевани подаци Zammad повратног позива су специфични**

source: Keep in mind that the remote site has to be able to understand the default webhook payload, Zammad is sending. Simply throwing the default payload at a webhook endpoint may not have the desired result!
de: Beachten Sie, dass der externe Dienst in der Lage sein muss, den Standard-Webhook-Payload zu verstehen, den Zammad sendet. Einfach den Standard-Payload an einen Webhook-Endpunkt zu senden, führt möglicherweise nicht zum gewünschten Ergebnis!
sr: Имајте на уму да удаљена локација мора да буде у стању да разуме подразумеване податке повратног позива које Zammad шаље. Једноставно бацање подразумеваних података на путању повратног позива можда неће имати жељени резултат!

source: See `Custom Payload`_ for a way to customize webhook payloads.
de: Siehe `Custom Payload`_ für die Anpassung der Webhook-Payloads.
sr: Погледајте `Прилагођени подаци`_ за начин прилагођавања података повратног позива.

source: To add a new regular webhook, use the big green **New Webhook** button.
de: Um einen neuen regulären Webhook hinzuzufügen, verwenden Sie den grünen Button **Neuer Webhook**.
sr: Да бисте додали нови обични повратни позиви, користите велико зелено дугме **Нови повратни позив**.

source: Modal showing webhook configuration
de: Dialog mit Webhook-Konfiguration
sr: Модал који приказује подешавање повратног позива

source: For a pre-defined webhook, click on the arrow button to the right and choose **Pre-defined Webhook** from the dropdown menu.
de: Für einen vordefinierten Webhook klicken Sie auf den Button mit dem Pfeil auf der rechten Seite und wählen Sie **Vordefinierter Webhook** aus dem Dropdown-Menü.
sr: За унапред дефинисани повратни позив, кликните на дугме са стрелицом са десне стране и изаберите **Повратни позив по шаблону** из падајућег менија.

source: New Pre-defined Webhook button
de: Schaltfläche "Neuer vordefinierter Webhook"
sr: Дугме новог повратни позива по шаблону

source: Next, select the pre-defined webhook you want and click **Next**.
de: Wählen Sie dann den gewünschten vordefinierten Webhook aus und klicken Sie auf **Weiter**.
sr: Затим изаберите повратни позив по шаблону који желите и кликните на **Следеће**.

source: New pre-defined webhook modal
de: Dialog "Neuer vordefinierter Webhook"
sr: Дијалог новог повратног позива по шаблону

source: **⚠️ Adding a new webhook is not enough**
de: **⚠️ Hinzufügen eines neuen Webhakens reicht nicht**
sr: **⚠️ Додавање новог повратног позива није довољно**

source: You must, in addition, add a :doc:`Trigger </manage/trigger>` or :doc:`Scheduler </manage/scheduler>` that references the Webhook!
de: Sie müssen zusätzlich einen :doc:`Trigger </manage/trigger>` oder eine :doc:`Automatisierung </manage/scheduler>` hinzufügen, die den Webhook auslöst!
sr: Поред тога, морате додати :doc:`окидач </manage/trigger>` или :doc:`планер </manage/scheduler>` који упућује на повратни позив!

source: You can configure the following information for webhooks:
de: Sie können die folgenden Informationen für Webhooks konfigurieren:
sr: Можете да подесите следеће атрибуте повратних позива:

source: Name (mandatory)
de: Name (Pflichtfeld)
sr: Назив (обавезно)

source: This name will be displayed within trigger and scheduler selections.
de: Dieser Name wird bei der Auswahl von Triggern und Automatisierungen angezeigt.
sr: Овај назив ће бити приказан у оквиру избора окидача и планера.

source: Endpoint (mandatory)
de: Endpunkt (Pflichtfeld)
sr: Путања (обавезно)

source: Webhook endpoint Zammad sends its payload to.
de: Webhook-Endpunkt, an den Zammad seinen Payload sendet.
sr: Путања повратног позива којој Zammad доставља своје податке.

source: Zammad ignores basic authentication parameters. See below how to configure :ref:`username <HTTP Basic Authentication Username>` and :ref:`password <HTTP Basic Authentication Password>` via separate fields.
de: Zammad ignoriert basic authentication Parameter. Siehe unten, wie man :ref:`Benutzername <HTTP Basic Authentication Username>` und :ref:`Passwort <HTTP Basic Authentication Password>` über separate Felder konfiguriert.
sr: Zammad игнорише basic auth параметре. Погледајте испод како да подесите :ref:`корисничко име <HTTP Basic Authentication Username>` и :ref:`лозинку <HTTP Basic Authentication Password>` преко посебних поља.

source: HMAC SHA1 Signature Token
de: HMAC SHA1 Signatur-Token
sr: HMAC SHA1 кључ за потпис

source: If set, all sent webhooks contain a `x-hub-signature` header allowing the remote site to verify the request.
de: Wenn diese Option gesetzt ist, enthalten alle gesendeten Webhooks einen `x-hub-signature`-Header, der es der Gegenstelle ermöglicht, die Anfrage zu überprüfen.
sr: Ако је подешено, сви послати повратни позиви садрже заглавље `x-hub-signature` које омогућава удаљеном сервису да верификује захтев.

source: **🔐 Security note**
de: **🔐 Sicherheitshinweis**
sr: **🔐 Безбедносна напомена**

source: This *does not* encrypt the payload. Use HTTPS connections to secure the communication. It contains a HMAC signature of the body of the webhook request.
de: Dies *verschlüsselt* die Nutzdaten *nicht*. Verwenden Sie HTTPS-Verbindungen, um die Kommunikation abzusichern. Sie enthält eine HMAC-Signatur des Bodys der Webhook-Anfrage.
sr: Ово *не* шифрује корисни терет. Користите HTTPS протокол да бисте заштитили комуникацију. Садржи HMAC потпис тела захтева повратног позива.

source: `Learn more about HUB-Signatures <https://www.w3.org/TR/websub/#authenticated-content-distribution>`_
de: `Erfahren Sie mehr über HUB-Signaturen <https://www.w3.org/TR/websub/#authenticated-content-distribution>`_
sr: `Сазнајте више о HUB потписима <https://www.w3.org/TR/websub/#authenticated-content-distribution>`_

source: Defaults to ``yes`` - if you're using unsecure self signed certificates, set this option to ``no``.
de: Der Standardwert ist ``ja`` - wenn Sie unsichere selbstsignierte Zertifikate verwenden, setzen Sie diese Option auf ``nein``.
sr: Подразумевано је ``да`` - ако користите небезбедне самопотписане сертификате, подесите ову опцију на ``не``.

source: Set this if the endpoint requires HTTP basic authentication credentials.
de: Legen Sie dies fest, wenn der Endpunkt HTTP basic authentication Zugangsdaten erfordert.
sr: Подесите ово ако путања захтева HTTP basic auth акредитиве.

source: Pre-defined Webhook
de: Vordefinierter Webhook
sr: Повратни позив по шаблону

source: This field is only available for *pre-defined webhooks*!
de: Dieses Feld ist nur für *vordefinierte Webhooks* verfügbar!
sr: Ово поље је доступно само за *повратне позиве по шаблону*!

source: This field is always disabled in the UI and serves only as a reference to a pre-defined webhook. It is not possible to change it for existing webhooks.
de: Dieses Feld ist in der Benutzeroberfläche immer deaktiviert und dient nur als Verweis auf einen vordefinierten Webhook. Es ist nicht möglich, dies für bestehende Webhooks zu ändern.
sr: Ово поље је увек онемогућено у корисничком интерфејсу и служи само као референца на шаблон повратног позива. Није могуће променити га за постојеће повратне позиве.

source: Depending on the pre-defined webhook type, additional fields may be rendered below this one. They can be used for additional customization of the webhook behavior.
de: Je nach dem vordefinierten Webhook-Typ können darunter weitere Felder angezeigt werden. Sie können für zusätzliche Anpassungen des Webhook-Verhaltens verwendet werden.
sr: У зависности од повратног позива по шаблону, додатна поља могу бити приказана испод овог. Могу се користити за додатно прилагођавање понашања повратног позива.

source: Additional pre-defined webhook fields
de: Zusätzliche vordefinierte Webhook-Felder
sr: Додатна поља повратног позива по шаблону

source: Defaults to off - webhook will always send :ref:`webhook-payload-default` to the target endpoint.
de: Standardmäßig ist diese Option ausgeschaltet - der Webhook sendet immer :ref:`webhook-payload-default` an den Endpunkt.
sr: Подразумевано је искључено - повратни позив ће увек слати :ref:`подразумеване податке <webhook-payload-default>` циљној путањи.

source: When switched on, a code editor will be shown below, where you can configure custom payload for your webhook in JSON format. To insert supported :doc:`/misc/variables` use ``::`` or ``#{`` shortcuts for autocomplete.
de: Nach dem aktivieren wird unten ein Code-Editor angezeigt, in dem Sie benutzerdefinierte Payloads für Ihren Webhook im JSON-Format konfigurieren können. Um unterstützte :doc:`/misc/variables` einzufügen, verwenden Sie ``::`` oder ``#{`` für die Autovervollständigung.
sr: Када је укључено, испод ће бити приказан уредник кода, где можете да подесите прилагођене податке за свој повратни позив у JSON формату. Да бисте уметнули подржане :doc:`променљиве </misc/variables>` користите пречице ``::`` или ``#{`` за претрагу.

source: Custom payload must be valid JSON syntax! Code editor will inform you via automated hints if there is an issue with the code. Also, it will not be possible to save an invalid JSON structure.
de: Benutzerdefinierte Payloads müssen eine gültige JSON-Syntax haben! Der Code-Editor wird Sie darauf hinweisen, wenn es ein Problem mit dem Code gibt. Außerdem ist es nicht möglich, eine ungültige JSON-Struktur zu speichern.
sr: Прилагођени подаци морају бити у исправној JSON синтакси! Уредник кода ће вас обавестити путем аутоматизованих савета ако постоји проблем са кодом. Такође, неће бити могуће сачувати неисправну JSON структуру.

source: Custom payload code editor
de: Editor Benutzerdefinierter Payload
sr: Уредник кода прилагођених података

source: Pre-defined webhooks will always provide an initial custom payload, specific for the associated service.
de: Vordefinierte Webhooks bieten immer einen vordefinierten Payload, der für den zugehörigen Dienst spezifisch ist.
sr: Унапред дефинисани повратни позиви ће увек обезбедити почетне прилагођене податке, специфичне за одговарајући сервис.

source: If required you can leave useful information for other Zammad admins to understand the webhook in question better.
de: Bei Bedarf können Sie weitere Informationen für andere Zammad-Administratoren hinterlegen, damit der betreffende Webhook besser verstanden wird.
sr: Ако је потребно, можете оставити корисне информације другим Zammad администраторима да боље разумеју дотични повратни позив.

source: If set to ``inactive`` you can no longer select the webhook within trigger or scheduler actions.
de: Bei der Einstellung ``nicht aktiv`` kann der Webhook nicht mehr in Triggern oder Automatisierungen ausgewählt werden.
sr: Ако је подешено на ``искључено``, више не можете да изаберете повратни позив у оквиру радњи окидача или планера.

source: Inactive webhooks used by triggers or schedulers will not be fired. If triggers or schedulers have other actions configured as well they will still be executed.
de: Inaktive Webhooks, die in Triggern oder Automatisierungen verwendet werden, werden nicht ausgeführt. Wenn Trigger oder Automatisierungen auch andere Aktionen konfiguriert haben, werden diese trotzdem ausgeführt.
sr: Искључени повратни позиви које користе окидачи или планери неће бити покренути. Ако окидачи или планери имају подешене и друге радње, оне ће се и даље извршавати.

source: Webhook Examples
de: Webhook-Beispiele
sr: Примери повратних позива

source: Use a Mattermost Channel to receive your Zammad Notifications.
de: Verwenden Sie einen Mattermost-Kanal, um Zammad-Benachrichtigungen zu erhalten.
sr: Користите Mattermost канал да бисте примали Zammad обавештења.

source: Sample Mattermost Channel Notification
de: Beispiel einer Mattermost-Kanalbenachrichtigung
sr: Пример обавештења у Mattermost каналу

source: Use a Microsoft Teams Channel to receive your Zammad Notifications.
de: Verwenden Sie einen Microsoft Teams-Kanal, um Zammad-Benachrichtigungen zu erhalten.
sr: Користите Microsoft Teams канал да бисте примали Zammad обавештења.

source: Sample Teams Channel Notification
de: Beispiel Teams Kanalbenachrichtigung
sr: Пример обавештења у Teams каналу

source: Use a Rocket Chat Channel to receive your Zammad Notifications.
de: Verwenden Sie einen Rocket Chat-Kanal, um Zammad-Benachrichtigungen zu erhalten.
sr: Користите Rocket Chat канал да бисте примали Zammad обавештења.

source: Sample Rocket Chat Channel Notification
de: Beispiel einer Rocket Chat-Kanalbenachrichtigung
sr: Пример обавештења у Rocket Chat каналу

source: Use a Slack Channel to receive your Zammad Notifications.
de: Verwenden Sie einen Slack-Kanal, um Zammad-Benachrichtigungen zu erhalten.
sr: Користите Slack канал да бисте примали Zammad обавештења.

source: Sample Slack Channel Notification
de: Beispiel einer Slack-Kanalbenachrichtigung
sr: Пример обавештења у Slack каналу

source: Use the ntfy service to receive push notification from Zammad on different devices like your smartphone.
de: Verwenden Sie den ntfy-Dienst, um Push-Benachrichtigungen von Zammad auf verschiedenen Geräten wie Ihrem Smartphone zu erhalten.
sr: Користите ntfy сервис за пријем пуш обавештења од Zammad-а на различитим уређајима као што су мобилни телефони.
