Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: 🐞 **There are known bugs** in Zammad's processing of emails from Checkmk. This section will be complete once they have been resolved. (Learn more in GitHub issue `#2180 <https://github.com/zammad/zammad/issues/2180>`_.)
de: 🐞 **Es gibt bekannte Fehler** bei der Verarbeitung von E-Mails von Checkmk durch Zammad. Dieser Abschnitt wird vervollständigt, sobald sie behoben sind. (Erfahren Sie mehr in GitHub issue `#2180 <https://github.com/zammad/zammad/issues/2180>`_.)
sr: 🐞 **Постоје познате грешке** у Zammad-овој обради Checkmk имејл порука. Овај одељак ће бити комплетиран када буду решене. (Сазнајте више у GitHub извештају `#2180 <https://github.com/zammad/zammad/issues/2180>`_.)

source: In the meantime, we encourage you to set up API alerts instead.
de: In der Zwischenzeit empfehlen wir Ihnen, stattdessen API-Benachrichtigungen einzurichten.
sr: У међувремену, препоручујемо вам да уместо тога подесите API упозорења.

source: With our Clearbit integration, you can easily enrich the information provided by Zammad. If the customers or agents email address is known to Clearbit, it will share all information it has regarding the user with Zammad.
de: Mit unserer Clearbit-Integration können Sie die von Zammad bereitgestellten Informationen ganz einfach anreichern. Wenn die E-Mail-Adresse des Kunden oder Agenten Clearbit bekannt ist, wird es alle Informationen über den Benutzer mit Zammad teilen.
sr: Уз нашу Clearbit интеграцију, лако можете обогатити информације које пружа Zammad. Ако је имејл адреса клијената или оператера позната Clearbit сервису, он ће поделити све информације које има у вези са корисником са Zammad-ом.

source: Information from Clearbit can include:
de: Die Informationen von Clearbit können umfassen:

source: Address information
de: Informationen zur Adresse
sr: Информације о адреси

source: Website information
de: Informationen zur Website
sr: Информације о сајту

source: A bio (as note by default)
de: Eine Biografie (standardmäßig als Notiz)

source: If needed, you can add further custom objects and add mappings to them, so the Clearbit information can be filled within the database. In general you can get any information from Clearbit, as long as you have a mapping to a Zammad object attribute.
de: Bei Bedarf können Sie weitere benutzerdefinierte Objekte hinzufügen und ihnen Mappings zuweisen. Generell können Sie alle Informationen von Clearbit anzeigen lassen , solange Sie eine Zuordnung zu einem Zammad-Objekt-Atribut eingerichtet haben.

source: Clearbit does have a mapping of fields like LDAP and Exchange have, but does not "win" against Zammad information. This means that if you have e.g. the last name field filled in already and Clearbit has other information on that, it will not be updated.
de: Clearbit hat ein Mapping von Feldern wie LDAP und Exchange, aber es überschreibt keine Zammad-Informationen. Das bedeutet, dass wenn Sie z.B. das Feld für den Nachnamen in Zammad bereits ausgefüllt haben, es von Clearbit nicht überschrieben wird, auch wenn dort andere Informationen vorliegen.
sr: Clearbit поседује мапирање поља као што то раде LDAP и Exchange, али не "побеђује" у сукобу са Zammad подацима. То значи да ако имате нпр. поље за презиме је већ попуњено и Clearbit има друге информације о томе, поље неће бити освежено.

source: However: If let's say the last name has been set by Clearbit and Zammad notices that the last name on the Clearbit source has changed, Zammad will also update this value.
de: Aber: Wenn der Nachname von Clearbit festgelegt wurde und Zammad feststellt, dass sich der Nachname in der Clearbit-Quelle geändert hat, wird Zammad auch diesen Wert aktualisieren.
sr: Међутим: ако је рецимо презиме подесио Clearbit и Zammad примети да се презиме на Clearbit-у променило, Zammad ће такође освежити своју вредност.

source: The configuration of Clearbit is really easy and done fast! Just login to your Clearbit-Account, go to **API** and copy the secret API key.
de: Die Konfiguration von Clearbit ist einfach und schnell erledigt! Loggen Sie sich einfach in Ihren Clearbit-Account ein, gehen Sie auf **API** und kopieren Sie den geheimen API-Schlüssel.

source: Now switch to your Zammad instance, go to *System > Integrations > Clearbit* in the admin panel. Paste your API-Key into the API-Key-Field and decide if Zammad should create unknown organizations automatically, if the user does not have one already (and Clearbit knows it). The shared option decides if the new organizations should be shared ones.
de: Wechseln Sie nun zu Ihrer Zammad-Instanz und gehen Sie im Admin-Bereich zu *System > Integrationen > Clearbit*. Fügen Sie Ihren API-Key in das API-Key-Feld ein und entscheiden Sie, ob Zammad automatisch unbekannte Organisationen erstellen soll, wenn der Benutzer noch keine hat (und Clearbit diese kennt). Die Option shared entscheidet, ob die neuen Organisationen geteilte Organisationen sein sollen.

source: If you're unsure what option to choose, better stick with "no". You can also learn more about :doc:`/manage/organizations/index`.
de: Wenn Sie unsicher sind, welche Option Sie wählen sollen, bleiben Sie besser bei "nein". Sie können mehr dazu unter :doc:`/manage/organizations/index` erfahren.
sr: Ако нисте сигурни коју опцију да одаберете, боље се држите „не”. Такође можете сазнати више о организацијама :doc:`овде </manage/organizations/index>`.

source: The mapping option works similar to the mapping within the Exchange and LDAP sync. You can add further mappings for e.g. custom fields if you need more information that Clearbit can provide.
de: Die Mapping-Option funktioniert ähnlich wie das Mapping innerhalb des Exchange und LDAP Sync. Sie können weitere Mappings für z.B. benutzerdefinierte Felder hinzufügen, wenn Sie weitere Informationen benötigen, die Clearbit bereitstellen kann.

source: If you want to add more Clearbit fields and want to learn more about available fields on their API, you can take a look at their `API documentation <https://dashboard.clearbit.com/docs#enrichment-api>`_.
de: Wenn Sie weitere Clearbit-Felder hinzufügen möchten und mehr über die verfügbaren Felder in der API erfahren möchten, können Sie einen Blick auf deren `API-Dokumentation <https://dashboard.clearbit.com/docs#enrichment-api>`_ werfen.
sr: Ако желите да додате још Clearbit пољa и желите да сазнате више о доступним пољима на њиховом API-ју, можете погледати и њихову `API документацију <https://dashboard.clearbit.com/docs#enrichment-api>`_.

source: If you're happy with the above chosen Settings and your mapping, just save the changes and enable Clearbit integration. Zammad will now start polling the Clearbit API as users contact you.
de: Wenn Sie mit den oben gewählten Einstellungen und Ihrem Mapping zufrieden sind, speichern Sie die Änderungen und aktivieren Sie die Clearbit-Integration. Zammad wird nun die Clearbit-API abfragen, wenn Nutzer Sie kontaktieren.
sr: Ако сте задовољни са горе одабраним подешавањима и вашим мапирањем, само сачувајте промене и укључите Clearbit интеграцију. Zammad ће сада почети да испитује Clearbit API чим вас корисници контактирају.

source: Zammad does not synchronize with Clearbit on a regular basis, but on demand if needed. This saves API calls.
de: Zammad synchronisiert sich nicht regelmäßig mit Clearbit, sondern nur bei Bedarf. Das spart API-Aufrufe.
sr: Zammad се не синхронизује са Clearbit-ом редовно, већ на захтев ако је потребно. Ово понашање штеди у броју API позива.

source: Below the setting and mapping section, you can find the integration logs. You can see what requests Zammad sent to Clearbit and also the APIs response.
de: Unterhalb des Einstellungs- und Mappingbereichs finden Sie die Protokolle der Integration. Sie können sehen, welche Anfragen Zammad an Clearbit gesendet hat und auch die Antwort der API.

source: By the way, you can also view the API log on the Clearbit website - the information seen is basically the same.
de: Übrigens können Sie das API-Protokoll auch auf der Clearbit-Website einsehen - die Informationen sind im Grunde die gleichen.
sr: Узгред, можете погледати и API евиденцију на Clearbit сајту - информације које су доступне су у основи исте.

source: CTI (generic)
de: CTI (allgemein)
sr: CTI (генерички)

source: This integration enables Zammad to provide a caller log to your agents. With this your agents can greet your customers by their name and are supported by Zammad with automatically opening a new ticket dialog or the user profile.
de: Diese Integration ermöglicht es Zammad, Ihren Agenten eine Anruferliste zur Verfügung zu stellen. Damit können Ihre Agenten Ihre Kunden mit ihrem Namen begrüßen und werden von Zammad duruch ein automatisches Öffnen eines Ticket-Erstell-Dialogs oder des Benutzerprofils unterstützt.
sr: Ова интеграција омогућава Zammad-у да обезбеди евиденцију позива вашим оператерима. Са њом ваши оператери могу поздравити ваше клијенте њиховим именом, а Zammad им обезбеђује и аутоматски приказ дијалога новог тикета или корисничког профила.

source: Click the toggle next to the heading to activate or deactivate this integration.
de: Klicken Sie auf Schalter neben der Überschrift ``Placetel``, um diese Integration zu aktivieren oder zu deaktivieren.
sr: Кликните на дугме поред наслова да бисте укључили или искључили ову интеграцију.

source: If you want to learn more on how your agents can use this function, please refer the :user-docs:`user documentation </extras/caller-log.html>`.
de: Wenn Sie mehr darüber erfahren möchten, wie Ihre Agenten diese Funktion nutzen können, lesen Sie bitte die :user-docs:`Benutzerdokumentation </extras/caller-log.html>`.
sr: Ако желите да сазнате више о томе како ваши оператери могу да користе ову функцију, погледајте :user-docs:`корисничку документацију </extras/caller-log.html>`.

source: Automatically opening new ticket dialogues or user profiles requires agent to extension mapping - see more below.
de: Das automatische Öffnen von Ticket-Erstell-Dialogen oder Benutzerprofilen erfordert eine Zuordnung von Agenten in der CTI-Integration - siehe unten.
sr: За аутоматски приказ дијалога нових тикета или корисничких профила потребно је мапирање оператера на локале – погледајте више у наставку.

source: Please note the following limitations to reduce confusion later on:
de: Bitte beachten Sie die folgenden Einschränkungen, um spätere Unklarheiten zu vermeiden:
sr: Имајте на уму следећа ограничења да бисте касније смањили забуну:

source: CTI integrations provide caller log functions only.
de: Die CTI-Integration bieten nur Anruferprotokoll-Funktionen.
sr: CTI интеграције пружају само функције евиденције позива.

source: This integration does not provide any VoIP functionalities; you can't make phone calls from within Zammad.
de: Diese Integration bietet keine VoIP-Funktionen; Sie können von Zammad aus keine Telefonanrufe tätigen.
sr: Ова интеграција не пружа никакве VoIP функционалности; не можете да упућујете телефонске позиве из Zammad-а.

source: If your browser supports ``tel``-URLs, you can click on phone numbers for automatic dialing. This requires additional software / configuration on your agent's computers.
de: Wenn Ihr Browser ``tel``-URLs unterstützt, können Sie auf Telefonnummern klicken, um sie automatisch zu wählen. Dies erfordert zusätzliche Software/Konfiguration auf den Computern Ihrer Mitarbeiter.
sr: Ако ваш претраживач подржава ``tel`` URL адресе, можете кликнути на бројеве телефона за аутоматско бирање. Ово захтева додатни софтвер/конфигурацију на рачунарима вашег оператера.

source: Please provide the following requirements:
de: Folgende Anforderungen müssen erfüllt sein:
sr: Наведите следеће услове:

source: A telephone system that supports webhooks (outbound) (best option are those that allow customizing the calls).
de: Eine Telefonanlage, die Webhooks (ausgehend) unterstützt (am besten solche, die eine individuelle Anpassung der Anrufe ermöglichen).
sr: Телефонска централа која подржава повратне позиве (одлазне) (најбоља опција су оне који омогућавају прилагођавање позива).

source: A unique Call-ID during the call session.
de: Eine eindeutige Call-ID während der Gesprächssitzung.
sr: Јединствени ID позива током сесије позива.

source: Call event data (both numbers and direction).
de: Daten zu Anrufereignissen (sowohl Nummern als auch Richtung).
sr: Подаци о догађају позива (и бројеви и правац).

source: Your Zammad instance must be reachable for your telephony system.
de: Ihre Zammad-Instanz muss für Ihr Telefonsystem erreichbar sein.
sr: Ваша Zammad инстанца мора бити доступна вашој телефонској централи.

source: If you want to learn more on what kind of requests are supported by Zammad and what it expects, please consult our :docs:`CTI-API documentation </api/generic-cti/index.html>`.
de: Wenn Sie mehr darüber erfahren möchten, welche Arten von Anfragen von Zammad unterstützt werden und welche Daten erwartet werden, konsultieren Sie bitte unsere :docs:`CTI-API Dokumentation </api/generic-cti/index.html>`.
sr: Ако желите да сазнате више о томе које врсте захтева Zammad подржава и шта очекује, погледајте нашу :docs:`CTI-API документацију </api/generic-cti/index.html>`.

source: Available Settings
de: Verfügbare Einstellungen
sr: Доступна подешавања

source: Endpoint Settings
de: Endpunkt-Einstellungen
sr: Подешавања путање

source: Zammad will list your generic CTI endpoint here. It contains a unique token so ensure to keep this URL save.
de: Zammad listet hier Ihren generischen CTI-Endpunkt auf. Er enthält ein eindeutiges Token. Bitte achten Sie darauf, die URL möglichst geheim zu halten.
sr: Zammad ће овде навести вашу генеричку CTI путању. Садржи јединствени кључ, па се побрините да сачувате ову URL адресу.

source: You'll need this endpoint for your PBX to talk to Zammad, see :docs:`CTI-API documentation </api/generic-cti/index.html>`.
de: Sie benötigen diesen Endpunkt für Ihre Telefonanlage, um mit Zammad zu sprechen, siehe :docs:`CTI-API Dokumentation </api/generic-cti/index.html>`.
sr: Ова путања је неопходна да би ваша PBX центеала комуницирала са Zammad-ом, за детаље погледајте :docs:`CTI API документацију </api/generic-cti/index.html>`.

source: All following options **do not save automatically**. Always use the Save button on the lower end of the integration page!
de: Alle folgenden Optionen werden **nicht automatisch gespeichert**. Verwenden Sie immer die Schaltfläche "Speichern" am unteren Ende der Seite!
sr: Све следеће опције се **не чувају аутоматски**. Увек користите дугме Сачувај у доњем углу екрана за интеграцију!

source: Call Settings
de: Anruf-Einstellungen
sr: Подешавање позива

source: Inbound
de: Eingehend
sr: Долазнo

source: This option allows you to block specific incoming caller IDs. It allows you to temporarily reject e.g. spam callers without having to contact providers or PBX administrators.
de: Mit dieser Option können Sie bestimmte eingehende Anrufer-IDs blockieren. So können Sie z.B. Spam-Anrufer vorübergehend abweisen, ohne dass Sie sich an Ihren Provider oder PBX-Administrator wenden müssen.
sr: Ова опција вам омогућава да блокирате одређене долазне ID позиваоца. Омогућава вам да привремено одбијете нпр. spam позиваоцe без потребе да контактирате провајдере или PBX администратора.

source: Caller ID to block
de: Zu blockierende Caller-ID
sr: ID позиваоца за блокирање

source: Provide caller IDs to block in ``E.164`` format.
de: Geben Sie die zu blockierenden Anrufer-IDs im Format ``E.164`` an.
sr: Наведите ID позиваоца за блокирање у ``Е.164`` формату.

source: Your telephony system has to support this function. Zammad will send a ``reject`` response which will cause your telephony system to hang up the call. To callers this usually will feel like the line is busy.
de: Ihr Telefonsystem muss diese Funktion unterstützen. Zammad sendet eine ``Abweisen``-Antwort, die Ihr Telefonsystem veranlasst, den Anruf aufzulegen. Für den Anrufer sieht das normalerweise so aus, als ob die Leitung besetzt wäre.
sr: Ваша телефонска централа мора да подржава ову функцију. Zammad ће послати ``reject`` одговор који ће узроковати да ваша централа прекине позив. Позиваоцима ово се обично манифестује као заузета линија.

source: Provide a meaningful note for your fellow administrators to remind yourself why you've chosen to block the number.
de: Verfassen Sie eine aussagekräftige Notiz für Ihre Kollegen, warum Sie die Nummer gesperrt haben.
sr: Унесите смислену напомену за своје колеге администраторе да бисте се их подсетили зашто сте изабрали да блокирате број.

source: Outbound
de: Ausgehend
sr: Одлазнo

source: In many cases you may want to use a different caller ID depending on the destination you're calling. This may apply due to specific connection rates to other countries or because you want your customer to feel you're calling from the same country.
de: In vielen Fällen ist es sinnvoll, je nach Zielland eine andere Anrufer-ID zu verwenden. Dies kann aufgrund spezieller Verbindungstarife in andere Länder der Fall sein oder weil Sie Ihren Kunden das Gefühl geben wollen, dass Sie aus demselben Land anrufen.
sr: У многим случајевима можда ћете желети да користите другачији ID позиваоца у зависности од дестинације коју позивате. Ово се може применити због специфичних стопа везе са другим земљама или зато што желите да ваш клијент примети да зовете из исте земље.

source: This option expects ``E.164`` number formats.
de: Diese Option erwartet ``E.164`` Nummernformate.
sr: Ова опција очекује бројеве у ``Е.164`` формату.

source: Destination caller ID
de: Ziel-Caller-ID
sr: Одредишни ID позиваоца

source: The caller ID or number you're trying to call.
de: Die Anrufer-ID oder die Nummer, die Sie anzurufen versuchen.
sr: ID позиваоца или број који покушавате да позовете.

source: You can use wildcards for e.g. country specific outbound numbers like:
de: Sie können Platzhalter für z.B. länderspezifische ausgehende Nummern verwenden, wie:
sr: Можете користити џокер знакове за нпр. одлазне бројеве специфичне за земљу као што су:

source: ``49*`` for Germany
de: ``49*`` für Deutschland
sr: ``49*`` за Немачку

source: ``4930*`` for Berlin / Germany landlines
de: ``4930*`` für Berlin / Deutschland Festnetze
sr: ``4930*`` за фиксне телефоне из Берлина, Немачка

source: ``33*`` for France
de: ``33*`` für Frankreich
sr: ``33*`` за Француску

source: Set Outbound caller ID
de: Ausgehende Anrufer-ID einstellen
sr: Подеси одлазећи ID позиваоца

source: The outbound caller ID to set (the number your customer sees on his display) in ``E.164`` number format.
de: Die ausgehende Anrufer-ID (die Nummer, die Ihr Kunde auf seinem Display sieht) im Format ``E.164``.
sr: Подешавањен одлазног ID позиваоца (број који ваш клијент види на свом екрану) у ``Е.164`` формату.

source: Provide a short description for fellow administrators.
de: Geben Sie eine kurze Beschreibung für andere Administratoren.
sr: Унесите кратак опис за колеге администраторе.

source: This option requires your PBX to send a specific request to Zammad *before dialing*. Please consult the :docs:`CTI API </cti/api-intro.html>` in case you're not sure.
de: Diese Option erfordert, dass Ihre Telefonanlage eine spezielle Anfrage *vor dem Wählen* an Zammad sendet. Bitte konsultieren Sie die :docs:`CTI API </cti/api-intro.html>`, falls Sie sich nicht sicher sind.
sr: Ова опција захтева да ваша PBX централа пошаље посебан захтев Zammad-у *пре бирања* броја. Молимо погледајте :docs:`CTI API документацију </cti/api-intro.html>` у случају да нисте сигурни.

source: Other Settings
de: Andere Einstellungen
sr: Додатна подешавања

source: Below you can find all available additional settings for this CTI integration. For your overview we're sorting them by appearance and reference their description first.
de: Nachfolgend finden Sie alle verfügbaren zusätzlichen Einstellungen für die CTI-Integration. Sie sind sortiert nach dem Auftreten in der Admin-Oberfläche in Zammad.
sr: Испод можете пронаћи сва доступна додатна подешавања за ову CTI интеграцију. Ради бољег прегледа сортирамо их по реду и прво указујемо на њихов опис.

source: Default caller ID for outbound calls
de: Standard-Rufnummer für ausgehende Anrufe
sr: Подразумевани ID позиваоца за одлазеће позиве

source: Shown records in caller log
de: Anzahl der Einträge im Anrufprotokoll
sr: Приказани записи евиденције позива

source: Allows you to set the number of shown caller log entries for all users. You can choose from the following values:
de: Ermöglicht es Ihnen, die Anzahl der angezeigten Anruf-Protokolleinträge für alle Benutzer festzulegen. Sie können zwischen den folgenden Werten wählen:
sr: Омогућава вам да подесите број приказаних записа у евиденцији позива за све кориснике. Можете бирати између следећих вредности:

source: 60 (default)
de: 60 (Standard)
sr: 60 (подразумевано)

source: **🥵 Potential performance issue**
de: **🥵 Mögliches Performance-Problem**
sr: **🥵 Потенцијални проблем са перформансама**

source: Setting this setting higher than 60 may cause serious performance issues on very busy instances. Keep in mind that this setting causes Zammad to poll and send up to 300 records to *all active agent sessions* in very short time periods.
de: Wenn Sie diese Einstellung auf mehr als 60 setzen, kann dies bei sehr stark ausgelasteten Instanzen zu ernsthaften Performance-Problemen führen. Beachten Sie, dass diese Einstellung bewirkt, dass Zammad in sehr kurzen Zeiträumen bis zu 300 Datensätze bei *allen aktiven Agentensitzungen* anfragt und sendet.
sr: Подешавање ове поставке на више од 60 може изазвати озбиљне проблеме са перформансама у веома заузетим системима. Имајте на уму да ово подешавање доводи до тога да Zammad редовно шаље захтеве и доставља до 300 уноса *свим активним сесијама оператера* у веома кратким временским интервалима.

source: Caller Log Filter
de: Anrufprotokoll-Filter
sr: Филтер евиденције позива

source: This function allows you to provide call information based on e.g. queues only to agents that really need the information.
de: Mit dieser Funktion können Sie Anrufprotokolle basierend auf Warteschleifen oder Nummern nur den Agenten zur Verfügung stellen, die diese Informationen wirklich benötigen.
sr: Ова функција вам омогућава да пружите информације о позиву на основу нпр. редова само оператерима којима су информације заиста потребне.

source: Why? If you have a team for several countries or departments, you don't want to bug your agents from other departments. Leaving these options empty will fallback to showing everything to everyone.
de: Warum? Wenn Sie ein Team für mehrere Länder oder Abteilungen haben, möchten Sie nicht, dass Ihre Mitarbeiter aus anderen Abteilungen gestört werden. Wenn Sie diese Optionen leer lassen, wird wieder alles für alle angezeigt.
sr: Зашто? Ако имате тим за неколико земаља или одељења, не желите да гњавите своје оператере из других одељења. Ако ове опције оставите празне, вратићете се на приказивање свега свима.

source: Destination caller ID or Queue
de: Ziel-Caller-ID oder Queue
sr: Одредишни ID позиваоца или ред

source: This depends on your PBX and usually is either a queue ID, phone number or extension.
de: Dies hängt von Ihrer Telefonanlage ab und ist in der Regel entweder eine Warteschlangen-ID, eine Telefonnummer oder eine Durchwahl.
sr: Ово зависи од ваше PBX централе и обично је или ID реда, број телефона или локал.

source: Agents
de: Agenten
sr: Оператери
