Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: Choose how the heading of the form should be called. This setting is only relevant if you choose to display the form title in the form.
de: Definieren Sie hier den Titel des Formulars. Diese Einstellung ist nur relevant, wenn Sie die Option ``Titel im Formular anzeigen`` aktivieren.
sr: Изаберите како треба да изгледа наслов форме. Ово подешавање је релевантно само ако одаберете да прикажете наслов у форми.

source: Default: ``Feedback Form``
de: Standardwert: ``Feedback-Formular``
sr: Подразумевано: ``Форма повратних информација``

source: Name of form submit button
de: Name für den Absende-Knopf
sr: Назив дугмета за слање форме

source: If Zammad's default display name of the submit button does not fit, you can provide your own wording with this option. It will be used every time the form is shown.
de: Um die Beschriftung des "Übermitteln-Buttons" anzupassen können Sie hier einen Freitext nach Ihrem Wunsch eingeben.
sr: Ако вам Zammad-ов подразумеван назив дугмета за слање не одговара, можете да одредите сопствени текст овом опцијом. Користиће се сваки пут када се форма прикаже.

source: Message after sending form
de: Nachricht nach dem Versenden des Formulars
sr: Порука након слања форме

source: After your user pressed the submit button, they will be provided with a message containing the ticket number of the newly created ticket.
de: Nachdem Ihre Benutzer den "Übermitteln-Knopf" geklickt haben, wird Ihnen eine Nachricht mit der Ticketnummer angezeigt.
sr: Након што корисник притисне дугме за слање, биће му прослеђена порука која садржи број новоотвореног тикета.

source: Default *after* sending a form will look like so:
de: Der Standardtext *nach* Übermitteln des Formulars sieht wie folgt aus:
sr: Подразумевано, *након* слања, форма ће изгледати овако:

source: Options
de: Optionen
sr: Опције

source: Zammad provides the following additional configuration options for your form.
de: Zammad bietet Ihnen die folgenden zusätzlichen Konfigurationsmöglichkeiten.
sr: Zammad пружа следеће додатне опције подешавање за вашу форму.

source: Enable debugging for implementation
de: Debugging für Implementierung aktivieren
sr: Укључи отклањање грешака имплементације

source: This option activates detailed debug information in your browser's developer tools console.
de: Diese Option aktiviert detaillierte Debug-Informationen in der Entwickler-Konsole Ihres Browsers.
sr: Ова опција активира детаљне информације о отклањању грешака у конзоли вашег претраживача.

source: This option *should not* be active on productive forms!
de: Diese Option *sollte nicht* in Produktivsystemen verwendet werden!
sr: Ова опција *не би требало* бити активна на формама у продукцији!

source: Show title in form
de: Titel im Formular anzeigen
sr: Прикажи наслов у форми

source: This setting belongs to the setting ``Title of the form`` and will provide the form title within the form dialogue if selected.
de: Diese Einstellung hängt mit der Einstellung "Titel des Formulars" zusammen und legt fest, ob ein Titel im Formular angezeigt wird.
sr: Ово подешавање припада поставци ``Наслов форме`` и обезбедиће наслов форме ако је подешено.

source: Start modal dialog for form
de: Modal-Dialog für Formular starten
sr: Покрени модални дијалог за форму

source: If selected, the form will be opened in a modal by clicking a button. Not selecting this option allows you to natively integrate the form within your website's body.
de: Sofern ausgewählt, wird das Formular in einem Modal-Dialog beim Klick auf einen Button geöffnet. Sofern die Option nicht ausgewählt ist, wird das Formular innerhalb Ihrer Webseite eingebettet.
sr: Ако је изабранo, форма ће се отворити у модалном дијалогу кликом на дугме. Ако не изаберете ову опцију, можете интегрисати форму у тело вашег сајта.

source: No matter what you select here, the form *is always* loaded completely if your user browses the page containing the form.
de: Unabhängig davon was Sie hier ausgewählt haben, wird das Formular *immer* komplett geladen, wenn ein Benutzer die Seite direkt aufruft.
sr: Без обзира шта изаберете овде, форма се *увек* учитава у потпуности ако ваш корисник прегледа страницу која је садржи.

source: This option is set by default.
de: Diese Einstellung ist standardmäßig aktiviert.
sr: Ова опција је подразумевано подешена.

source: Don't load CSS for the form. You need to generate your own CSS for the form.
de: Kein CSS für das Formular laden. Es muss eigenes CSS für das Formular eingebunden werden.
sr: Без учитавања CSS за форму. Биће неопходно да генеришете сопствени CSS за форму.

source: By default Zammad's form comes with basic CSS. This may not fit your website's design or even interfere with it.
de: Standardmäßig ist ein CSS Basis-Design enthalten. Möglicherweise passt das Design nicht zu dem Ihrer Website oder ist sogar störend.
sr: Подразумевано, Zammad-ов образац долази са основним CSS правилима. Ово можда неће одговарати дизајну вашег сајта или чак сметати.

source: Selecting this option allows you to freely design the form without having to overwrite existing directives.
de: Wenn Sie diese Option aktivieren, können Sie das Formular frei designen, ohne das bestehende Design überschreiben zu müssen.
sr: Избор ове опције вам омогућава да слободно дизајнирате форме без потребе да преписујете постојеће директиве.

source: Add attachment option to upload
de: Hinzufügen einer Option für Anhänge
sr: Додај опцију прилога за отпремање

source: Allows your user to upload **one attachment** to the form.
de: Erlaubt den Benutzern, **eine** Datei als Anhang zum Formular hochzuladen.
sr: Омогућава кориснику да отпреми **један прилог** путем форме.

source: The allowed attachment sizes *is not* limited. The only limitation that applies is your web servers upload limit.
de: Die zulässige Größe der Anhänge ist *nicht* begrenzt. Die einzige vorhandene Beschränkung ist das Upload-Limit Ihres Webservers.
sr: Дозвољене величине прилога *нису* ограничене. Једино ограничење које се примењује је ограничење отпремања вашег веб сервера.

source: If you are a SaaS customer, attachments are limited by the package you've chosen.
de: Wenn Sie ein SaaS-Kunde sind, sind die Anhänge durch das von Ihnen gewählte Paket begrenzt.
sr: Уколико сте SaaS клијент, прилози су ограничени пакетом који сте изабрали.

source: Add agreement text before submit
de: Fügen Sie einen Bestätigungstext vor dem Absenden hinzu
sr: Додај текст споразума пре слања

source: If enabled, this will allow you define a text that the form will display together with a checkbox. Thereby you can ensure your form conforms to legal requirements, e.g. by providing data privacy notes that the user has to accept before submitting the form.
de: Wenn diese Funktion aktiviert ist, können Sie einen Text definieren, den das Formular zusammen mit einer Checkbox anzeigt. Dadurch können Sie sicherstellen, dass das Formular Ihren (gesetzlichen) Anforderungen entspricht und zum Beispiel eine Einwilligung zur Datenverarbeitung von Nutzer einholen.
sr: Ако је укључено, ово ће вам омогућити да дефинишете текст који ће форма приказати заједно са пољем за потврду. На тај начин можете осигурати да је ваша форма у складу са законом, нпр. о пружању напомена о приватности података које корисник мора да прихвати пре подношења форме.

source: Screenshot shows form designer with activated agreement text setting and selected text to add a hyperlink.
de: Screenshot zeigt Formulardesigner mit Einstellung zu einem Vereinbarungstext und merkiertem Text, um einen Hyperlink hinzuzufügen.
sr: Снимак екрана приказује дизајнер форме са укљученим текстом споразума и одабраним текстом за додавање линка.

source: Zammad provides a free text form with limited capabilities. Use the *🔗 Weblink* button to add links to marked text passages.
de: Zammad bietet ein Freitext-Formular mit eingeschränkten Funktionen. Benutzen Sie den *🔗 Weblink* Button, um markierten Wörtern Links hinzuzufügen.
sr: Zammad обезбеђује слободни текстуални унос са ограниченим могућностима. Користите дугме *🔗 Weblink* да бисте додали везе на одговарајуће документе или њихове пасусе.

source: This allows you to link e.g. to your data privacy or ToS information.
de: Damit können Sie z.B. einen Link zu Ihrer Datenschutzerklärung oder Ihren AGBs einfügen.
sr: Ово вам омогућава да повежете нпр. ваше напомене о приватности података или информације о условима коришћења услуге.

source: Preview
de: Vorschau
sr: Преглед

source: Below the form options, Zammad provides a preview section to visualize the settings you've just chosen. By default you'll see a button named *Feedback*.
de: Unter den Optionen für das Formular beinhaltet Zammad einen Vorschaubereich des Formulars. Standardmäßig sehen Sie einen Button mit den Namen **Feedback**.
sr: Испод опција форме, Zammad пружа одељак за приказ и визуелизацију подешавања која сте управо изабрали. Подразумевано ћете видети дугме под називом *Повратне информације*.

source: Clicking on the button will open the form modal. If the form channel is set to active, you already are able to create tickets even from this preview mode.
de: Wenn Sie auf die Schaltfläche klicken, öffnet sich das Formular. Wenn der Formularkanal auf aktiv gesetzt ist, können Sie auch in diesem Vorschaumodus bereits Tickets erstellen.
sr: Кликом на дугме отвориће се дијалог форме. Уколико је канал форме активан, можете отворити тикет чак и из овог режима приказа.

source: Screenshot showing the preview section for the just configured form
de: Screenshot mit Vorschau des konfigurierten Formulars
sr: Снимак екрана који приказује одељак за приказ управо подешене форме

source: The requirement section provides you with everything you need in order to apply Zammad's web form to your website. It basically consists of two parts.
de: Dieser Anforderungs-Bereich enthält alle notwendigen Schritte, um das Webformular auf Ihrer Website einzurichten. Es sind grundsätzlich zwei Dinge zu erledigen.
sr: Одељак са условима вам пружа све што вам је потребно да бисте интегрисали Zammad форму на свом сајту. У основи се састоји од два дела.

source: Header section
de: Header Bereich
sr: Одељак заглавља

source: The first code block provides you with Zammad's current jQuery dependency. This script section usually belongs to your website's header section.
de: Der erste Code-Block enthält die jQuery Anforderung. Das Script wird normalerweise im Header-Bereich Ihrer Website platziert.
sr: Први блок кода вам објашњава да Zammad захтева jQuery. Овај блок скрипте обично припада одељку заглавља ваше интернет презентације.

source: The channel form suggests the following script tag which loads the javascript library required **from an external site**. This may not suite your local requirements. You can use locally hosted jQuery version, **however** the version is fixed.
de: Für das Formular wird folgendes Script-Tag vorgeschlagen, welches die benötigten Javascript-Bibliothek von einer **externen Seite** lädt. Das kann Ihren eigenen Anforderungen widersprechen. Sie können auch eine lokal gehostete jQuery-Version nutzen, **allerdings muss die Version übereinstimmen**.
sr: Форма предлаже копирање блока који учитава потребну JavaScript библиотеку **са спољне локације**. Ово можда неће одговарати вашим локалним захтевима. Можете користити локално хостовану верзију jQuery, **међутим** битно је да буде исте верзије.

source: Do not mix jQuery versions - it's likely to break something.
de: Verwenden Sie nicht verschiedene jQuery-Versionen - die Wahrscheinlichkeit, dass etwas nicht funktioniert ist hoch.
sr: Немојте мешати верзије jQuery - вероватно ће нешто покварити.

source: Body section
de: Body-Sektion
sr: Одељак тела документа

source: The second code block is the actual code required for your form to run. It is updated automatically when changing settings in the designer above.
de: Der zweite Codeblock ist der eigentliche Code, der für die Ausführung Ihres Formulars erforderlich ist. Er wird automatisch aktualisiert, wenn Sie die Einstellungen im obigen Designer ändern.
sr: Други блок кода је уствари код којим можете интегрисати вашу форму. Код се аутоматски ажурира када промените подешавања у дизајнеру изнад.

source: The first line containing ``id="zammad-feedback-form"`` highly depends on the settings selected above. This part belongs into the place you actually want the form or form button to appear.
de: Die erste Zeile, welche ``id="zammad-feedback-form"`` enthält, hängt stark von den gewählten Konfiguration ab. Dieser Bereich gehört an die entsprechende Stelle, wo das Formular erscheinen soll.
sr: Први ред који садржи ``id="zammad-feedback-form"`` у великој мери зависи од изабраних подешавања изнад. Овај део припада месту где заправо желите да се појави форма или дугме форме.

source: The rest can either be placed at the same level or somewhere else on the same page.
de: Der Rest kann ebenfalls dort oder irgendwo anders auf der selben Seite eingefügt werden.
sr: Остатак се може ископирати на исти ниво или негде другде на истој страници.

source: These statements *highly* depend on your website. As you're responsible for your own website, you're on your own figuring out where exactly to place what.
de: Diese Code-Statements hängen allerdings **stark** von Ihrer Website ab. Da Sie selbst für Ihre Website verantwortlich sind, liegt es an Ihnen, die genaue Implementierung in Erfahrung zu bringen und vorzunehmen.
sr: Ова упутства *у великој мери* зависе од вашег сајта. Пошто сте одговорни за своју презентацију, сами одлучујете где тачно шта да поставите.

source: Take the Zammad website as an example, the embedded form version can look like the following if you apply custom CSS to it.
de: Die Zammad Website dient als Beispiel, wie ein eingebettetes Formular mit individuellem CSS aussehen kann.
sr: Узмите за пример сајт Zammad-а, интегрисана форма може изгледати и овако ако на њу примените прилагођена CSS правила.

source: Screenshot showing the zammad.com website with embedded web form
de: Screenshot zeigt die Website zammad.com mit eingebettetem Formular
sr: Снимак екрана који приказује сајт zammad.com са уграђеном формом

source: Potential Spam Issue
de: Potenzielles Spam-Risiko
sr: Потенцијални проблем са нежељеном поштом

source: The Form function could be abused by sending a high amount of messages / tickets to your Zammad instance. If you do not use Zammad Forms: **disable** them.
de: Das Formular könnte missbraucht werden, um eine große Zahl an E-Mails zu verschicken bzw. Tickets in Ihrer Zammad-Instanz zu generieren. Sofern Sie das Formular nicht nutzen: **deaktivieren** Sie es.
sr: Функција форме може бити злоупотребљена слањем велике количине порука/тикета вашој Zammad инстанци. Ако не користите Zammad форме: **искључите** их.

source: But don't worry! Zammad does limit the maximum count of created tickets based on different criteria. It also ensures that the email address being used is valid (with MX-Check on the email's domain).
de: Aber keine Sorge! Zammad begrenzt die Anzahl an erstellten Tickets auf Basis verschiedener Kriterien. Außerdem stellt Zammad sicher, dass die verwendete E-Mail-Adresse gültig ist (mittels MX-Check der E-Mail-Domain).
sr: Али не брините! Zammad ограничава максималан број отворених тикета на основу различитих критеријума. Такође осигурава да је имејл адреса која се користи важећа (са MX провером домена).

source: Form settings to limit ticket creation
de: Formular-Einstellungen zum Limitieren der Ticket-Erstellung
sr: Подешавања форме за ограничавање отварања тикета

source: Default value
de: Standardwert
sr: Подразумевана вредност

source: Description
de: Beschreibung
sr: Опис

source: Limits ticket creation per IP and hour to 20 tickets
de: Schränkt die Erstellung pro IP-Adresse und Stunde auf 20 Tickets ein
sr: Ограничава отварање по IP адреси и сату на 20 тикета

source: Limits ticket creation per IP and day to 240 tickets
de: Schränkt die Erstellung pro IP-Adresse und Tag auf 240 Tickets ein
sr: Ограничава отварање по IP адреси и дану на 240 тикета

source: Limits ticket creation for forms to 5000 tickets per day
de: Schränkt die Erstellung durch ein Formular auf 5000 Tickets pro Tag ein
sr: Ограничава форме за отварање на 5000 тикета дневно

source: You can change these default values. Please keep in mind, that setting those values higher might lead to problems in term of created tickets.
de: Sie können diese Standard-Werte anpassen. Bitte bedenken Sie, dass eine Erhöhung ggf. Probleme in Sachen Ticketaufkommen verursacht.
sr: Можете променити ове подразумеване вредности. Имајте на уму да постављање ових вредности на веће може довести до проблема у погледу отворених тикета.

source: Please note that the following changes require console access to your Zammad host.
de: Bitte beachten Sie, dass die folgenden Anpassungen Zugriff auf die Konsole des Zammad-Hosts erfordern.
sr: Имајте на уму да следеће промене захтевају приступ конзоли вашем Zammad серверу.

source: **Change the ticket creation per IP and hour to 10**::
de: **Änderung der Ticketerstellung pro IP-Adresse und Stunde auf 10 Tickets**::
sr: **Измена отварања тикета по IP адреси и сату на 10**::

source: **Change the ticket creation per IP and hour to 50**::
de: **Änderung der Ticketerstellung pro IP-Adresse und Stunde auf 50 Tickets**::
sr: **Измена отварања тикета по IP адреси и сату на 50**::

source: **Change the ticket creation per day to 500**::
de: **Änderung der Ticketerstellung pro Tag auf 500 Tickets**::
sr: **Измена отварања тикета по дану на 500**::

source: Further Options to Make it Harder
de: Weitere Maßnahmen, um Missbrauch zu erschweren
sr: Додатне опције да отежају злоупотребе

source: Another way to make it harder for bots to automate against your Zammad instance is to change the location of ``form.js`` ( ``/opt/zammad/assets/form/form.js`` ).
de: Als weitere Maßnahme, um Bots die Arbeit zu erschweren, können Sie den Speicherort der ``form.js`` ( ``/opt/zammad/assets/form/form.js`` ) ändern.
sr: Други начин да ботовима отежате аутоматизацију у односу на вашу Zammad инстанцу је да промените локацију ``form.js`` ( ``/opt/zammad/assets/form/form.js`` ).

source: Please keep in mind if you change the location of ``form.js`` (by e.g. copying) that you need to ensure that your ``form.js`` stays up to date if you update Zammad.
de: Bitte beachten Sie, dass Sie beim Ändern des Verzeichnisses der ``form.js`` (z.B. durch Kopieren) sicherstellen müssen, dass ``forms.js`` beim Aktualisieren von Zammad ebenfalls auf Aktualisierung geprüft werden muss.
sr: Имајте на уму ако промените локацију ``form.js`` (нпр. копирањем) да морате да обезбедите да ваш ``form.js`` остане ажуран ако ажурирате Zammad.

source: It's not recommended to delete form.js from it's location in that case, but to forbid access to it via your web server configuration.
de: In diesem Fall empfehlen wir nicht, ``forms.js`` vom ursprünglichen Speicherort zu löschen, sondern den Zugriff über die Konfiguration Ihres Webservers zu unterbinden.
sr: У том случају се не препоручује брисање form.js са његове оригиналне локације, већ забрана приступа преко конфигурације вашег веб сервера.

source: Managing accounts in Google channels works nearly identically as for email channels. This is why the section has been adopted almost verbatim from :doc:`here </channels/email/accounts/managing-accounts>`.
de: Die Verwaltung von Konten in Google-Kanälen funktioniert fast identisch wie bei E-Mail-Kanälen. Deshalb wurde der Abschnitt fast wörtlich von :doc:`hier </channels/email/accounts/managing-accounts>` übernommen.
sr: Управљање налозима Google каналa функционише идентично као за имејл канале. Зато је овај чланак дословно пренешен :doc:`одавде </channels/email/accounts/managing-accounts>`.

source: Fetch Preferences
de: Einstellungen abrufen
sr: Подешавања преузимања

source: Click **Edit** on inbound account details to change how messages are retrieved from your account.
de: Klicken Sie im entsprechenden Konto unter "Eingehend" auf **Bearbeiten** , um den Abruf von Nachrichten für das Konto zu ändern.
sr: Кликните на **Измени** на детаљима долазног налога да бисте променили начин на који се поруке преузимају са вашег налога.

source: See :ref:`New Account Settings <google-folder>` for a detailed description of each option.
de: Siehe :ref:`Neues Konto einrichten <google-folder>` für eine detaillierte Beschreibung der einzelnen Optionen.
sr: Погледајте :ref:`Нова подешавања налога <google-folder>` за детаљан опис сваке опције.

source: (There's no need to manage orphaned email addresses like you would on an email channel. In Google channels, aliases are connected to your Gmail account, which means they can be imported and purged automatically.)
de: (Es ist nicht notwendig, alte E-Mail-Adressen wie in den E-Mail-Kanälen zu löschen. In Google-Kanälen sind Aliase mit dem Gmail-Konto verknüpft, weshalb diese automatisch importiert und gelöscht werden können.)
sr: (Нема потребе да управљате напуштеним имејл адресама као што бисте то урадили на имејл каналу. У Google каналима, псеудоними су повезани са вашим Gmail налогом, што значи да могу да се увезу и аутоматски обришу.)

source: Secondary addresses for accounts in Google channels work the same way as in email channels. This is why the section has been adopted verbatim from :doc:`here </channels/email/accounts/secondary-addresses>`.
de: Zusätzliche Adressen für Konten in Google-Kanälen funktionieren genauso wie in E-Mail-Kanälen. Deshalb wurde der Abschnitt wörtlich aus :doc:`hier </channels/email/accounts/secondary-addresses>` übernommen.
sr: Секундарне адресе у Google каналима функционишу идентично као у имејл каналима. Зато је овај чланак дословно пренешен :doc:`одавде </channels/email/accounts/secondary-addresses>`.

source: 👀 **Secondary addresses must be added and verified in your Gmail settings first.**
de: 👀 **Zusätzliche Adressen müssen zuerst in den Gmail-Einstellungen hinzugefügt und bestätigt werden.**
sr: 👀 **Секундарне адресе прво морају да се додају и верификују у вашим Gmail подешавањима.**

source: Gmail has its own process for adding and verifying aliases (under **Settings > Accounts and Import > Send mail as**). If you add an alias here before adding it in your Gmail settings, Google will refuse to dispatch it.
de: Gmail hat einen eigenen Prozess, um Alias-Adressen hinzuzufügen und zu bestätigen (unter **Settings > Accounts and Import > Send mail as**). Fügen Sie Alias-Adressen zunächst dort hinzu, andernfalls verweigert Google deren Nutzung.
sr: Gmail има сопствени процес за додавање и верификацију алијаса (у оквиру **Settings > Accounts and Import > Send mail as**). Ако овде додате псеудоним пре него што га додате у Gmail подешавања, Google ће га одбити.

source: G Suite users may need to contact their administrators in order to add aliases in their Gmail settings.
de: G-Suite-Benutzer müssen Ihren Administrator kontaktieren, um Alias-Adressen in den Gmail-Einstellungen hinzufügen zu können.
sr: Корисници G Suite-а ће можда морати да контактирају своје администраторе да би додали псеудониме у Gmail подешавањима.

source: Basic Setup
de: Grundeinrichtung
sr: Основно подешавање
