Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: In other words, it guarantees message **privacy** and **data security**.
de: Mit anderen Worten, es garantiert die **Privatsphäre** und **Datensicherheit** einer Nachricht.
sr: Другим речима, гарантује **приватност** и **безбедност података**.

source: Screenshot of ticket creation with encrypt and sign buttons
de: Screenshot der Ticketerstellung mit Schaltflächen zum Verschlüsseln und Signieren
sr: Снимак екрана за отварање тикета са дугмићима за шифровање и потписивање

source: Once PGP has been enabled, 🔒 **Encrypt** and ✅ **Sign** buttons will appear in the ticket composer.
de: Sobald PGP aktiviert ist, erscheinen die Schaltflächen 🔒 **Verschlüsseln** und ✅ **Signieren** in der Ticket Ansicht.
sr: Када је PGP укључен, дугмићи 🔒 **Шифровање** и ✅ **Потписивање** појавиће се у дијалогу новог тикета.

source: **Sign button not visible?**
de: **Schaltfläche zum Signieren nicht sichtbar?**
sr: **Дугме за потписивање није видљиво?**

source: Please note that the signing of emails is based on the outgoing email account. That means you have to choose a group with a sender email account, which has a private key assigned.
de: Bitte beachten Sie, dass das Signieren von E-Mails auf dem ausgehenden E-Mail-Konto basiert. Das heißt, Sie müssen eine Gruppe mit einem Absender-E-Mail-Konto auswählen, dem ein privater Schlüssel zugewiesen ist.
sr: Имајте на уму да се потписивање имејл порука заснива на налогу одлазне поште. То значи да морате да изаберете групу повезану са имејл адресом пошиљаоца, којој је додељен приватни кључ.

source: Handling of Keys
de: Verwaltung von Schlüsseln
sr: Руковање кључевима

source: To use the PGP function, you have to enable the integration (PGP) by switching the toggle to *enabled*.
de: Um die PGP-Funktion zu nutzen, müssen Sie die Integration (PGP) aktivieren, indem Sie den Schalter auf *aktiviert* stellen.
sr: Да бисте користили PGP функцију, морате да укључите PGP интеграцију пребацивањем прекидача на *укључено*.

source: You can add keys by clicking the *add key* button. The keys can be imported from a file or you can paste the content of the key in the text box.
de: Sie können Schlüssel hinzufügen, indem Sie auf die Schaltfläche *Schlüssel hinzufügen* klicken. Die Schlüssel können aus einer Datei importiert werden oder Sie können den Inhalt des Schlüssels in das Textfeld einfügen.
sr: Можете додати кључеве кликом на дугме *додај кључ*. Кључеви се могу увести из датотеке или можете налепити садржај кључа у поље текста.

source: **Which keys do I have to import?**
de: **Welche Schlüssel muss ich importieren?**
sr: **Које кључеве треба да увезем?**

source: For **signing** *outgoing* emails, you have to import the private key of your Zammad email account.
de: Zum **Signieren** von *ausgehenden* E-Mails müssen Sie den privaten Schlüssel Ihres Zammad-E-Mail-Kontos importieren.
sr: За **потписивање** *одлазних* порука, морате да увезете приватни кључ ваше Zammad имејл адресе.

source: For **encrypting** *outgoing* emails, you have to import the public key of the customer's email account.
de: Für die **Verschlüsselung** von *ausgehenden* E-Mails müssen Sie den öffentlichen Schlüssel des E-Mail-Kontos des Kunden importieren.
sr: За **шифровање** *одлазних* порука, морате да увезете јавни кључ имејл адресе клијента.

source: For **verifying the signature** of signed *incoming* emails, you have to import the public key of the customer.
de: Zur **Prüfung der Signatur** von signierten *eingehenden E-Mails* müssen Sie den öffentlichen Schlüssel des Kunden importieren.
sr: За **верификацију потписа** потписаних *долазних* порука, морате да увезете јавни кључ имејл адресе клијента.

source: For **decrypting** of encrypted *incoming* emails, you have to import the private key of your Zammad email account.
de: Zum **Entschlüsseln** von verschlüsselten *eingehenden E-Mails* müssen Sie den privaten Schlüssel Ihres Zammad-E-Mail-Kontos importieren.
sr: За **дешифровање** шифрованих *долазних* порука, морате да увезете приватни кључ ваше Zammad имејл адресе.

source: Import Keys From a File
de: Importieren von Schlüsseln aus einer Datei
sr: Увоз кључева из датотеке

source: You can import keys from a file in the section **Upload key**:
de: Sie können Schlüssel aus einer Datei im Abschnitt **Schlüssel hochladen** importieren:
sr: Можете да увезете кључ из датотеке у одељку **Отпреми кључ**:

source: Screenshot of adding a key via file
de: Screenshot zeigt das Hinzufügen eines Schlüssels aus eine Datei
sr: Снимак екрана додавања кључа путем датотеке

source: **Supported file formats:** ASCII-armor as well as binary GPG format (basically any GPG supported key format) is supported here.
de: **Unterstützte Dateiformate:** Unterstützt werden sowohl das ASCII-Armor- als auch das binäre GPG-Format (grundsätzlich jedes von GPG unterstützte Schlüsselformat).
sr: **Подржани формати кључева:** овде је подржан ASCII armor као и бинарни GPG формат (у основи било који формат кључа који подржава GPG).

source: Import Keys by Pasting the Content
de: Importieren von Schlüsseln durch Einfügen des Inhalts
sr: Увоз кључева налепљивањем текста

source: You can also paste the key's content in the section **paste key**:
de: Sie können den Inhalt des Schlüssels auch in den Abschnitt **Schlüssel einfügen** kopieren:
sr: Такође можете да налепите садржај кључа у одељак **Налепи кључ**:

source: Screenshot of adding a key via pasting
de: Screenshot zeigt das Hinzufügen eines Schlüssels durch Einfügen
sr: Снимак екрана додавања кључа путем налепљивања текста

source: **Supported format:** Please note that only ASCII-armor is supported here.
de: **Unterstütztes Format:** Bitte beachten Sie, dass hier nur das ASCII-armor Format unterstützt wird.
sr: **Подржани формат кључа:** Имајте на уму да је овде подржан само ASCII armor формат.

source: Deleting Keys
de: Schlüssel Löschen
sr: Брисање кључева

source: If you want to delete a specific key, you can do it by clicking on the menu in the *actions* column and select **delete**:
de: Wenn Sie einen bestimmten Schlüssel löschen möchten, können Sie dies tun, indem Sie auf das Menü in der Spalte *Aktionen* klicken und **Löschen** wählen:
sr: Ако желите да избришете одређени кључ, то можете учинити тако што ћете кликнути на мени у колони *радње* и изабрати **избриши**:

source: Screenshot of deleting a key
de: Screenshot zeigt Löschen eines Schlüssels
sr: Снимак екрана брисања кључа

source: Downloading Keys
de: Herunterladen von Schlüsseln
sr: Преузимање кључева

source: If you want to download your keys, you can do this as well via corresponding action buttons. Depending on the key, you can choose wether you want to download the private or the public key.
de: Wenn Sie Ihre Schlüssel herunterladen möchten, können Sie dies ebenfalls über die entsprechenden Aktionsschaltflächen tun. Je nach Schlüssel können Sie wählen, ob Sie den privaten oder den öffentlichen Schlüssel herunterladen möchten.
sr: Ако желите да преузмете своје кључеве, то можете учинити и путем одговарајућих дугмића за радњу. У зависности од врсте кључа, можете изабрати да ли желите да преузмете приватни или јавни кључ.

source: Default Behavior
de: Standard-Verhalten
sr: Подразумевано понашање

source: Here you can adjust on per group basis, if *sign* and *encryption* is on or off by default. Please be aware, that agents can always override the setting for each individual article.
de: Hier können Sie für jede Gruppe einstellen, ob *Signieren* und *Verschlüsselung* standardmäßig ein- oder ausgeschaltet sind. Bitte beachten Sie, dass Agenten die Einstellung für jeden einzelnen Artikel jederzeit überschreiben können.
sr: Овде можете да прилагодите по групама, ако су *потписивање* и *шифровање* подразумевано укључени или искључени. Имајте на уму да оператери увек могу преиначити подешавање за сваки појединачни чланак.

source: Adjusting default behavior on per group basis
de: Anpassung des Standardverhaltens für jede Gruppe
sr: Прилагођавање подразумеваног понашања по групи

source: Here you can see the last actions regarding signing and encryption and if they were successful.
de: Hier sehen Sie die letzten Aktionen bezüglich Signierung und Verschlüsselung und ob sie erfolgreich waren.
sr: Овде можете видети последње радње у вези са потписивањем и шифровањем и да ли су биле успешне.

source: **Sign button is not visible, but keys are imported.**
de: **Die Schaltfläche "Signieren" ist nicht sichtbar, aber die Schlüssel wurden importiert.**
sr: **Дугме за потписивање није видљиво, али су кључеви увезени.**

source: Did you choose a group in the ticket?
de: Haben Sie eine Gruppe in dem Ticket ausgewählt?
sr: Да ли сте одабрали групу тикета?

source: Did you import a private key for the email adress, which is used for outgoing emails in the group?
de: Haben Sie einen privaten Schlüssel für die E-Mail-Adresse importiert, die für ausgehende E-Mails in der Gruppe verwendet wird?
sr: Да ли сте увезли приватни кључ за имејл адресу која се користи за одлазне поруке у групи?

source: **How to obtain keys?**
de: **Wie erhält man Schlüssel?**
sr: **Како доћи до кључева?**

source: You can create them yourself! There are some good tutorials on the web on how to create them. Providing keys to Zammad is a prerequisite to use the PGP feature.
de: Sie können sie selbst erstellen! Es gibt einige gute Anleitungen im Internet, wie man sie erstellt. Die Bereitstellung von Schlüsseln an Zammad ist eine Voraussetzung für die Nutzung der PGP-Funktion.
sr: Можете их генерисати сами! Постоји неколико добрих упутстава на интернету о томе како да их креирате. Достава кључева у Zammad је предуслов за коришћење PGP функције.

source: **It says a passphrase is needed, but I haven't got one.**
de: **Mir wird angezeigt dass eine Passphrase erforderlich ist, aber ich habe keine.**
sr: **Каже да је потребна лозинка, али ја је немам.**

source: If the key is secured with a passphrase, you have to provide it for the import in Zammad. It is possible that keys may have an empty passphrase. However, this is *not* recommended.
de: Wenn der Schlüssel mit einer Passphrase gesichert ist, müssen Sie diese für den Import in Zammad angeben. Es ist möglich, dass die Schlüssel eine leere Passphrase haben. Dies wird jedoch *nicht* empfohlen.
sr: Ако је кључ обезбеђен лозинком, морате је обезбедити приликом увоза у Zammad. Могуће је да кључеви имају и празну лозинку. Међутим, ово се *не* препоручује.

source: **How do my customers get my new key?**
de: **Wie bekommen meine Kunden meinen neuen Schlüssel?**
sr: **Како моји клијенти добављају мој нови кључ?**

source: You have to provide your **public** key in advance. Your customer also has to configure PGP in their email workflow and import your public key. The other way round, you have to get the public key of your customer and have to import it to Zammad.
de: Sie müssen Ihren **öffentlichen** Schlüssel im Voraus bereitstellen. Ihr Kunde muss außerdem PGP in seinem E-Mail-Workflow konfigurieren und Ihren öffentlichen Schlüssel importieren. Umgekehrt müssen Sie sich den öffentlichen Schlüssel Ihres Kunden besorgen und ihn in Zammad importieren.
sr: Морате унапред да им доставите свој **јавни** кључ. Ваш клијент такође мора да подеси PGP у свом имејл окружењу и увезе ваш јавни кључ. Обрнуто, морате да добавите јавни кључ вашег клијента и да га увезете у Zammad.

source: S/MIME is the most widely-supported method for secure email communication. With S/MIME, you can exchange **signed** and **encrypted** messages with others.
de: S/MIME ist die am weitesten verbreitete Methode für sichere E-Mail-Kommunikation. Mit S/MIME können Sie **signierte** und **verschlüsselte** Nachrichten mit anderen austauschen.
sr: S/MIME је најшире подржани метод за безбедну комуникацију путем имејла. Са S/MIME, можете да размењујете **потписане** и **шифроване** поруке са другима.

source: is proof that a message hasn't been tampered with or sent by an impersonator.
de: ist der Beweis, dass eine Nachricht nicht manipuliert oder von einem Unbekannten gesendet wurde.
sr: је доказ да порука није мењана или послата од стране имитатора.

source: In other words, it guarantees a message's **integrity** and **authenticity**.
de: Mit anderen Worten, es garantiert die **Integrität** und **Authentizität** einer Nachricht.
sr: Другим речима, гарантује **интегритет** и **аутентичност** поруке.

source: In other words, it guarantees **privacy** and **data security**.
de: Mit anderen Worten, es garantiert **Privatsphäre** und **Datensicherheit**.
sr: Другим речима, гарантује **приватност** и **безбедност података**.

source: Screencast demo of S/MIME features for both new tickets and replies
de: Bildschirmaufzeichnung von S/MIME-Funktionen für neue Tickets und Antworten
sr: Снимак екрана са S/MIME функцијом за нове тикете и одговоре

source: Once S/MIME has been enabled, 🔒 **Encrypt** and ✅ **Sign** buttons will appear in the ticket composer.
de: Sobald S/MIME aktiviert ist, erscheinen die Schaltflächen 🔒 **Verschlüsseln** und ✅ **Signieren** in der Ticket Ansicht.
sr: Када се S/MIME укључи, дугмићи 🔒 **Шифровање** и ✅ **Потписивање** појавиће се у дијалогу новог тикета.

source: :doc:`Prerequisites <prerequisites>`
de: :doc:`Voraussetzungen <prerequisites>`

source: New to S/MIME? This section helps you to find certificate providers and points out Limitations.
de: Neu in S/MIME? Dieser Abschnitt hilft Ihnen, Zertifikatsanbieter zu finden und weist auf Einschränkungen hin.
sr: Нови сте у S/MIME свету? Овај одељак вам помаже да пронађете провајдере сертификата и указује на постојећа ограничења.

source: :doc:`Manage Certificates <manage-certificates>`
de: :doc:`Zertifikate verwalten <manage-certificates>`

source: Add and download certificates; configure group default behaviors.
de: Hinzufügen und Herunterladen von Zertifikaten; Konfigurieren des Standardverhaltens von Gruppen.
sr: Додајте и преузмите сертификате; подесите подразумевано понашање група.

source: :doc:`Troubleshooting <troubleshooting>`
de: :doc:`Fehlersuche <troubleshooting>`

source: Took a wrong turn? About recent logs and common issues.
de: Sie sind falsch abgebogen? Über Protokolle und häufige Probleme.
sr: Погрешно сте скренули код Албукеркија? О недавним уносима евиденције и уобичајеним проблемима.

source: For more details on how S/MIME integration works on the agent side, see the :user-docs:`user docs </extras/secure-email.html>`.
de: Wie die S/MIME-Integration auf Agenten-Seite funktioniert erfahren Sie in der :user-docs:`Benutzerdokumentation </extras/secure-email.html>`.
sr: За више детаља о томе како S/MIME интеграција функционише на страни оператера, погледајте :user-docs:`корисничку документацију </extras/secure-email.html>`.

source: Manage Certificates
de: Verwalten von Zertifikaten
sr: Управљање сертификатима

source: S/MIME is **disabled by default**. Enable it to start adding certificates.
de: S/MIME ist standardmäßig **deaktiviert**. Aktivieren Sie es, um Zertifikaten hinzuzufügen.
sr: S/MIME је **подразумевано искључен**. Укључите га да бисте почели да додајете сертификате.

source: Dialogue to add new certificates or private keys
de: Dialog zum Hinzufügen neuer Zertifikate oder privater Schlüssel
sr: Дијалог за додавање нових сертификата или тајних кључева

source: Manage certificates in the Admin Panel under **System > Integrations > S/MIME**. Certificates may be pasted in as plain text or uploaded from a file.
de: Verwalten Sie Zertifikate im Admin Panel unter **System > Integrationen > S/MIME**. Die Zertifikate können als einfacher Text eingefügt oder aus einer Datei hochgeladen werden.
sr: Управљање сертификатима се обавља у административном панелу под **Систем > Интеграције > S/MIME**. Сертификати се могу налепити као обичан текст или отпремити из датотеке.

source: Add Certificate Data
de: Zertifikatsdaten hinzufügen
sr: Додавање података о сертификату

source: Add Certificate
de: Zertifikat hinzufügen
sr: Додај сертификат

source: Import public-key certificates for both your own organization and your contacts.
de: Importieren Sie Public-Key-Zertifikate sowohl für Ihr eigenes Unternehmen als auch für Ihre Kontakte.
sr: Увезите јавни сертификат и за своју организацију и за своје контакте.

source: You can also add a bunch of certificates in one go by providing a single file with all relevant certificates.
de: Sie können auch eine Reihe von Zertifikaten auf einmal hinzufügen, indem Sie eine einzige Datei mit allen relevanten Zertifikaten bereitstellen.
sr: Такође можете додати више сертификата одједном тако што ћете обезбедити једну датотеку са свим релевантним сертификатима.

source: 🕵️ **ALWAYS verify certificates in-person or over the phone!**
de: 🕵️ **IMMER die Zertifikate persönlich oder telefonisch überprüfen!**
sr: 🕵 ** УВЕК проверите добијене сертификате лично или телефоном!**

source: The whole point of signatures is to alert you when someone is trying to pretend to be someone they're not. Never accept a certificate from someone online without verifying it first.
de: Der Sinn von Signaturen ist es, Sie zu warnen, wenn jemand versucht sich als jemand auszugeben, der er nicht ist. Akzeptieren Sie niemals ein Zertifikat von jemandem, ohne es vorher zu überprüfen.
sr: Читава поента потписа је да вас упозори ако неко покушава да се преставља као нека друга особа. Никада не прихватајте сертификат од некога на мрежи, а да га претходно нисте проверили.

source: 📇 **What about trusted certificate authorities?**
de: 📇 **Was ist mit vertrauenswürdigen Zertifizierungsstellen?**
sr: 📇 **А шта са поузданим органима за сертификацију?**

source: In some cases (e.g. when dealing with large enterprises), you may be given a certificate for an entire CA, rather than a single contact. Add it here to trust *all* certificates issued by that CA.
de: In manchen Fällen (z.B. bei großen Unternehmen) kann es vorkommen, dass Sie ein Zertifikat für eine ganze CA erhalten und nicht nur für einen einzelnen Kontakt. Fügen Sie es hier hinzu, um *allen* von dieser CA ausgestellten Zertifikaten zu vertrauen.
sr: У неким случајевима (нпр. када имате посла са великим предузећима), можда ћете добити CA сертификат, а не само за један контакт. Додајте га овде да бисте убудуће веровали *свим* сертификатима које је издао тај CA.

source: Commercial CAs can usually be verified online. Zammad does not include a list of built-in, trusted CAs.
de: Kommerzielle CAs können in der Regel online verifiziert werden. Zammad enthält keine Liste mit eingebauten, vertrauenswürdigen CAs.
sr: Комерцијални CA се обично могу проверити путем мреже. Zammad не садржи уграђене CA сертификате.

source: Add Private Key
de: Privaten Schlüssel hinzufügen
sr: Додавање тајног кључа

source: Once you've added a public-key certificate, you can import its matching private key.
de: Sobald Sie ein öffentliches Zertifikat hinzugefügt haben können Sie den dazugehörigen privaten Schlüssel importieren.
sr: Када додате јавни сертификат, можете да увезете и његов одговарајући тајни кључ.

source: Private keys are for **your own organization only**; never ask your contacts for their private keys.
de: Private Schlüssel sind nur für **Ihre eigene Organisation**; fragen Sie niemals Ihre Kontakte nach deren privaten Schlüsseln.
sr: Тајни кључеви су за **само вашу организацију**; никада не питајте своје контакте за њихове приватне кључеве.

source: S/MIME integration showing configured certificates and possible issues with Logging
de: S/MIME-Integration mit konfigurierten Zertifikaten und möglichen Problemen mit der Protokollierung
sr: S/MIME интеграција која приказује подешене сертификате и могуће проблеме у евиденцији

source: A note is displayed on certificates with a matching private key (see line 2).
de: Bei Zertifikaten mit passendem privaten Schlüssel wird ein Hinweis angezeigt (siehe Zeile 2).
sr: На сертификатима са одговарајућим тајним кључем приказана је напомена (погледајте други ред).

source: 📤 **Certificates and private keys must be uploaded separately.**
de: 📤 **Zertifikate und private Schlüssel müssen separat hochgeladen werden.**
sr: 📤 **Сертификати и тајни кључеви морају да се увезу одвојено једни од других.**

source: If your certificate and private key are bundled together in the same file or PEM block, import it twice (once using each button).
de: Wenn Ihr Zertifikat und Ihr privater Schlüssel in derselben Datei oder demselben PEM-Block gebündelt sind, importieren Sie sie zweimal (einmal mit jeder Schaltfläche).
sr: Ако су ваш сертификат и тајни кључ комбиновани у исту датотеку или PEM блоку, увезите их два пута (по једном користећи свако дугме).

source: Please note that bulk imports of private keys are not possible.
de: Bitte beachten Sie, dass ein Massenimport von privaten Schlüsseln nicht möglich ist.
sr: Имајте на уму да масовна радња увоза тајних кључева није могућа.

source: Download Certificate Data
de: Zertifikat herunterladen
sr: Преузмите податке о сертификату

source: You can download the earlier provided certificates and private keys at any time from your Zammad instance.
de: Sie können die zuvor bereitgestellten Zertifikate und privaten Schlüssel jederzeit von Ihrer Zammad-Instanz herunterladen.
sr: Можете преузети раније достављене сертификате и тајне кључеве у било ком тренутку из своје Zammad инстанце.

source: Please note that passphrase-protected private keys stay protected and when you download them, you have to know the passphrase to use them after downloading.
de: Bitte beachten Sie, dass Passphrase geschützte private Schlüssel geschützt bleiben. Wenn Sie sie herunterladen, müssen Sie die Passphrase kennen, um sie nach dem Herunterladen zu verwenden.
sr: Обратите пажњу да тајни кључеви заштићени лозинком остају заштићени и када их преузмете, мораћете да знате лозинку да бисте их користили по преузимању.

source: Dialogue to download certificates or private keys
de: Dialog zum Herunterladen von Zertifikaten oder privaten Schlüsseln
sr: Дијалог за преузимање сертификата или тајних кључева

source: Download stored certificates and their keys
de: Herunterladen gespeicherter Zertifikate und ihrer Schlüssel
sr: Преузмите сачуване сертификате и њихове кључеве

source: The ticket composer will set all outgoing messages to **signed and encrypted** by default (assuming the required certificates exist).
de: Die Ticket-Bearbeitungs-Funktion setzt alle ausgehenden Nachrichten standardmäßig auf **signiert und verschlüsselt** (vorausgesetzt, die erforderlichen Zertifikate sind vorhanden).
sr: Дијалог новог тикета ће укључити **потписивање и шифровање** за све одлазне поруке по подразумеваној вредности (под претпоставком да одговарајући сертификати постоје).

source: These defaults can be modified on a per-group basis:
de: Diese Standardwerte können für jede Gruppe einzeln geändert werden:
sr: Ове подразумеване вредности могу да се мењају на основу групе:

source: Zammad allowing to choose the default behavior on per group basis
de: Zammad ermöglicht die Auswahl des Standardverhaltens für jede Gruppe
sr: Zammad омогућава подешавање подразумеваног понашања по одабраној групи

source: Of course, agents can always manually change these settings on each email they send out.
de: Natürlich können Agenten diese Einstellungen bei jeder E-Mail, die sie versenden, manuell ändern.
sr: Наравно, оператери увек могу ручно да преиначе ова подешавања за сваку имејл поруку коју пошаљу.

source: A certificate *and* private key for your own organization to **sign outgoing messages** and **decrypt incoming messages**.
de: Ein Zertifikat *und* ein privater Schlüssel für Ihre eigene Organisation zum **Signieren ausgehender Nachrichten** und **Entschlüsseln eingehender Nachrichten**.
