Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: ``2019-10-07 16:25:00 UTC`` or empty if not applicable yet (Please note `Ticket last contact behavior Settings <https://admin-docs.zammad.org/en/latest/settings-ticket.html>`_ for this)
de: ``2019-10-07 16:25:00 UTC`` oder leer, wenn noch nicht zutreffend (bitte beachten Sie hierzu `Ticketeinstellung letzter Kontakt <https://admin-docs.zammad.org/en/latest/settings-ticket.html>`_)
sr: ``2019-10-07 16:25:00 UTC`` или празно ако не постоји (Обратите пажњу на `подешавање понашања последњег одговора тикета <https://admin-docs.zammad.org/en/latest/settings-ticket.html>`_)

source: Ticket > Last contact
de: Ticket > letzter Kontakt
sr: Тикет > Последњи одговор

source: Ticket > Number
de: Ticket > Nummer
sr: Тикет > Број

source: Ticket > Organization > Domain based assignment
de: Ticket > Organisation > Domain basierte Zuordnung
sr: Тикет > Организација > Додела на основу домена

source: Ticket > Organization > Domain
de: Ticket > Organisation > Domain
sr: Тикет > Организација > Домен

source: ``domain.tld`` or empty if not set
de: ``domain.tld`` oder leer wenn nicht gesetzt
sr: ``domain.tld`` или празно ако није постављено

source: Ticket > Organization > Name
de: Ticket > Organisation > Name
sr: Тикет > Организација > Назив

source: ``Zammad GmbH`` or empty if not set
de: ``Zammad GmbH`` oder leer wenn nicht gesetzt
sr: ``Zammad GmbH`` или празно ако није постављено

source: Ticket > Organization > Note
de: Ticket > Organisation > Notiz
sr: Тикет > Организација > Напомена

source: Ticket > Organization > Shared organization
de: Ticket > Organisation > geteilte Organisation
sr: Тикет > Организација > Заједничка организација

source: Ticket > Organization > VIP
de: Ticket > Organisation > VIP
sr: Тикет > Организација > VIP

source: Ticket > Owner > Address
de: Ticket > Besitzer > Adresse
sr: Тикет > Власник > Адреса

source: Ticket > Owner > Avatar
de: Ticket > Besitzer > Avatar
sr: Тикет > Власник > Аватар

source: Ticket > Owner > Department
de: Ticket > Besitzer > Abteilung
sr: Тикет > Власник > Одељење

source: ``Support`` or empty if not set
de: ``Support`` oder leer wenn nicht gesetzt
sr: ``Support`` или празно ако није постављено

source: Ticket > Owner > Email
de: Ticket > Besitzer > Email
sr: Тикет > Власник > Имејл

source: ``agent@company.tld`` or empty if not set
de: ``agent@firma.tld`` oder leer wenn nicht gesetzt
sr: ``agent@company.tld`` или празно ако није постављено

source: Ticket > Owner > Fax
de: Ticket > Besitzer > Fax
sr: Тикет > Власник > Факс

source: Ticket > Owner > Firstname
de: Ticket > Besitzer > Vorname
sr: Тикет > Власник > Име

source: ``Max`` or empty if not set
de: ``Max`` oder leer wenn nicht gesetzt
sr: ``Max`` или празно ако није постављено

source: Ticket > Owner > Lastname
de: Ticket > Besitzer > Nachname
sr: Тикет > Власник > Презиме

source: ``Mustermann`` or empty if not set
de: ``Mustermann`` oder leer wenn nicht gesetzt
sr: ``Mustermann`` или празно ако није постављено

source: Ticket > Owner > Login
de: Ticket > Besitzer > Login
sr: Тикет > Власник > Пријава

source: Ticket > Owner > Mobile
de: Ticket > Besitzer > Mobil
sr: Тикет > Власник > Мобилни

source: Ticket > Owner > Note
de: Ticket > Besitzer > Notiz
sr: Тикет > Власник > Напомена

source: Ticket > Owner > Phone
de: Ticket > Besitzer > Telefon
sr: Тикет > Власник > Телефон

source: Ticket > Owner > VIP
de: Ticket > Besitzer > VIP
sr: Тикет > Власник > VIP

source: Ticket > Owner > Web
de: Ticket > Besitzer > Web
sr: Тикет > Власник > Веб

source: ``https://zammad.com`` or empty if not set
de: ``https://zammad.com`` oder leer wenn nicht gesetzt
sr: ``https://zammad.com`` или празно ако није постављено

source: Ticket > Pending till
de: Ticket > warten bis
sr: Тикет > На чекању до

source: ``2019-10-07 16:25:00 UTC`` or empty if not set
de: ``2019-10-07 16:25:00 UTC`` oder leer wenn nicht gesetzt
sr: ``2019-10-07 16:25:00 UTC`` или празно ако није постављено

source: Ticket > Priority > Name
de: Ticket > Priorität > Name
sr: Тикет > Приоритет > Назив

source: Ticket > State > Name
de: Ticket > Status > Name
sr: Тикет > Стање > Назив

source: Ticket > Tags
de: Ticket > Schlagworte
sr: Тикет > Ознаке

source: Currently not available, see `Issue 2769 <https://github.com/zammad/zammad/issues/2769>`_
de: Derzeit nicht verfügbar, siehe `Issue 2769 <https://github.com/zammad/zammad/issues/2769>`_
sr: Тренутно није доступно, погледајте `извештај 2769 <https://github.com/zammad/zammad/issues/2769>`_

source: Ticket > Title
de: Ticket > Titel
sr: Тикет > Наслов

source: ``My amazing Subject`` (normally subject, can be edited within Interface and thus differ)
de: ``Mein super Betreff`` (normalerweise Betreff, kann im Interface bearbeitet werden und somit abweichen)
sr: ``Мој екстра наслов`` (обично предмет поруке, може се изменити унутар корисничког интерфејса)

source: Ticket > Updated at
de: Ticket > Aktualisiert am
sr: Тикет > Освежено у

source: Ticket > Updated by > Address
de: Ticket > Aktualisiert von > Adresse
sr: Тикет > Освежено од стране > Адреса

source: Ticket > Updated by > Avatar
de: Ticket > Aktualisiert von > Avatar
sr: Тикет > Освежено од стране > Аватар

source: Ticket > Updated by > Department
de: Ticket > Aktualisiert von > Abteilung
sr: Тикет > Освежено од стране > Одељење

source: Ticket > Updated by > Email
de: Ticket > Aktualisiert von > Email
sr: Тикет > Освежено од стране > Имејл

source: Ticket > Updated by > Fax
de: Ticket > Aktualisiert von > Fax
sr: Тикет > Освежено од стране > Факс

source: Ticket > Updated by > Firstname
de: Ticket > Aktualisiert von > Vorname
sr: Тикет > Освежено од стране > Име

source: Ticket > Updated by > Lastname
de: Ticket > Aktualisiert von > Nachname
sr: Тикет > Освежено од стране > Презиме

source: Ticket > Updated by > Login
de: Ticket > Aktualisiert von > Login
sr: Тикет > Освежено од стране > Пријава

source: Ticket > Updated by > Mobile
de: Ticket > Aktualisiert von > Mobil
sr: Тикет > Освежено од стране > Мобилни

source: Ticket > Updated by > Note
de: Ticket > Aktualisiert von > Notiz
sr: Тикет > Освежено од стране > Напомена

source: Ticket > Updated by > Phone
de: Ticket > Aktualisiert von > Telefon
sr: Тикет > Освежено од стране > Телефон

source: Ticket > Updated by > VIP
de: Ticket > Aktualisiert von > VIP
sr: Тикет > Освежено од стране > VIP

source: Ticket > Updated by > Web
de: Ticket > Aktualisiert von > Web
sr: Тикет > Освежено од стране > Веб

source: Create Tickets from Zabbix
de: Tickets aus Zabbix erstellen
sr: Отварање тикета из Zabbix-а

source: Zabbix is a tool to monitor IT infrastructure.
de: Zabbix ist ein Tool zur Überwachung der IT-Infrastruktur.
sr: Zabbix је алатка за надгледање IT инфраструктуре.

source: This guide describes how to connect your Zabbix installation to Zammad using webhooks in Zabbix. It provides instructions on setting up a media type, a user and an action in Zabbix.
de: Diese Anleitung beschreibt, wie Sie Ihre Zabbix-Installation mit Zammad verbinden, indem Sie Webhooks in Zabbix verwenden. Sie enthält Anweisungen zum Einrichten eines Medientyps, eines Benutzers und einer Aktion in Zabbix.
sr: Овај водич описује како да повежете своју Zabbix инсталацију са Zammad-ом користећи Zabbix повратне позиве. Овај водич ће пружити упутства за подешавање врсте медија, корисника и радње у Zabbix-у.

source: Zabbix version 5.4 or higher.
de: Zabbix Version 5.4 oder höher.
sr: Zabbix верзија 5.4 или новија.

source: A Zammad instance which is accessible from your Zabbix system.
de: Eine Zammad-Instanz, die von Ihrem Zabbix-System aus zugänglich ist.
sr: Ваша Zammad инстанца мора бити доступна вашем Zabbix систему.

source: Steps in Zammad
de: Schritte in Zammad
sr: Кораци у Zammad-у

source: Enable API Token Access in Zammad's settings under *System > API*.
de: Aktivieren Sie den API Token-Zugang in den Einstellungen von Zammad unter *System > API*.
sr: Укључите **Приступ API путем кључа** у Zammad подешавањима под *Систем > API*.

source: Create a new user for a Zabbix alerter with an email address and create a personal user token with ``ticket.agent`` permissions. Make sure to also set the appropriate group permissions.
de: Legen Sie einen neuen Benutzer für einen Zabbix-Alarm mit einer E-Mail-Adresse an und erstellen Sie ein persönliches Benutzer-Token mit den Berechtigungen ``ticket.agent``. Stellen Sie sicher, dass Sie auch die entsprechenden Gruppenberechtigungen festlegen.
sr: Направите новог корисника за Zabbix упозорења са имејл адресом и додајте лични кључ за приступ са дозволом ``ticket.agent``. Обратите пажњу да такође подесите одговарајући приступ групама.

source: Zabbix Webhook Configuration
de: Zabbix Webhook-Konfiguration
sr: Конфигурација повратног позива за Zabbix

source: Create a Global Macro
de: Ein globales Makro erstellen
sr: Направите глобални макро

source: Before setting up the webhook, you need to setup the global macro ``{$ZABBIX.URL}``, which must contain the URL to the Zabbix frontend.
de: Bevor Sie den Webhook einrichten, müssen Sie das globale Makro ``{$ZABBIX.URL}`` einrichten, das die URL des Zabbix-Frontends enthalten muss.
sr: Пре него што подесите повратни позив, морате да подесите глобални макро ``{$ZABBIX.URL}``, који мора да садржи URL адресу на Zabbix кориснички интерфејс.

source: In the section *Administration > Media types*, import the `template`_.
de: Importieren Sie im Abschnitt *Administration > Media types* das `template`_.
sr: У одељку *Administration > Media types* увезите `template`_.

source: Open the added **Zammad** media type and set:
de: Öffnen Sie den hinzugefügten Medientyp **Zammad** und stellen Sie ein:
sr: Отворите додату врсту медија **Zammad-** и подесите:

source: ``zammad_access_token``: the personal access token you created for the user
de: ``zammad_access_token``: das persönliche Access-Token, das Sie für den Benutzer erstellt haben
sr: ``zammad_access_token``: лични приступни кључ који сте креирали за корисника

source: ``zammad_url``: the URL of your Zammad installation
de: ``zammad_url``: die URL Ihrer Zammad-Installation
sr: ``zammad_url``: URL ваше инсталације Zammad-а

source: ``zammad_customer``: the email address of the created Zammad user
de: ``zammad_customer``: die E-Mail-Adresse des erstellten Zammad Benutzers
sr: ``zammad_customer``: имејл адреса креираног Zammad корисника

source: ``zammad_enable_tags``: *true* or *false* to enable or disable tags. If you enable tags, each tag is set with a separate request.
de: ``zammad_enable_tags``: *true* oder *false*, um Tags zu aktivieren oder zu deaktivieren. Wenn Sie Tags aktivieren, wird jedes Tag mit einer separaten Anfrage gesetzt.
sr: ``zammad_enable_tags``: *true* или *false* да бисте укључили или искључили ознаке. Ако укључите ознаке, свака ознака се поставља посебним захтевом.

source: If you want to prioritize issues in Zammad according to severity values in Zabbix, you can map these parameters:
de: Wenn Sie Probleme in Zammad entsprechend den Schweregraden in Zabbix priorisieren möchten, können Sie diese Parameter zuordnen:
sr: Ако желите да дате приоритет проблемима у Zammad-у на основу вредности **severity** атрибута из Zabbix-а, дефинишите параметре мапирања:

source: ``severity_<name>``: Zammad priority ID
de: ``severity_<name>``: Zammad Prioritäts-ID
sr: ``severity_<назив>``: ID Zammad приоритета

source: Click the **Update** button to save the webhook settings.
de: Klicken Sie auf die Schaltfläche **Update**, um die Webhook-Einstellungen zu speichern.
sr: Кликните на дугме **Update** да бисте сачували подешавања повратног позива.

source: Enter any text in ``Send to``, as this value is not used but required.
de: Geben Sie einen beliebigen Text in ``Send to`` ein, da dieser Wert nicht verwendet wird, aber erforderlich ist.
sr: За ``Send to`` унесите било који текст, јер се ова вредност не користи иако је обавезна.

source: For more information, use the `Zabbix documentation <https://www.zabbix.com/documentation/current/manual/config/notifications>`_.
de: Weitere Informationen finden Sie in der `Zabbix-Dokumentation <https://www.zabbix.com/documentation/current/manual/config/notifications>`_.
sr: За више информација, погледајте `Zabbix документацију <https://www.zabbix.com/documentation/current/manual/config/notifications>`_.

source: Product Name
de: Produktname
sr: Назив производа

source: Defines the name of the application, shown in the web interface, tabs and title bar of the web browser.
de: Legt den Namen der Applikation fest, welcher im Web-Interface, in Tabs und in der Titelseite des Webbrowsers angezeigt wird.
sr: Одређује назив апликације, који се приказује у веб интерфејсу, прозорима и наслову интернет претраживача.

source: Default value: ``Zammad Helpdesk``
de: Standardwert: ``Zammad Helpdesk``
sr: Подразумевана вредност: ``Zammad Helpdesk``

source: Will be shown in the app and is included in email footers.
de: Wird in der App und in der E-Mail-Fußzeile angezeigt.
sr: Биће приказано у апликацији и убачено при дну имејл порука.

source: Defines the logo of the application, shown in the login page of Zammad.
de: Legt das Logo der Anwendung fest, das auf der Anmeldeseite von Zammad angezeigt wird.
sr: Одређује лого апликације, приказан на страници за пријаву у Zammad.

source: Ensure to hit the "Submit" button after uploading the logo. Otherwise your change will not be saved.
de: Klicken Sie nach dem Hochladen des Logos auf die Schaltfläche "Senden". Andernfalls wird Ihre Änderung nicht gespeichert.
sr: Обавезно притисните дугме „Пошаљи“ након што отпремите логотип. У супротном, ваша промена неће бити сачувана.

source: Allows to set the default language of the Zammad instance. The here defined locale mostly acts as a fallback for:
de: Ermöglicht es, die Standardsprache der Zammad-Instanz festzulegen. Die hier definierte Region dient meist als Fallback für:
sr: Омогућава постављање подразумеваног језика инстанце Zammad. Овде дефинисани језик углавном делује као резервни за:

source: User preferences (if Zammad can't detect the users locale)
de: Benutzereinstellungen (wenn Zammad die Sprache des Benutzers nicht erkennen kann)
sr: Корисничка подешавања (ако Zammad не може да открије корисникову локацију)

source: CSV output (reporting, time accounting)
de: CSV-Ausgabe (Berichte, Zeiterfassung)
sr: CSV излаз (извештавање, обрачунато време)

source: Notifications
de: Benachrichtigungen
sr: Обавештења

source: Define the timezone of your Zammad installation.
de: Legen Sie die Zeitzone für Ihre Zammad-Installation fest.
sr: Дефинишите временску зону ваше инсталације Zammad-а.

source: This does not have any effect on timings for your agents or how Zammad stores date and time values.
de: Dies hat keine Auswirkung auf die Zeiteinteilung Ihrer Agenten oder darauf, wie Zammad Datums- und Zeitwerte speichert.
sr: Ово нема никаквог утицаја на мерење учинка ваших оператера или начин на који Zammad чува вредности датума и времена.

source: Changing this value has direct consequences on the following areas:
de: Die Änderung dieses Wertes hat direkte Auswirkungen auf die folgenden Bereiche:
sr: Промена ове вредности има директне последице на следеће области:

source: :doc:`/manage/scheduler` tasks
de: :doc:`/manage/scheduler` Aufgaben
sr: послове :doc:`планера </manage/scheduler>`

source: Search indexing (and thus reporting)
de: Suchindexierung (und damit Berichte)
sr: Индексирање претраге (а самим тим и извештавање)

source: Calendar subscriptions
de: Kalender-Abonnements
sr: Претплате на календаре

source: Browser printing
de: Drucken im Browser
sr: Штампа из претраживача

source: Please note that some of above are fallbacks in case Zammad could not detect the agents timezone correctly.
de: Bitte beachten Sie, dass es sich bei einigen der obigen Optionen um Fallbacks handelt, falls Zammad die Zeitzone des Agenten nicht korrekt erkennen konnte.
sr: Имајте на уму да су неке ставке изнад резервне опције у случају да Zammad не може да прецизно открије временску зону оператера.

source: Pretty Date
de: Schönes Datum
sr: Лепши формат датума

source: This setting allows you to define how Zammad should display time stamps within the interface to all users.
de: Mit dieser Einstellung können Sie festlegen, wie Zammad Zeitstempel für alle Benutzer anzeigen soll.
sr: Ова поставка вам омогућава да одредите како Zammad треба да приказује временске ознаке унутар интерфејса за све кориснике.

source: This does not have any effect on how Zammad returns e.g. time values via variables.
de: Dies hat keinen Einfluss darauf, wie Zammad z.B. Zeitwerte über Variablen ausgibt.
sr: Ово нема никаквог утицаја на то како се Zammad враћа нпр. временске вредности путем променљивих.

source: Choose in between the following options:
de: Wählen Sie zwischen den folgenden Optionen:
sr: Изаберите између следећих опција:

source: relative
de: relativ
sr: релативно

source: This timestamp shows a relative time span until it switches to a date. Over time, it will change as follows:
de: Dieser Zeitstempel zeigt eine relative Zeitspanne an, bis er zu einem Datum wechselt. Im Laufe der Zeit ändert er sich wie folgt:
sr: Ова временска ознака приказује релативни период до достизања датума. Временом ће се мењати на следећи начин:

source: Just now
de: Gerade eben
sr: малопре

source: 5 minutes ago
de: vor 5 Minuten
sr: пре 5 минута

source: 3 days 1 hour ago
de: vor 3 Tagen 1 Stunde
sr: пре 3 дана 1 сат

source: Hovering the timestamp helps, you'll always get a clean timestamp then.
de: Wenn Sie den Mauszeiger über den Zeitstempel bewegen, erhalten Sie immer einen detaillierten Zeitstempel.
sr: Преласком курсора преко временске ознаке увек ћете добити прецизну временску ознаку.

source: absolute
de: absolut
sr: апсолутно

source: This timestamp always includes the week day. For one week after creation, the timestamp will not contain the date itself: Thursday 18:35.
de: Dieser Zeitstempel enthält immer den Wochentag. Innerhalb einer Woche nach der Erstellung enthält der Zeitstempel nicht das Datum selbst: Donnerstag 18:35.
sr: Ова временска ознака увек укључује дан у недељи. Недељу дана након додавања временска ознака неће садржати сам датум: четвртак 18:35.

source: After a week it will switch to: ``Friday 4. Mar 16:00``.
de: Nach einer Woche wechselt sie zu: ``Freitag 4. März 16:00``.
sr: После недељу дана прелази на следеће: петак 4. март 16:00.

source: timestamp
de: Zeitstempel
sr: временска ознака

source: This will cause Zammad to show a complete timestamp according to your locale defaults. For English this could be e.g. ``2022/12/03 2:40 pm`` or for German e.g. ``12.03.2022 14:40``.
de: Dies veranlasst Zammad, einen vollständigen Zeitstempel gemäß den Standardeinstellungen Ihrer Region anzuzeigen. Für Englisch ist das z.B. ``2022/12/03 2:40 pm`` oder für Deutsch ``12.03.2022 14:40``.
sr: Ово ће довести до тога да Zammad прикаже комплетну временску ознаку у складу са вашом подразумеваном локацијом. За енглески ово би значило нпр. ``2022/12/03 2:40 pm`` или за немачки нпр. ``12.03.2022 14:40``.

source: Default setting: ``relative``.
de: Standardeinstellung: ``relativ``.
sr: Подразумевана поставка: ``релативно``.

source: Security
de: Sicherheit
sr: Безбедност

source: We split each tab within security settings into its own page:
de: Wir haben jeden Tab innerhalb der Sicherheitseinstellungen in eine eigene Seite aufgeteilt:
sr: Поделили смо сваки језичак унутар безбедносних подешавања на сопствену страницу:

source: Base
de: Basis
sr: Основе

source: New User Accounts
de: Neue Benutzer-Konten
sr: Нови кориснички налози

source: Activates the `register as a new customer` function on the login page. If set to ``no`` only administrators or agents can create new accounts manually.
de: Aktiviert die Funktion "Als neuer Kunde registrieren" auf der Login-Seite. Wenn diese Funktion auf ``Nein`` gesetzt ist, können nur Administratoren oder Agenten neue Konten manuell erstellen.
sr: Активира функцију `Региструј се као нови клијент` на страници за пријаву. Ако је подешено на ``не`` само администратори или оператер могу ручно да додају нове налоге.

source: Default setting: ``yes``
de: Standardeinstellung: ``Ja``
sr: Подразумевано подешавање: ``да``

source: Figure showing activated "New User Accounts" setting
de: Abbildung zeigt die aktivierte Einstellung "Neue Benutzerkonten"
sr: Слика која приказује укључено подешавање „Нови кориснички налози“

source: Deactivation of above function **does not** deactivate automatic account creation! This means: If a user writes e.g. an email to Zammad and has no account yet, Zammad will automatically create the account. User accounts are a direct dependency of tickets and thus technically mandatory.
de: Die Deaktivierung der obigen Funktion **deaktiviert nicht** die automatische Kontoerstellung! Dies bedeutet: Wenn ein Benutzer z.B. eine E-Mail an Zammad schreibt und noch kein Konto hat, wird Zammad das Konto automatisch erstellen. Benutzerkonten sind eine direkte Abhängigkeit von Tickets und somit technisch zwingend erforderlich.
sr: Искључивање горње функције **не** деактивира аутоматско додавање налога! То значи: ако корисник нпр. пошаље имејл поруку Zammad-у и још увек нема налог, Zammad ће аутоматски додати нови налог.

source: Lost Password
de: Passwort verloren
sr: Изгубљена лозинка

source: Activates the `lost password` function on the login page. If set to ``no`` only administrators may change the user's password - users may update their own password if they're still logged in and they have the required :doc:`permission </manage/roles/user-preferences-permissions>`.
de: Aktiviert die Funktion `Kennwort vergessen` auf der Login-Seite. Wenn auf ``nein`` gesetzt, können nur Administratoren das Passwort des Benutzers ändern - Benutzer können ihr eigenes Passwort aktualisieren, wenn sie noch eingeloggt sind und die erforderliche :doc:`Berechtigung </manage/roles/user-preferences-permissions>` haben.
sr: Активира функцију `Изгубљена лозинка` на страници за пријаву. Ако је подешено на ``не`` само администратори могу да промене корисничку лозинку - корисници могу да промене сопствену лозинку ако су још увек пријављени и имају потребну :doc:`дозволу </manage/roles/user-preferences-permissions>`.

source: Figure showing activated "Lost Password" setting
de: Abbildung zeigt die aktivierte Einstellung "Passwort verloren"
sr: Слика која приказује укључено подешавање „Изгубљена лозинка“

source: With third party authentications - but especially LDAP - you may want to disable this function. Zammad **will not** change third party login passwords and instead set or change the local password!
de: Bei einer Authentifizierung durch einen Drittanbieter - vor allem aber bei LDAP - sollten Sie diese Funktion deaktivieren. Zammad **ändert keine** Login-Passwörter von Drittanbietern und setzt oder ändert stattdessen das lokale Passwort!
sr: Уз аутентификацију преко трећег лица – али посебно LDAP – можда ћете пожелети да искључите ову функцију. Zammad **неће** променити лозинке за пријављивање преко трећих лица и уместо тога ће поставити или променити локалну лозинку!

source: Password Login
de: Passwort-Anmeldung
sr: Пријављивање путем лозинке
