Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: Switch between *Low priority* (light blue), *High priority* (red) and - (default). This affects the displayed color for ticket titles in overviews.
de: Umschalten zwischen *Niedrige Priorität* (hellblau), *Hohe Priorität* (rot) und - (Standard). Dies wirkt sich auf die angezeigte Farbe für Ticket-Titel in Übersichten aus.
sr: Изаберите између *Низак приоритет* (светло плава), *Висок приоритет* (црвена) и - (подразумевано). Ово утиче на боју приказа наслова тикета у прегледима.

source: The color options are currently limited to the mentioned options.
de: Die Farboptionen sind derzeit auf die genannten Optionen beschränkt.
sr: Доступне боје су тренутно ограничене на поменуте опције.

source: You can create a note for the priority to inform other admins about the priority. This has no effect on tickets.
de: Sie können eine Notiz für die Priorität erstellen, um andere Administratoren über die Priorität zu informieren. Dies hat keine Auswirkungen auf Tickets.
sr: Можете додати напомену за приоритет да бисте обавестили друге администраторе о овом приоритету. Ово нема ефекта на тикете.

source: Set the priority to *active* or *inactive*.
de: Setzen Sie die Priorität auf *aktiv* oder *inaktiv*.
sr: Поставите приоритет на *укључено* или *искључено*.

source: External Data Source
de: Externe Datenquelle
sr: Удаљени извор података

source: We assume you already had a look on :doc:`types` where you can find a description of the individual fields.
de: Wir gehen davon aus, dass Sie bereits einen Blick auf :doc:`types` geworfen haben, wo Sie eine Beschreibung der einzelnen Felder finden können.
sr: Претпостављамо да сте већ погледали :doc:`типове <types>` где можете пронаћи опис појединачних поља.

source: To reproduce this example, choose a category you want to add a custom field, click on *New Attribute* and select *External data source field* under *Format*.
de: Um dieses Beispiel zu reproduzieren, wählen Sie eine Kategorie, der Sie ein benutzerdefiniertes Feld hinzufügen möchten, klicken Sie auf *Neues Attribut* und wählen Sie *Externe Daten-Feld* unter *Format*.
sr: Да бисте репродуковали овај пример, одаберите категорију коју желите да додате прилагођеном пољу, клините на *Нови атрибут* и изаберите *Поље удаљеног извора података* за *Формат*.

source: Our example story is to fetch data from an external product database. We want to add our products to the tickets so that the products can be searched and chosen from a list and also create a link to the product website.
de: In unserem Beispiel geht es darum, Daten aus einer externen Produktdatenbank abzurufen. Wir möchten unsere Produkte zu den Tickets hinzufügen, damit die Produkte gesucht und aus einer Liste ausgewählt werden können, und außerdem einen Link zur Produktwebsite erstellen.
sr: Наш пример преузима податке из удаљене базе података са производима. Желимо да додамо наше производе тикетима тако да је могуће претражити производе и изабрати их са листе и приказати линк на страну производа.

source: Base configuration
de: Basis-Konfiguration
sr: Основна подешавања

source: Initial steps to configure external data source object type
de: Erste Schritte zur Konfiguration des Objekttyps der externen Datenquelle
sr: Први кораци за подешавање удаљеног извора података

source: External data source configuration
de: Konfiguration der externen Datenquelle
sr: Подешавање удаљеног извора података

source: First, enter the search URL making sure it contains ``#{search.term}`` as a parameter:
de: Geben Sie zunächst die Such-URL ein und vergewissern Sie sich, dass sie ``#{search.term}`` als Parameter enthält:
sr: Прво, унесите URL адресу претраге и уверите се да садржи ``#{search.term}`` као параметар:

source: **Example:** ``https://dummyjson.com/products/search?q=#{search.term}``
de: **Beispiel:** ``https://dummyjson.com/products/search?q=#{search.term}``
sr: **Пример:** ``https://dummyjson.com/products/search?q=#{search.term}``

source: After that, head down to the preview section and enter a search input for the external data source.
de: Danach gehen Sie in den Vorschaubereich und geben einen Suchbegriff für die externe Datenquelle ein.
sr: Након тога, скролујте на доле до одељка приказа и унесите кључну реч за претрагу удаљеног извора података.

source: **Example:** ``mac``
de: **Beispiel:** ``mac``
sr: **Пример:** ``mac``

source: Then you can find a preview of the response data below:
de: Anschließend finden Sie eine Vorschau der Antwortdaten:
sr: Након тога можете видети следећи приказ одговора испод:

source: Preview of JSON response based on search term
de: Vorschau der JSON-Antwort basierend auf dem Suchbegriff
sr: Приказ JSON одговора на основу уноса претраге

source: We recommend using the preview to have a look on the structure. There is a top-level element called ``products``. One level below, you can find the attributes ``id`` and ``title``.
de: Wir empfehlen, die Vorschau zu benutzen, um einen Blick auf die Struktur zu werfen. Es gibt ein Top-Level-Element namens ``products``. Eine Ebene darunter finden Sie die Attribute ``id`` und ``title``.
sr: Препоручујемо да користите приказ за преглед структуре података. Постоји кључ на основном нивоу под називом ``products``. Један ниво испод, можете наћи атрибуте ``id`` и ``title``.

source: **Search result response based on search from example:**
de: **Suchergebnis-Antwort basierend auf der Suche aus dem Beispiel:**
sr: **Одговор резултата претраге на основу унетих кључних речи из примера:**

source: To tell the remote system that the desired data is located below the ``products`` level, you have to put it in the field *Search result list key*.
de: Um dem entfernten System mitzuteilen, dass sich die gewünschten Daten unterhalb der Ebene ``products`` befinden, müssen Sie dies in das Feld *Search result list key* eintragen.
sr: Да бисте рекли удаљеном систему да се подаци налазе испод нивоа ``products``, неопходно га је унети у поље *Кључ листе резулата претраге*.

source: After inserting ``products`` in the mentioned field, you get an extended preview. You can find an additional box *Search result list* with a JSON structure. This is the same response as before but stripped from the upper ``products`` element by the external data source.
de: Nach dem Einfügen von ``products`` in das genannte Feld, erhalten Sie eine erweiterte Vorschau. Sie können ein zusätzliches Feld *Search result list* mit einer JSON-Struktur finden. Dies ist die gleiche Antwort wie zuvor, aber das obere Element ``products`` wurde von der externen Datenquelle entfernt.
sr: По уносу ``products`` у одговарајуће поље, добићете освежен приказ. Можете наћи додатан оквир *Листа резултата претрага* са JSON структуром. Ово је део истог одговора удаљеног извора података као изнад али без спољног ``products``кључа.

source: Preview of JSON response search result list
de: Vorschau der Suchergebnisliste der JSON-Antwort
sr: Приказ JSON одговора листе резултата претраге

source: Now you need to provide the keys for the search result values and labels. As already mentioned, we are looking for the ``id`` and the ``title`` of our products. If you haven't already, it is now a good time to look at the preview of the *Search result list*.
de: Nun müssen Sie die Schlüssel für die Werte und Bezeichnungen der Suchergebnisse angeben. Wie bereits erwähnt, suchen wir nach der ``id`` und dem ``title`` unserer Produkte. Wenn Sie es noch nicht getan haben, ist es jetzt ein guter Zeitpunkt, sich die Vorschau der *Suchergebnisliste* anzusehen.
sr: Сада је неопходно да обезбедите кључеве за вредности и ознаке резултата претраге. Као што је напоменуто, тражимо ``id`` и ``title`` наших производа. Ако већ нисте, сада је добар тренутак да погледате приказ *Листе резултата претраге*.

source: After locating our two keys, we insert them in *search result value key* (``id``) and in *Search result label key* (``title``).
de: Nachdem wir unsere beiden Schlüssel gefunden haben, fügen wir sie in *Schlüssel Suchergebniswert* (``id``) und in den *Schlüssel Suchergebnisbezeichnung* (``title``) ein.
sr: Након лоцирања наша два кључа, унећемо их у *Кључ вредности резулата претраге* (``id``) и у *Кључ ознаке резулата претраге* (``title``).

source: Basically, we configured the external data source already and we can see a table in the preview section:
de: Im Grunde haben wir die externe Datenquelle bereits konfiguriert, und wir können eine Tabelle im Vorschaubereich sehen:
sr: У принципу већ смо подесили удаљни извор података и сада можемо видети табелу у одељку приказа:

source: Preview of product table based on search term
de: Vorschau der Produkttabelle auf Basis des Suchbegriffs
sr: Приказ табеле производа на основу унетих кључних речи претраге

source: According to our example story, now just the *Link template* is missing.
de: Gemäß unserem Beispiel fehlt jetzt nur noch das *Link-Template*.
sr: Даље пратећи наш пример, једино недостсаје још *Шаблон везе*.

source: Please note that this is an optional feature. If you don't want to use such links, of course you don't have to configure it.
de: Bitte beachten Sie, dass dies eine optionale Funktion ist. Wenn Sie solche Links nicht verwenden möchten, müssen Sie sie natürlich auch nicht konfigurieren.
sr: Напомињемо да је ово опциона функција. Ако не желите да користите овакве линкове, наравно не морате да их подесите.

source: We can add now an address where additional product information can be found.
de: Wir können nun eine Adresse hinzufügen, unter der zusätzliche Produktinformationen zu finden sind.
sr: Сада можемо додати адресу где се додатне информације о производу могу пронаћи.

source: Example: ``https://your_domain.com/q=#{ticket.product}``
de: Beispiel: ``https://ihre_domain.com/q=#{ticket.product}``
sr: Пример: ``https://your_domain.com/q=#{ticket.product}``

source: In the example, the parameter means:
de: In diesem Beispiel bedeutet der Parameter:
sr: У примеру, параметар има следеће значење:

source: ``#{}``: "Frame" for the insertion of information
de: ``#{}``: "Rahmen" für das Einfügen von Informationen
sr: ``#{}``: Поље за убацивање података

source: ``ticket``: object level, where you create your custom object
de: ``ticket``: Objektebene, auf der Sie Ihr benutzerdefiniertes Objekt erstellen
sr: ``ticket``: ниво објекта, где додајете свој прилагођени атрибут

source: ``product``: name of the (custom) object
de: ``product``: Name des (benutzerdefinierten) Objekts
sr: ``product``: назив (прилагођеног) атрибута

source: After configuring your *Link template*, there will be another column in the preview. Hovering on the icons in the *Link* column will show you where it forwards you.
de: Nachdem Sie Ihr *Link-Template* konfiguriert haben, wird in der Vorschau eine weitere Spalte angezeigt. Wenn Sie mit der Maus über die Symbole in der Spalte *Link* fahren, sehen Sie, wohin der Link verweist.
sr: По подешавању *Шаблона везе*, биће приказана још једна колона у приказу. Преласком курсора преко иконице у колони *Повежи* биће приказана адреса преусмерења.

source: In our example, one of the links looks like: https://your_domain.com/q=6, where the 6 is the product id.
de: In unserem Beispiel sieht einer der Links so aus: https://ihre_domain.com/q=6, wobei die 6 die Produkt-ID ist.
sr: У нашем примеру, један од линкова личи на: https://your_domain.com/q=6, где је 6 ID вредност производа.

source: You can find more information regarding the URL in :doc:`types`.
de: Weitere Informationen zur URL finden Sie in :doc:`types`.
sr: Mожете пронаћи више информација о URL адресама у :doc:`types`.

source: Adding values can be tricky for first timers, don't forget to press "➕ Add" after typing your values. Otherwise you may loose a value.
de: Das Hinzufügen von Werten kann für Neulinge schwierig sein. Vergessen Sie nicht, nach der Eingabe Ihrer Werte auf "➕ Hinzufügen" zu drücken. Andernfalls wird der zuletzt hinzugefügte Wert nicht gespeichert.
sr: Додавање вредности може бити незгодно за почетнике, не заборавите да притиснете „➕ Додај“ након што унесете вредности. У супротном можете изгубити унос.

source: **↕️ This field type allows the positioning of its values ↔️**
de: **↕️ Dieser Feldtyp erlaubt die Positionierung der Werte ↔️**
sr: **↕️ Овај тип поља омогућава промену редоследа својих вредности ↔️**

source: In order to re-arrange the field values, first edit the field. Then you can use ☰ to drag the values in question to the correct position. If you want to change the layer depth, double click on ☰. With it you can cycle through the available layers.
de: Um die Feldwerte neu anzuordnen, bearbeiten Sie zunächst das Feld. Dann können Sie mit ☰ die betreffenden Werte an die richtige Stelle ziehen. Wenn Sie die Ebenentiefe ändern möchten, doppelklicken Sie auf ☰. Damit können Sie durch die verfügbaren Ebenen wechseln.
sr: Да бисте изменили опције поља, прво уредите поље. Након тога можете користити ☰ да бисте превукли вредност у питању на одговарајућу позицију. Уколико желите да измените дубину слоја, кликните двапут на ☰. Овом радњом можете и да циклично мењате дубину слоја.

source: In order to re-arrange the field values, edit the field and scroll below the values. Make sure to tick the option "Use custom option sort".
de: Um die Feldwerte neu anzuordnen, bearbeiten Sie das Feld und scrollen Sie unter die Tabelle. Vergewissern Sie sich, dass Sie die Option "Verwende benutzerdefinierte Sortierung" aktiviert haben.
sr: Да бисте изменили редослед опција поља, уредите поље и скролујте на доле до вредности. Обратите пажњу да укључите опцију „Користи прилагођен редослед опција”.

source: If you do not tick this field, all manual positioning you did above will be lost upon saving! ☠️
de: Wenn Sie das nicht aktiviert haben, gehen alle manuell festgelegten Positionen beim Speichern verloren! ☠️
sr: Уколико не укључите ово поље, сав ручно одређен редослед који сте обавили изнад ће бити изгубљен по снимању! ☠️

source: Now use ☰ to drag the values in question to the correct position. When you're ready, submit your changes to save the object attribute.
de: Ziehen Sie nun mit ☰ die Einträge an die richtige Position. Wenn Sie fertig sind, übernehmen Sie Ihre Änderungen, um das Objektattribut zu speichern.
sr: Користите ☰ да превучете и испустите дотичне вредности на нову жељену позицију. Када будете спремни, снимите ваше измене да бисте сачували атрибут објекта.

source: Screencast showing how to re-position values
de: Screencast, der zeigt, wie man Einträge neu positioniert
sr: Снимак екрана који приказује како да промените редослед вредности

source: This field allows using :ref:`URL fields (Link Templates) <link-templates>`.
de: Dieses Feld ermöglicht die Verwendung von :ref:`URL-Feldern (Link-Vorlagen) <link-templates>`.
sr: Ово поље омогућава коришћење :ref:`URL адреса (шаблон везе) <link-templates>`.

source: Attribute Permissions
de: Berechtigungen für Attribute
sr: Дозволе атрибута

source: In the object attributes configuration you can define if a field is shown and if the input in the field is mandatory, separated by different screens and for different :doc:`roles/permissions </manage/roles/index>`.
de: In der Konfiguration der Objektattribute können Sie festlegen, ob ein Feld angezeigt wird und ob die Eingabe in das Feld verpflichtend ist, und zwar separat für verschiedene Ansichten und für verschiedene :doc:`Rollen/Berechtigungen </manage/roles/index>`.
sr: У конфигурацији атрибута објекта можете одредити да ли поље приказано и да ли је унос поља обавезан, за различите екране и :doc:`корисничке улоге/дозволе </manage/roles/index>`.

source: Screenshot shows object attribute permission table
de: Screenshot zeigt Objektattribut-Berechtigungstabelle
sr: Снимак екрана приказује табелу дозвола за атрибут објекта

source: Some of the possible permissions and screen options for a user object attribute.
de: Einige der möglichen Berechtigungen und Ansichten für ein Attribut eines Benutzerobjekts.
sr: Неке од могућих дозвола и опција екрана за атрибуте објекта корисника.

source: Based on the object context (ticket, agent, organization, user), the selectable roles (to be precise: the required permissions) and screens differ. Be aware that these settings aren't affecting data creation via other channels than the UI.
de: Je nach Objektkontext (Ticket, Agent, Organisation, Benutzer) unterscheiden sich die auswählbaren Rollen (genauer gesagt: die erforderlichen Berechtigungen) und Ansichten. Beachten Sie, dass diese Einstellungen keinen Einfluss auf die Datenerstellung über andere Kanäle als die Benutzeroberfläche haben.
sr: На основу контекста објекта (тикет, група, организација, корисник), омогућене улоге (прецизније: захтеване дозволе) и екрани се разликују. Обратите пажњу да ова подешавања не управљају додавањем садржаја преко других канала, ван корисничког интерфејса.

source: If you want to have further customization possibilities, you should have a look at the :doc:`core workflows </system/core-workflows>`.
de: Wenn Sie weitere Anpassungsmöglichkeiten brauchen, sollten Sie einen Blick in die :doc:`Core Workflows </system/core-workflows>` werfen.
sr: Уколико желите додатне могућности прилагођавања, погледајте документацију :doc:`радних токова </system/core-workflows>`.

source: Screens
de: Ansichten
sr: Екрани

source: In the table below you can find an overview about the different permissions and the available screens Zammad distinguishes between.
de: In der folgenden Tabelle finden Sie eine Übersicht über die verschiedenen Berechtigungen und die verfügbaren Ansichten, die Zammad unterscheidet.
sr: У табели испод можете наћи преглед различитих дозвола и досступних екрана које Zammad подржава.

source: Screen
de: Ansicht
sr: Екран

source: Available for
de: Verfügbar für
sr: Доступно за

source: Creation dialog for not yet existing data
de: Erstellungsdialog für noch nicht vorhandene Daten
sr: Дијалог за додавање новог садржаја

source: Ticket create dialog (middle section)
de: Ticket-Erstellungsdialog (mittlerer Bereich)
sr: Дијалог отварања тикета (средњи део)

source: Editing dialog for already existing data
de: Bearbeitungsdialog für bereits vorhandene Daten
sr: Дијалог за уређивање постојећег садржаја

source: view
de: Ansicht

source: View-only dialog for already existing data
de: Lese-Ansicht für bereits vorhandene Daten
sr: Дијалог за приказ постојећег садржаја без измена

source: (e.g. user or organization from search)
de: (z.B. Benutzer oder Organisation über die Suche)
sr: (нпр. корисник или организација кроз претрагу)

source: Sign-up screen for new customers
de: Anmelde-Ansicht für neue Kunden
sr: Екран отварања налога за нове клијенте

source: Customer invitation screen (from :doc:`First Steps </misc/first-steps>` area)
de: Ansicht zur Einladung von Kunden (aus dem Bereich :doc:`Erste Schritte </misc/first-steps>`)
sr: Екран за слање позивнице клијенту (из одељка :doc:`првих корака </misc/first-steps>`)

source: Agent invitation screen (from :doc:`First Steps </misc/first-steps>` area)
de: Ansicht für die Einladung von Agenten (aus dem Bereich :doc:`Erste Schritte </misc/first-steps>`)
sr: Екран за слање позивнице оператеру (из одељка :doc:`првих корака </misc/first-steps>`)

source: Screen Options
de: Ansicht Optionen
sr: Опције екрана

source: For the different screens you can select "show" and "required" options.
de: Für die verschiedenen Ansichten können Sie die Optionen "anzeigen" und "erforderlich" auswählen.
sr: За различите екране можете одбрати опције „shown” и „required”.

source: **shown:** Show (check) or hide (uncheck) a field.
de: **Anzeigen:** Ein Feld anzeigen (Haken gesetzt) oder ausblenden (Haken nicht gesetzt).
sr: **shown:** Прикажи (означено) или сакриј (одзначено) поље.

source: **required:** Set a field to mandatory (check). Forces users (via UI and API) to populate the field.
de: **Erforderlich:** Setzen Sie ein Feld auf erforderlich (Haken gesetzt), um eine Eingabe (über UI und API) zu erzwingen.
sr: **required:** Постављање поља на обавезно (означено). Очекује од корисника да попуне поље (путем корисничког интерфејса и API).

source: Example external data source
de: Beispiel externe Datenquelle
sr: Пример удаљеног извора података

source: Attribute types
de: Attribut-Typen
sr: Типови атрибута

source: When adding a new object attribute, you can choose between the following attribute types.
de: Wenn Sie ein neues Objektattribut hinzufügen, können Sie zwischen den folgenden Attributtypen wählen.
sr: Када додајете нови атрибут објекта, можете изабрати између следећих типова атрибута.

source: You cannot change the attribute format / type as soon as it is applied. If you no longer need an object attribute, consider disabling it instead of removing.
de: Sie können das Format und den Typ des Attributs nicht mehr ändern, sobald es gespeichert wurde. Wenn Sie ein Objektattribut nicht mehr benötigen, sollten Sie es deaktivieren, anstatt es zu entfernen.
sr: Не можете променити тип / формат атрибута након додавања. Уколико вам више не треба атрибут, узмите у обзир да га искључите уместо да га обришете.

source: **What about the translation of my attributes?**
de: **Was ist mit der Übersetzung meiner Attribute?**
sr: **А шта да радим за превод мојих атрибута?**

source: For some attribute types you can decide if they should be translatable or not. To be precise, it works only for the selectable fields because the possible choices are known and limited. For the following attribute types, you can set the translatable flag:
de: Für manche Attribut-Typen können Sie definieren, ob diese übersetzbar sein sollen oder nicht. Genauer gesagt funktioniert das für auswählbare Typen weil die möglichen Auswahlmöglichkeiten bekannt und begrenzt sind. Für die folgenden Attribut-Typen können Sie die Übersetzbarkeit festlegen:
sr: За неке типове атрибута можете одлучити да ли се могу превести или не. Мало прецизније, функционише само за поља избора зато што су могуће опције познате и ограничене. За следеће типове атрибута можете поставити подешавање превода:

source: *Boolean field*
de: *Boolean-Feld*
sr: *Логичко поље*

source: *Single selection field*
de: *Einfachauswahl-Feld*
sr: *Поље за једноструки избор*

source: *Multiple selection field*
de: *Mehrfachauswahl-Feld*
sr: *Поље за вишеструки избор*

source: *Single tree selection field*
de: *Einfach-Baumauswahl-Feld*
sr: *Поље за једноструки избор стабла*

source: *Multiple tree selection field*
de: *Mehrfach-Baumauswahl-Feld*
sr: *Поље за вишеструки избор стабла*

source: For these types, you can find an additional field *Translate field contents*:
de: Für diese Typen gibt es ein zusätzliches Feld *Feldinhalte übersetzen*:
sr: За ове типове пронаћи ћете додатну опцију *Преведи садржај поља*:

source: Screenshot showing translatable attribute types
de: Screenshot mit übersetzbaren Attributtypen
sr: Снимак екрана који приказује типове атрибута који се могу превести

source: Screenshot with example of translatable attribute type
de: Screenshot mit Beispiel eines übersetzbaren Attributtyps
sr: Снимак екрана са примером типа атрибута који се може превести

source: Boolean field
de: Boolean-Feld
sr: Логичко поље

source: Provides a drop-down field with display values for ``true`` and ``false``. Setting a default is mandatory.
de: Bietet ein Dropdown-Feld mit Anzeigewerten für ``true`` und ``false``. Das Festlegen eines Standardwerts ist erforderlich.
sr: Приказује поље за избор са вредностима за ``true``и ``false``. Постављање подразумеване вредности је обавезно.

source: Available settings for Boolean fields
de: Verfügbare Einstellungen für boolesche Felder
sr: Доступна подешавања за логичка поља

source: Date field
de: Datumsfeld
sr: Поље датума
