Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: This document describes how to **configure** the knowledge base. For details on how to **use and edit** it, please refer to the :user-docs:`Zammad User Documentation </extras/knowledge-base.html>`.
de: Dieses Dokument beschreibt, wie man die Knowledge Base **konfiguriert**. Einzelheiten zur **Nutzung und Bearbeitung** finden Sie in der :user-docs:`Zammad Benutzer Dokumentation </extras/knowledge-base.html>`.
sr: Ова документација објашњава како **подесити** базу знања. За детаље о томе како да је **користите и уређујете**, погледајте :user-docs:`Zammad корисничку документацију </extras/knowledge-base.html>`.

source: Sample Knowledge Base Index
de: Beispiel Knowledge Base Index
sr: Пример индекса базе знања

source: See a live demo at https://support.zammad.com/help.
de: Eine Live-Demonstration finden Sie unter https://support.zammad.com/help.
sr: Погледајте уживо на https://support.zammad.com/help.

source: By default, only admin users are permitted to create, edit, and manage knowledge base articles. See :doc:`roles/index` for details on how to grant write access to agents or other users.
de: Standardmäßig ist es nur Administratoren gestattet, Knowledge Base-Artikel zu erstellen, zu bearbeiten und zu verwalten. Weitere Informationen, wie Sie Agenten oder anderen Benutzern Schreibzugriff gewähren, finden Sie unter :doc:`roles/index`.
sr: Подразумевано, само администраторима је дозвољено да додају, уређују и управљају чланцима базе знања. Погледајте :doc:`roles/index` за детаље о томе како да оператерима или другим корисницима одобрите приступ.

source: The knowledge base will not appear in the main menu until it has been enabled in the admin panel.
de: Die Knowledge Base erscheint nicht im Hauptmenü, bis diese in den Admin-Einstellungen aktiviert wurde.
sr: База знања се неће појавити у главном менију док не буде омогућена у административном панелу.

source: 🌍 Multi-language support
de: 🌍 Unterstützung mehrerer Sprachen
sr: 🌍 Вишејезична подршка

source: 🙈 Visibility settings (**draft**, **staff-only**, or **public**)
de: 🙈 Sichtbarkeitseinstellungen (**Entwurf**, **Nur für Mitarbeiter** oder **Öffentlich**)
sr: 🙈 Подешавања видљивости (**нацрт**, **интерно** или **јавно**)

source: 🔍 Full text search
de: 🔍 Volltextsuche
sr: 🔍 Текстуална претрага

source: 📅 Scheduled publishing
de: 📅 Geplante Veröffentlichung
sr: 📅 Планирано објављивање

source: 📎 File attachments
de: 📎 Dateianhänge
sr: 📎 Прилози датотека

source: 🔗 Wiki-style internal linking to both 💡 **KB answers** and 📋 **tickets**
de: 🔗 Interne Verlinkung im Wiki-Stil zu 💡 **KB-Antworten** und 📋 **Tickets**
sr: 🔗 Интерна веза у Wiki стилу за 💡 **чланке базе знања** и 📋 **тикете**

source: 🖼️ Rich text editor + embedded images
de: 🖼️ Rich-Text-Editor + eingebettete Bilder
sr: 🖼 Уредник обогаћеног текста + приказ сличица

source: To enable the knowledge base, first select the languages/locales you wish to publish in and click on the **Create Knowledge Base** button.
de: Um die Knowledge Base zu aktivieren, wählen Sie zunächst die Sprachen aus, in denen Sie veröffentlichen möchten, und klicken Sie auf die Schaltfläche **Knowledge Base erstellen**.
sr: Да бисте укључили базу знања, прво изаберите језике на којима желите да је објавите и кликните на дугме **Додај базу знања**.

source: Knowledge Base: Initial setup
de: Knowledge Base: Ersteinrichtung
sr: База знања: почетно подешавање

source: You must choose at least one. (Don't worry, you can always change them later!)
de: Sie müssen mindestens eine auswählen. (Keine Sorge, Sie können sie später jederzeit ändern!)
sr: Морате изабрати најмање један. (Не брините, увек их можете променити касније!)

source: Read on for details about each section of the knowledge base configuration.
de: Lesen Sie weiter, um Einzelheiten der Knowledge Base-Konfiguration zu erfahren.
sr: Читајте даље за детаље о сваком одељку подешавања базе знања.

source: Theme
de: Design
sr: Тема

source: Knowledge Base: Configure theme
de: Knowledge Base: Thema konfigurieren
sr: База знања: подешавање теме

source: Customize the appearance of the knowledge base.
de: Passen Sie das Erscheinungsbild der Knowledge Base an.
sr: Прилагодите изглед базе знања.

source: Icon & Link Color
de: Icon & Link-Farbe
sr: Боја иконице и линка

source: Applies to all **category & article** entries in knowledge base menus, as well as hyperlinks in articles.
de: Gilt für alle **Kategorie- und Artikeleinträge** in Knowledge Base-Menüs sowie für Hyperlinks in Artikeln.
sr: Важи за све уносе **категорија и чланака** у менијима базе знања, као и линкове у чланцима.

source: Header Color
de: Farbe der Kopfzeile
sr: Боја заглавља

source: Applies to the area surrounding the search bar.
de: Betrifft den Bereich um die Suchleiste.
sr: Односи се на област око траке за претрагу.

source: Header Link Color
de: Linkfarbe Kopfzeile
sr: Боја линка у заглављу

source: Defines the color of the header links to use. Make sure that this color has a proper contrast to *Header Color*.
de: Definiert die Farbe der zu verwendenden Header-Links. Stellen Sie sicher, dass diese Farbe einen ausreichenden Kontrast zur *Header-Farbe* hat.
sr: Одређује боју која ће се користити за линкове заглавља. Уверите се да ова боја има одговарајући контраст са *бојом заглавља*.

source: Show Feed Icon
de: Feed-Icon anzeigen
sr: Прикажи иконицу извора

source: You can enable Zammad to provide RSS feed URLs in both internal and public knowledge base. With this option being active, Zammad will provide you up to two RSS links:
de: Sie können RSS-Feed-URLs sowohl in der internen als auch in der öffentlichen Knowledge Base verwenden. Wenn diese Option aktiv ist, stellt Ihnen Zammad bis zu zwei RSS-Links zur Verfügung:
sr: Можете укључити за пружање URL путања до RSS извора у интерној и јавној бази знања. Када је ова опција активна, Zammad ће вам обезбедити до две RSS везе:

source: a general RSS feed of the whole knowledge base (top level)
de: ein allgemeiner RSS-Feed der gesamten Knowledge Base (oberste Ebene)
sr: општи RSS извор целокупне базе знања (највиши ниво)

source: a category specific RSS feed of the category you're in (also applies to answers you're viewing)
de: ein spezifischer RSS-Feed der Kategorie, in der Sie sich befinden (gilt auch für Antworten, die Sie gerade ansehen)
sr: RSS извор категорије у којој се налазите (односи се и на чланке које гледате)

source: This setting by default is set to ``no``.
de: Diese Einstellung ist standardmäßig auf ``nein`` gesetzt.
sr: Ово подешавање је подразумевано постављено на ``не``.

source: Your agents will receive special RSS feed URLs with **access tokens**. Agents can always renew these. Keep in mind that sharing these URLs with third parties may provide access to **internal** answers!
de: Ihre Agenten erhalten spezielle RSS-Feed-URLs mit **Zugriffs-Tokens**. Agenten können diese jederzeit erneuern. Beachten Sie, dass die Weitergabe dieser URLs an Dritte möglicherweise Zugriff auf **interne** Antworten ermöglicht!
sr: Ваши оператери ће добити посебне URL путање RSS извора са **токенима за приступ**. Оператери их увек могу обновити. Имајте на уму да дељење ових путања са трећим лицима може да омогући приступ **интерним** чланцима!

source: Defines the selection of icons that may be used when creating/editing categories.
de: Definiert die Auswahl der Symbole, die beim Erstellen/Bearbeiten von Kategorien verwendet werden können.
sr: Одређује избор иконица које се могу користити приликом додавања/уређивања категорија.

source: Each category in the knowledge base *must* be given an icon. Icons appear prominently in the main menu, like so:
de: Jede Kategorie in der Wissensdatenbank *muss* mit einem Symbol versehen sein. Symbole erscheinen deutlich sichtbar im Hauptmenü, z.B.:
sr: Свака категорија у бази знања *мора* добити иконицу. Иконице се појављују уочљиво у главном менију, на следећи начин:

source: Re-assigning icons on all of your categories is tedious work. It's advisable to explore your options early to avoid having to change your mind down the road.
de: Das Neuzuweisen von Symbolen für alle Ihre Kategorien ist mühsam. Es ist ratsam, Ihre Optionen frühzeitig zu prüfen, um zu vermeiden, dass Sie diese später mühsam aufwendig bearbeiten müssen.
sr: Поновно додељивање иконица свим вашим категоријама је досадан посао. Препоручљиво је да рано истражите све могућности како бисте избегли да се предомислите касније.

source: Languages
de: Sprachen
sr: Језици

source: Knowledge Base: Configure languages
de: Knowledge Base: Sprachen konfigurieren
sr: База знања: подешавање језика

source: Add or remove locales, or reassign the default.
de: Sprachen hinzufügen oder entfernen oder die Standardeinstellung neu setzen.
sr: Додајте или уклоните језике или поново доделите подразумеване.

source: The knowledge base will automatically display the language matching each visitor's locale. Visitors may always manually switch to another language via language selection menu in the header.
de: Die Knowledge Base zeigt automatisch die Sprache an, die zum Gebietsschema des Besuchers passt. Besucher können über das Sprachauswahlmenü im Header jederzeit manuell zu einer anderen Sprache wechseln.
sr: База знања ће аутоматски приказати језик који одговара локацији сваког посетиоца. Посетиоци увек могу ручно да пређу на други језик преко падајућег менија у заглављу.

source: The default locale is displayed when the visitor's locale is not supported.
de: Die Standard Sprache wird verwendet, wenn die des Besuchers nicht unterstützt wird.
sr: Подразумеван језик се приказује када локација посетиоца није подржана.

source: Articles which are not yet translated into a given language will be hidden when the language is selected by the reader.
de: Artikel, die noch nicht in eine bestimmte Sprache übersetzt sind, werden ausgeblendet, wenn die Sprache vom Leser ausgewählt wird.
sr: Чланци који још нису преведени на дати језик биће сакривени када је тај језик одабран од стране читаоца.

source: Public Menu
de: Öffentliches Menü
sr: Јавни мени

source: Use this section to unify the knowledge base with your own website's main navigation. Entries added here will appear in the knowledge base like in the following screenshot:
de: Verwenden Sie diesen Bereich, um die Knowledge Base mit der Hauptnavigation Ihrer eigenen Website zu vereinheitlichen. Hier hinzugefügte Einträge erscheinen in der Knowledge Base wie auf dem folgenden Screenshot:
sr: Користите овај одељак да обједините базу знања са главном навигацијом вашег сајта. Уноси додати овде ће се појавити у бази знања као на следећим примерима:

source: Knowledge Base: Public menu
de: Knowledge Base: Öffentliches Menü
sr: База знања: јавни мени

source: Zammad will provide a list of the current set links per knowledge base language. If you're missing a language, you'll have to add the language up front.
de: Zammad stellt eine Liste der aktuell verfügbaren Links pro Knowledge Base bereit. Wenn Ihnen eine Sprache fehlt, müssen Sie die Sprache im Voraus hinzufügen.
sr: Zammad ће обезбедити листу тренутних веза по језику базе знања. Ако вам недостаје језик, мораћете да додате језик унапред.

source: You can adjust every URL on language level.
de: Sie können jede URL auf Sprachebene anpassen.
sr: Можете да прилагодите сваку URL адресу на нивоу језика.

source: Knowledge Base: Configure public menu
de: Knowledge Base: Öffentliches Menü konfigurieren
sr: База знања: подешавање јавног менија

source: Customize the navigation menu that appears in the header of your knowledge base.
de: Passen Sie das Navigationsmenü an, das im Header Ihrer Knowledge Base erscheint.
sr: Прилагодите навигациони мени који се појављује у заглављу ваше базе знања.

source: Arranging URLs
de: Anpassung der URLs
sr: Уређивање URL адреса

source: By clicking on "Edit", Zammad allows you to add, update, re-arrange or remove URLs from either your public header menu or public footer menu.
de: Wenn Sie auf "Bearbeiten“ klicken, können Sie in Zammad URLs zu Ihrem öffentlichen Kopf- oder Fußzeilen hinzufügen, aktualisieren, neu anordnen oder entfernen.
sr: Кликом на „Уреди“, Zammad вам омогућава да додате, освежите, преуредите или уклоните URL адресе из јавног менија заглавља или јавног менија подножја.

source: Title
de: Titel
sr: Наслов

source: This is the URL title that's being displayed to your users.
de: Dies ist der URL-Text, der Ihren Benutzern angezeigt wird.
sr: Ово је назив URL адресе који се приказује вашим корисницима.

source: The actual URL the user is going to open upon clicking.
de: Die tatsächliche URL, die der Benutzer beim Klicken öffnen wird.
sr: Стварна URL адреса коју ће корисник отворити након клика.

source: Target
de: Ziel

source: Allows you to tell your users browser to open the URL in a new tab. By default your user would leave the knowledge base page if not set.
de: Damit können Sie den Browser Ihrer Benutzers anweisen, die URL in einem neuen Tab zu öffnen. Standardmäßig verlassen Ihre Benutzer die Seite beim Klick, wenn das nicht gesetzt ist.
sr: Омогућава вам да кажете претраживачу корисника да отвори URL адресу у новом прозору. Подразумевано, ваш корисник би напустио страницу базе знања ако ово није подешено.

source: If you tick the delete field, the URL will be removed from the menu upon pressing on the "Submit" button.
de: Wenn "Löschen“ aktivieren, wird die URL beim Klicken auf die Schaltfläche "Übermitteln" aus dem Menü entfernt.
sr: Ако означите поље за брисање, URL адреса ће бити уклоњена из менија притиском на дугме „Пошаљи“.

source: Change URLs position
de: Ändern Sie die Position der URL
sr: Промените позицију URL адреса

source: Use ☰ to drag & drop the URLs in question to the new desired position. Your changes will be saved with pressing the "Submit" button.
de: Ziehen Sie die betreffenden URLs per Drag & Drop mit ☰ an die neue gewünschte Position. Ihre Änderungen werden durch Klicken auf die Schaltfläche "Übermitteln“ gespeichert.
sr: Користите ☰ да превучете и испустите дотичне URL адресе на нову жељену позицију. Ваше промене ће бити сачуване притиском на дугме „Пошаљи“.

source: Custom URL
de: Eigene URL
sr: Прилагођени URL

source: This feature is only available on **self-hosted** instances.
de: Diese Funktion ist nur in **selbst gehosteten** Instanzen verfügbar.
sr: Ова функција је доступна само на инстанцама које **сами хостујете**.

source: Knowledge Base: Configure custom URL
de: Knowledge Base: Eigene URL konfigurieren
sr: База знања: подешавање прилагођене URL адресе

source: Relocate the knowledge base to the URL of your choosing.
de: Verschieben Sie die Knowledge Base auf eine URL Ihrer Wahl.
sr: Преместите базу знања на URL адресу по вашем избору.

source: By default, the knowledge base will appear at the same domain as your Zammad instance, under ``/help``.
de: Standardmäßig wird die Wissensdatenbank unter derselben Domain wie Ihre Zammad-Instanz unter ``/help`` angezeigt.
sr: Подразумевано, база знања ће се појавити на истом домену као и ваша Zammad инстанца, под ``/help``.

source: If you wish to customize where it can be accessed, enter your desired URL here and configure your web server accordingly. Zammad provides a snippet for Apache and Nginx webserver after clicking the **Web Server Configuration**.
de: Wenn Sie die Adresse anpassen möchten, geben Sie hier die gewünschte URL ein und konfigurieren Sie Ihren Webserver entsprechend. Zammad stellt ein Snippet für Apache- und Nginx-Webserver zur Verfügung, nachdem Sie auf die **Web-Server-Konfiguration** geklickt haben.
sr: Ако желите да прилагодите где му се може приступити, овде унесите жељену URL адресу и подесите свој веб сервер као што је описано. Zammad пружа примере за Apache и Nginx веб сервере након клика на **Подешавање веб сервера**.

source: You can find a tutorial about how to use a :docs:`custom knowledge base URL in combination with Nginx proxy manger (NPM) </appendix/custom-kb-url.html>` in the system documentation.
de: Sie finden in der Systemdokumentation eine Anleitung zur Verwendung einer :docs:`Custom Knowledge Base URL </appendix/custom-kb-url.html>` in Kombination mit Nginx proxy manger (NPM).
sr: Упутство за коришћење docs:`прилагођене URL адресе базе знања у комбинацији са Nginx proxy manager-ом (NPM) </appendix/custom-kb-url.html>` можете пронаћи у системској документацији.

source: Knowledge Base: Delete knowledge base
de: Knowledge Base: Löschen der Knowledge Base
sr: База знања: брисање базе знања

source: Permanently delete the knowledge base and all the articles within it.
de: Löschen Sie die Knowlege Base und alle darin enthaltenen Artikel dauerhaft.
sr: Трајно избришите базу знања и све чланке у њој.

source: Use this panel to delete the knowledge base. If you wish to unpublish it without deleting all of its content, simply disable it via the toggle button at the top of the window instead.
de: In diesem Bereich können Sie die Knowlege Base löschen. Wenn Sie nur die Veröffentlichung aufheben möchten, ohne den gesamten Inhalt zu löschen, deaktivieren Sie diese stattdessen einfach über den Schalter oben im Fenster.
sr: Користите овај панел да избришете базу знања. Ако желите да опозовете објављивање без брисања њеног садржаја, једноставно је искључите преко дугмета при врху прозора.

source: Permissions
de: Berechtigungen
sr: Дозволе

source: The general access to the knowledge base is managed via ``knowledge_base.reader`` and ``knowledge_base.editor`` permissions. You can find more information about roles and permissions :doc:`here <roles/index>`.
de: Der allgemeine Zugriff auf die Knowledge Base wird über die Berechtigungen ``knowledge_base.reader`` und ``knowledge_base.editor`` verwaltet. Weitere Informationen zu Rollen und Berechtigungen finden Sie :doc:`hier <roles/index>`.
sr: Општи приступ бази знања је омогућен путем ``knowledge_base.reader`` и ``knowledge_base.editor`` дозвола. Можете сазнати више о улогама и дозволама :doc:`овде <roles/index>`.

source: If you want to grant more granular permissions than the global read/edit permissions (e.g. edit permissions only for specific parts of the knowledge base), you can do so by following the steps below:
de: Wenn Sie feinere Berechtigungen als die globalen Lese-/Bearbeitungsberechtigungen erteilen möchten (z.B. Bearbeitungsberechtigungen nur für bestimmte Teile der Knowledge Base), können Sie dies mit den folgenden Schritten erreichen:
sr: Уколико желите да доделите грануларније дозволе од глобалних дозвола читања/уређивања (нпр. дозвола уређивања само за одговарајуће делове базе знања), то можете учинити пратећи кораке испод:

source: First create the base structure of the knowledge base (if not already done)
de: Erstellen Sie zunächst die Grundstruktur der Knowledge Base (falls noch nicht geschehen)
sr: Прво креирајте основну структуру базе знања (уколико то већ нисте учинили)

source: Create or choose one or more roles which should have granular permissions
de: Erstellen oder wählen Sie eine oder mehrere Rollen aus, die über die Berechtigung verfügen sollen
sr: Креирајте или одаберите једну или више улога које треба да имају грануларне дозволе

source: Grant the ``knowledge_base.reader`` permission to the desired role(s)
de: Erteilung der Berechtigung ``knowledge_base.reader`` an die gewünschte(n) Rolle(n)
sr: Доделите ``knowledge_base.reader`` дозволу жељеној улози/улогама

source: Edit the permissions of each (sub-)category of the knowledge base
de: Bearbeiten Sie die Berechtigungen für jede (Unter-)Kategorie der Knowledge Base
sr: Уредите дозволе сваке (под)категорије базе знања

source: Assign the role to one or more users who should be able to edit the knowledge base (partially)
de: Weisen Sie die Rolle einem oder mehreren Benutzern zu, die in der Lage sein sollen, die Knowledge Base (teilweise) zu bearbeiten
sr: Доделите улогу једном или више корисника који треба да уређују базу знања (делимично)

source: The permissions of a parent category are inherited to sub-categories.
de: Die Berechtigungen einer übergeordneten Kategorie werden an die Unterkategorien vererbt.
sr: Дозволе надређене категорије се наслеђују од стране подкатегорија.

source: The permission ``knowledge_base.reader`` can be widened or restricted in sub-categories.
de: Die Berechtigung ``knowledge_base.reader`` kann in Unterkategorien erweitert oder eingeschränkt werden.
sr: Дозвола ``knowledge_base.reader`` се може проширити или ограничити у подкатегоријама.

source: The permission ``knowledge_base.editor`` **can't** be adjusted in sub-categories.
de: Die Berechtigung ``knowledge_base.editor`` kann **nicht** angepasst werden in Unterkategorien.
sr: Дозвола ``knowledge_base.editor`` се **не може** изменити у подкатегоријама.

source: Have a look at the :user-docs:`knowledge base section </extras/knowledge-base.html>` in the user documentation where you can find more information about the usage.
de: Werfen Sie einen Blick auf den :user-docs:`Knowledge Base Bereich </extras/knowledge-base.html>` in der Benutzer-Dokumentation, wo Sie weitere Informationen über die Verwendung finden können.
sr: Погледајте user-docs:`одељак о бази знања </extras/knowledge-base.html>` у корисничкој документацији за више информација о коришћењу.

source: The permission ``knowledge_base.reader`` is not relevant for public answers. They are **always visible to everyone**.
de: Die Berechtigung``knowledge_base.reader`` ist für öffentliche Antworten nicht relevant. Sie sind **immer für alle sichtbar**.

source: Macros
de: Makros
sr: Макрои

source: Macros are **one-click actions** for applying pre-defined changes to a ticket.
de: Makros sind **Ein-Klick-Aktionen** zur Anwendung vordefinierter Änderungen auf Tickets.
sr: Макрои су **брзе радње** за шаблонске промене на тикетима.

source: If you find yourself making the same changes to lots of tickets (e.g. close-and-tag-as-spam or reassign-to-another-group), you can store those changes in a macro and apply it with one click:
de: Wenn Sie an vielen Tickets dieselben Änderungen vornehmen (z.B. Schließen und als Spam markieren oder einer anderen Gruppe zuordnen), können Sie diese Änderungen in einem Makro speichern und mit einem Klick anwenden:
sr: Ако се нађете у ситуацији да правите исте промене на великом броју тикета (*нпр.* затворите и означите као нежељену пошту или поново доделите другој групи), можете да сачувате те промене у макро и да их примените једним кликом:

source: Example macros within a ticket detail view.
de: Ansicht Beispielmakros in einem Ticket.
sr: Примери макроа у приказу детаља тикета.

source: Choose from the macros **Close & Tag as Spam**, **Move to RMA**, and **Reply & Close & Tag as Banana**.
de: Wählen Sie aus den Makros **Close & Tag as Spam**, **Move to RMA** und **Reply & Close & Tag as Banana**.
sr: Изаберите неки од макроа **Затвори и означи као непожељно**, **Премести у RMA** и **Одговори и затвори и означи као банану**.

source: You can also apply macros in bulk (i.e. to many tickets all at once) via the *Overviews* page:
de: Sie können Makros in *Übersichten* auch auf viele Tickets gleichzeitig anwenden:
sr: Такође можете да примените макрое као масовну радњу (тј. на више тикета одједном) преко странице *Прегледи*:

source: Example macros within an overview (bulk operation).
de: Beispielmakros in einer Übersicht (Massenbearbeitung).
sr: Примери макроа у оквиру прегледа (масовна радња).

source: Select your desired tickets, then click-and-drag to apply a macro to all of them.
de: Wählen Sie die gewünschten Tickets aus und klicken und ziehen Sie diese dann, um ein Makro auf alle anzuwenden.
sr: Изаберите жељене тикете, а затим превуците и испустите их да бисте применили макро на све њих.
