Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: Sometimes this doesn't come in handy as this also means you'll receive error messages about "email address being in use already" for (yet) unknown third-party authentication methods.
de: Das ist nicht immer hilfreich, da Sie dann auch Fehlermeldungen über "bereits verwendete E-Mail-Adressen" für (noch) unbekannte Authentifizierungsmethoden von Drittanbietern erhalten.
sr: Понекад ово није згодно јер то такође значи да ћете добијати поруке о грешци да се „имејл адреса већ користи“ за (још) непознате методе аутентификације преко трећег лица.

source: If you want to allow your users to always be able to log in, no matter what, you may want to enable **Automatic account link on initial logon** by setting it to ``yes``.
de: Wenn Sie wollen, dass sich Ihre Benutzer immer und überall anmelden können, sollten Sie **Automatische Kontoverbindung bei der Erstanmeldung** aktivieren, indem Sie den Wert ``Ja`` wählen.
sr: Ако желите да омогућите својим корисницима да увек могу да се пријаве, без обзира на све, можда ћете желети да укључите **Аутоматско повезивање налога приликом иницијалне пријаве** постављањем на ``да``.

source: Automatic Account Linking Notification
de: Automatische Benachrichtigung beim Verknüpfen von Accounts
sr: Обавештавање о аутоматском повезивању налога

source: To improve security and your users awareness, you can enable Zammad to notify your users when a new third-party application has been linked to their account by setting it to ``yes``.
de: Um die Sicherheit zu verbessern können Sie Ihre Nutzer durch Zammad benachrichtigen lassen, wenn eine neue Drittanbieteranwendung mit ihrem Konto verknüpft wurde, indem Sie die Einstellung auf ``Ja`` setzen.
sr: Да бисте побољшали безбедност и свест корисника, можете омогућити Zammad-у да обавести ваше кориснике када је нова апликација трећег лица повезана са њиховим налогом постављањем на ``да``.

source: This notification is sent out once per third-party application. Zammad does also mention the method used, e.g.: ``Microsoft``.
de: Diese Benachrichtigung wird einmal pro Drittanwendung verschickt. Darin enthalten ist auch die verwendete Methode, z.B.: ``Microsoft``.
sr: Ово обавештење се шаље једном по апликацији трећег лица. Zammad такође помиње коришћени метод, на пример: ``Microsoft``.

source: By default this setting is not active (set to ``no``).
de: Standardmäßig ist diese Einstellung nicht aktiv (auf ``nein`` gesetzt).
sr: Подразумевано ово подешавање није укључено (подешено је на ``не``).

source: This notification is only sent if the account in question already exists. If the login via the third-party also creates the missing account, the notification will be skipped.
de: Diese Benachrichtigung wird nur gesendet, wenn das betreffende Konto bereits existiert. Wenn die Anmeldung über den Drittanbieter auch das fehlende Konto erstellt, wird die Benachrichtigung übersprungen.
sr: Ово обавештење се шаље само ако дотични налог већ постоји. Ако пријављивање преко трећег лица такође додаје нови налог, обавештење ће бити прескочено.

source: This means it only affects:
de: Dies bedeutet, dass es nur Auswirkungen hat auf:
sr: То значи да утиче само на:

source: manual account linking within the third-party page of the users profile
de: manuelle Verknüpfung des Benutzerprofils mit einem Konto auf der Drittanbieterseite
sr: ручно повезивање налога у оквиру странице трећег лица корисничког профила

source: logging into an existing local account by utilizing the **automatic account link on initial logon** functionality
de: Anmelden an einem bestehenden lokalen Konto über die Funktion **Automatische Kontoverbindung bei der Erstanmeldung**
sr: пријављивање на постојећи локални налог коришћењем функције **Аутоматско повезивање налога приликом иницијалне пријаве**

source: No User Creation on Logon
de: Keine Erstellung von Benutzern bei der Anmeldung
sr: Без отварања налога по пријави

source: By default, Zammad will create a new user account if the user logs in via a third-party application and the account doesn't exist yet.
de: Standardmäßig erstellt Zammad ein neues Benutzerkonto, wenn sich der Benutzer über eine Drittanbieteranwendung anmeldet und das Konto noch nicht existiert.
sr: Подразумевано, Zammad ће отворити нови кориснички налог ако се корисник пријављује преко апликације трећег лица и налог још увек не постоји.

source: If you want to prevent Zammad from creating new accounts on logon, you can disable this feature by setting **No user creation on logon** to ``yes``.
de: Wenn Sie verhindern möchten, dass Zammad bei der Anmeldung neue Konten erstellt, können Sie diese Funktion deaktivieren, indem Sie **Keine Erstellung von Benutzern bei der Anmeldung** auf ``Ja`` setzen.
sr: Уколико желите да спречите Zammad да отвара нове налоге по пријави, можете искључити ову функцију постављањем **Без отварања налога по пријави** на ``да``.

source: It is possible to create a quick login for your helpdesk via Facebook. To do so, you need to follow these steps:
de: Es ist möglich, eine Anmeldung über Facebook zu erstellen. Dazu müssen Sie die folgenden Schritte ausführen:
sr: Могуће је подесити брзо пријављивање у Zammad преко Facebook-а. Да бисте то урадили, потребно је да пратите следеће кораке:

source: Register Facebook App
de: Facebook-App registrieren
sr: Региструјте Facebook апликацију

source: Visit https://developers.facebook.com/apps/ and click on "Add a new App"
de: Besuchen Sie https://developers.facebook.com/apps/ und klicken Sie auf "Eine neue App hinzufügen"
sr: Посетите https://developers.facebook.com/apps/ и кликните на „Add a new App“

source: initial page
de: Startseite
sr: почетна страница

source: After that enter the app settings
de: Geben Sie danach die Einstellungen der App ein
sr: Након тога унесите подешавања апликације

source: Navigate to "Settings" and fill in this information
de: Navigieren Sie zu "Einstellungen" und geben Sie diese Informationen ein
sr: Идите на „Settings“ и попуните ове информације

source: App Settings
de: App-Einstellungen

source: Navigate to app review and Check "Make [appname] public?"
de: Navigieren Sie zur App-Prüfung und setzen Sie einen Haken bei "[Appname] öffentlich machen?"
sr: Идите на рецензију апликације и означите „Make [назив апликације] public?“

source: App Review
de: App-Prüfung

source: Configure Zammad as Facebook App
de: Zammad als Facebook-App konfigurieren
sr: Подесите Zammad као Facebook апликацију

source: Navigate to *Settings > Security > Third-party Applications* and enter the App ID and the App Secret. You can find this key in the dashboard of your Facebook app.
de: Navigieren Sie zu *Einstellungen > Sicherheit > Anwendungen von Drittanbietern* und geben Sie die App ID und das App Secret ein. Sie finden diesen Schlüssel im Dashboard Ihrer Facebook-App.
sr: Идите на *Подешавања > Безбедност > Апликације трећег лица* и унесите ID апликације и шифру апликације. Овај кључ можете пронаћи у контролној табли ваше Facebook апликације.

source: Zammad Configuration
de: Zammad Konfiguration
sr: Zammad подешавања

source: Now you can link accounts via *Avatar > Profile > Link Accounts* or login via Zammad login page.
de: Jetzt können Sie Konten über *Avatar > Profil > Verknüpfte Konten* verknüpfen oder sich über die Zammad-Login-Seite anmelden.
sr: Сада можете повезати налоге преко *Аватар > Профил > Повезани налози* или се пријавити преко Zammad странице за пријаву.

source: It is possible to create a quick login for your helpdesk via GitHub. To activate the quick login, you need to enable OAuth for GitHub.
de: Es ist möglich, eine Anmeldung über GitHub zu erstellen. Um diese zu aktivieren, müssen Sie OAuth für GitHub aktivieren.
sr: Могуће је подесити брзо пријављивање у Zammad преко GitHub-а. Да бисте то урадили, потребно је да омогућите OAuth за GitHub.

source: Register GitHub App
de: GitHub-App registrieren
sr: Регистрација GitHub апликације

source: Visit https://www.github.com/settings/applications/new and enter the app settings. As callback URL, enter ``https://zammad_host/auth/github/callback`` where ``zammad_host`` has to be replaced with your Zammad FQDN. You can even find and copy the callback URL from Zammad in the **Authentication via GitHub** section.
de: Besuchen Sie https://www.github.com/settings/applications/new und geben Sie die Einstellungen in der App ein. Als Callback URL geben Sie ``https://zammad_host/auth/github/callback`` ein, wobei ``zammad_host`` durch Ihren Zammad FQDN ersetzt werden muss. Sie können die Callback-URL von Zammad auch im Abschnitt **Authentifizierung über GitHub** finden und kopieren.
sr: Посетите https://www.github.com/settings/applications/new и унесите подешавања апликације. Као URL адресу повратног позива унесите ``https://zammad_host/auth/github/callback`` где ``zammad_host`` треба да буде замењено вашом Zammad FQDN адресом. URL адресу повратног позива можете чак пронаћи и ископирати из Zammad-а и у одељку **Аутентификација преко GitHub**.

source: Register OAuth app on www.github.com
de: OAuth-App auf www.github.com registrieren
sr: Региструјте OAuth апликацију на www.github.com

source: Configure Zammad as GitHub App
de: Zammad als GitHub-Anwendung konfigurieren
sr: Подесите Zammad као GitHub апликацију

source: Enter the **APP ID** and the **APP SECRET** from the GitHub OAUTH Applications Dashboard:
de: Geben Sie die **APP ID** und das **APP SECRET** aus dem GitHub OAUTH Applications Dashboard ein:
sr: Унесите **ID апликације** и **Шифру апликације** са контролне табле GitHub OAuth апликација:

source: GitHub config in Zammad admin interface
de: GitHub-Konfiguration im Zammad Admin-Bereich
sr: GitHub конфигурација у администраторском интерфејсу Zammad-а

source: After you configured the GitHub credentials and activated the login method, you should see a new icon on the login page.
de: Nachdem Sie die GitHub-Zugangsdaten konfiguriert und die Anmeldemethode aktiviert haben, sollten Sie ein neues Symbol auf der Anmeldeseite sehen.
sr: Након што сте подесили GitHub акредитиве и укључили метод пријављивања, требало би да видите нову иконицу на страници за пријаву.

source: GitHub logo on login page
de: GitHub-Logo auf der Anmeldeseite
sr: GitHub логотип на страници за пријаву

source: If you click on the icon you will be redirected to GitHub and see something similar to this:
de: Wenn Sie auf das Symbol klicken, werden Sie zu GitHub weitergeleitet und sehen einen Dialog ähnlich dem folgenden:
sr: Ако кликнете на иконицу, бићете преусмерени на GitHub и видећете нешто слично следећем:

source: GitHub oauth page
de: GitHub oauth Seite
sr: GitHub OAuth страница

source: After granting access, you will be redirected to your Zammad instance and logged in.
de: Nachdem Sie den Zugang gewährt haben, werden Sie zu Ihrer Zammad-Instanz weitergeleitet und eingeloggt.
sr: По одобравању приступа, бићете преусмерени на своју Zammad инстанцу и пријављени.

source: It is possible to create a quick login for your helpdesk via Gitlab. To activate the quick login, you need to enable OAuth for Gitlab.
de: Es ist möglich, eine Anmeldung über Gitlab zu erstellen. Um diese zu aktivieren, müssen Sie OAuth für Gitlab aktivieren.
sr: Могуће је подесити брзо пријављивање у Zammad преко GitLab-а. Да бисте то урадили, потребно је да омогућите OAuth за GitHub.

source: Register Gitlab App
de: Gitlab-App registrieren
sr: Регистрација Gitlab апликације

source: To register an app in Gitlab, open your profile and select applications.
de: Um eine Anwendung in Gitlab zu registrieren, öffnen Sie Ihr Profil und wählen Sie Anwendungen.
sr: Да бисте регистровали апликацију у Gitlab-у, отворите свој профил и изаберите апликације.

source: As callback URL, enter ``https://zammad-fqdn/auth/gitlab/callback`` where ``zammad-fqdn`` has to be replaced with your Zammad FQDN. You can even find and copy the callback URL from Zammad in the **Authentication via GitLab** section.
de: Als Callback URL geben Sie ``https://zammad-fqdn/auth/gitlab/callback`` ein, wobei ``zammad-fqdn`` durch Ihren Zammad FQDN ersetzt werden muss. Sie können die Callback-URL von Zammad auch im Abschnitt **Authentifizierung über GitLab** finden und kopieren.
sr: Као URL адресу повратног позива унесите ``https://zammad-fqdn/auth/gitlab/callback`` где ``zammad-fqdn`` мора бити замењено вашом Zammad FQDN адресом. URL адресу повратног позива можете чак пронаћи и ископирати из Zammad-а и у одељку **Аутентификација преко GitHub**.

source: Register OAuth app on gitlab instance
de: OAuth-Anwendung auf Gitlab-Instanz registrieren
sr: Региструјте OAuth апликацију на Gitlab инстанци

source: Just select *read_user* under scopes as in the screenshot and save it.
de: Wählen Sie nur *read_user* unter scopes wie im Screenshot und speichern Sie.
sr: Само изаберите *read_user* за опсег дозвола као на снимку екрана и сачувајте је.

source: Configure Zammad as Gitlab App
de: Zammad als Gitlab-Anwendung konfigurieren
sr: Подесите Zammad као Gitlab апликацију

source: Enter the **APP ID** and the **APP SECRET** from the Gitlab OAUTH Applications Dashboard and your Gitlab-URL in the **SITE** field.
de: Geben Sie die **APP ID** und das **APP SECRET** aus dem Gitlab OAUTH Applications Dashboard und Ihre Gitlab-URL in das Feld **SITE** ein.
sr: Унесите **ID апликације** и **Шифру апликације** са контролне табле Gitlab OAuth апликација и своју Gitlab URL адресу у поље **Путања**.

source: Gitlab config in Zammad admin interface
de: Gitlab-Konfiguration in der Zammad-Verwaltungsoberfläche
sr: Gitlab конфигурација у администраторском интерфејсу Zammad-а

source: After you configured the Gitlab credentials and activated the login method, you should see a new icon on the login page.
de: Nachdem Sie die Gitlab-Anmeldedaten konfiguriert und die Anmeldemethode aktiviert haben, sollten Sie ein neues Symbol auf der Anmeldeseite sehen.
sr: Након што сте подесили Gitlab акредитиве и активирали метод пријављивања, требало би да видите нову иконицу на страници за пријаву.

source: Gitlab logo on login page
de: Gitlab-Logo auf der Anmeldeseite
sr: Gitlab логотип на страници за пријаву

source: If you click on the icon, you will be redirected to Gitlab and see something similar to this:
de: Wenn Sie auf das Symbol klicken, werden Sie zu Gitlab weitergeleitet und sehen einen Dialog ähnlich dem folgenden:
sr: Ако кликнете на иконицу, бићете преусмерени на Gitlab и видећете нешто слично следећем:

source: Gitlab oauth page
de: Gitlab oauth Seite
sr: Gitlab OAuth страница

source: Configure Google as an OAuth provider so users can log in to Zammad with their Google account.
de: Konfigurieren Sie Google als OAuth-Anbieter, damit sich Benutzer mit ihrem Google Konto bei Zammad anmelden können.
sr: Подешава Google као OAuth провајдера тако да се корисници могу пријавити на Zammad са својим Google налогом.

source: Register a Google App
de: Eine Google-App registrieren
sr: Регистрација Google апликације

source: Create a new project if you don't have one already. Do so by following this link: https://console.cloud.google.com/projectcreate
de: Legen Sie ein neues Projekt an, wenn Sie noch keins haben. Folgen Sie dazu diesem Link: https://console.cloud.google.com/projectcreate
sr: Направите нови пројекат уколико га још немате. То можете урадити преко следећег линка: https://console.cloud.google.com/projectcreate

source: Check if you are already in your project. If not, switch to it.
de: Prüfen Sie, ob Sie sich bereits in Ihrem Projekt befinden. Wenn nicht, wechseln Sie dorthin.
sr: Проверите да ли сте већ у вашем пројекту. Уколико нисте, пребаците се.

source: Go to *APIs & Services > OAuth consent screen*. If you didn't configure it before, you should see a **Get started** button. Follow the steps and provide the requested information.
de: Gehen Sie zu *APIs & Services > OAuth consent screen*. Sofern noch nicht konfiguriert, sollten Sie eine Schaltfläche **Get started** sehen. Befolgen Sie die Schritte und geben Sie die angeforderten Informationen ein.
sr: Идите на *APIs & Services > OAuth consent screen*. Уколико га нисте раније подешавали, видећете дугме **Get started**. Пратите кораке и унесите захтеване податке.

source: **App name**: Any fitting name. This is what the user sees when trying to log in via Google.
de: **App name**: Ein beliebiger passender Name. Das sieht der Benutzer, wenn er versucht, sich über Google anzumelden.
sr: **App name**: Било који назив који вам има смисла. Ово је оно што ће корисник видети када покуша да се пријави преко Google-а.

source: **User support email**: choose an available email address here.
de: **User support email**: Wählen Sie hier eine verfügbare E-Mail-Adresse aus.
sr: **User support email**: одаберите доступну имејл адресу овде.

source: **Audience**: Choose Internal or External, depending on your use case.
de: **Audience**: Wählen Sie intern oder extern, je nach Anwendungsfall.
sr: **Audience**: Одаберите „Internal” или „External”, у зависности од ваше ситуације.

source: **Contact Information**: enter an email address which should get notified about changes in your project.
de: **Contact Information**: Geben Sie eine E-Mail Adresse an, die über Änderungen in Ihrem Projekt informiert werden soll.
sr: **Contact Information**: унесите имејл адресу која ће бити обавештена о изменама у вашем пројекту.

source: Go to *APIs & Services > Credentials*. Add a configuration by clicking the **Create credentials** dropdown. Choose **OAuth client ID** and fill in the following information, replace ``zammad_host`` with the FQDN of your Zammad. You can also find the redirect URI in Zammad's Google OAuth configuration.
de: Gehen Sie zu *APIs & Services > Credentials*. Fügen Sie eine Konfiguration hinzu, indem Sie auf das Dropdown-Menü **Create credentials** klicken. Wählen Sie **OAuth client ID** und geben Sie die folgenden Informationen ein. Ersetzen Sie ``zammad_host`` durch den FQDN Ihres Zammads. Sie finden den Redirect-URI auch in der Google OAuth-Konfiguration von Zammad.
sr: Идите на *APIs & Services > Credentials*. Додајте подешавање кликом на падајући мени **Create credentials**. Одаберите **OAuth client ID** и попуните следеће податке, мењајући ``zammad_host`` у FQDN ваше Zammad инстанце. Такође можете пронаћи URI адресу редирекције у Zammad-овој Google OAuth конфигурацији.

source: **Name**: Any fitting name for your use case, e.g. Zammad.
de: **Name**: Ein beliebiger passender Name für Ihren Anwendungsfall, z.B. Zammad.
sr: **Name**: Било који назив који има смисла, нпр. Zammad.

source: Screenshot shows OAuth credentials section in the Google console
de: Screenshot zeigt den Abschnitt mit den OAuth-Zugangsdaten in der Google-Console
sr: Снимак екрана који приказује одељак OAuth креденцијала у Google конзоли

source: After adding the information, click on **Create**. This opens a dialog where you can see important information. Make sure to leave this dialog open and/or copy the **Client ID** and **Client secret**.
de: Nachdem Sie die Informationen hinzugefügt haben, klicken Sie auf **Create**. Daraufhin wird ein Dialogfeld geöffnet, in dem Sie wichtige Informationen sehen können. Achten Sie darauf, diesen Dialog geöffnet zu lassen und/oder die **Client-ID** und das **Client-Secret** zu kopieren.
sr: По додавању података, кликните на **Create**. Ово ће отворити дијалог где можете видети важне информације. Оставите овај дијалог отворен и/или ископирајте **Client ID** и **Client secret**.

source: Screenshot shows client ID and client secret dialog
de: Screenshot zeigt Client-ID- und Client-Secret-Dialog
sr: Снимак екрана који приказује дијалог са Client ID и Client secret

source: Configure Authentication in Zammad
de: Authentifizierung in Zammad konfigurieren
sr: Подешавање аутентификације у Zammad-у

source: After creating the credentials, go to your Zammad installation and navigate to *Settings > Security > Third-party Applications > Authentication via Google*. Enter your **Client ID** and **Client secret** here, enable the toggle and click on **Submit**.
de: Nachdem Sie die Zugangsdaten erstellt haben, gehen Sie zu Ihrer Zammad-Installation und navigieren Sie zu *Einstellungen > Sicherheit > Anwendungen von Drittanbietern > Anmeldung über Google*. Geben Sie hier Ihre **Client ID** und Ihr **Client-Secret** ein, aktivieren Sie das Feature per Schalter und klicken Sie auf **Übermitteln**.
sr: Након што креирате креденцијале, пређите на инсталацију Zammad-а и идите на „Подешавања > Безбедност > Апликације трећег лица > Аутентификације преко Google-а** Овде унесите свој **ID клијента** и **Шифру клијента**, укључите прекидач и кликните на **Пошаљи**.

source: Screenshot shows Google OAuth configuration in Zammad
de: Screenshot zeigt die Google OAuth-Konfiguration in Zammad
sr: Снимак екрана који приказује Google OAuth конфигурацију у Zammad-у

source: After submitting, users can log in with their Google account.
de: Nach dem Absenden können sich die Benutzer mit ihrem Google Konto anmelden.
sr: Након снимања, корисници ће моћи да се пријаве преко својих Google налога.

source: Zammad's Microsoft connection allows your users with Microsoft accounts to login. This works for Azure users as well and can be an alternative to :doc:`/system/integrations/ldap/index`.
de: Die Microsoft-Andingung von Zammad ermöglicht Ihren Benutzern die Anmeldung mit einem Microsoft-Konto. Dies funktioniert auch für Azure-Benutzer und kann eine Alternative zu :doc:`/system/integrations/ldap/index` sein.
sr: Zammad-ова Microsoft интеграција омогућава вашим корисницима са Microsoft налозима да се пријаве. Ово функционише и за Azure кориснике и може бити алтернатива :doc:`/system/integrations/ldap/index`.

source: This documentation part does not cover our :doc:`📧 Microsoft 365 email channel </channels/microsoft365/index>`.
de: Dieser Teil der Dokumentation deckt nicht unseren :doc:`📧 Microsoft 365-Kanal </channels/microsoft365/index>` ab.
sr: Овај део документације не покрива наш :doc:`📧 Microsoft 365 имејл канал </channels/microsoft365/index>`.

source: Screenshot showing Microsoft login button on Zammad login screen.
de: Screenshot der Microsoft-Anmeldung auf dem Anmeldedialog von Zammad.
sr: Снимак екрана који приказује дугме за пријаву на Microsoft на екрану пријаве у Zammad.

source: Supported account types:
de: Unterstützte Konten-Typen:
sr: Подржани типови налога:

source: Please note that Zammad only supports these account types (App dependent):
de: Bitte beachten Sie, dass Zammad nur diese Kontotypen unterstützt (App-abhängig):
sr: Имајте на уму да Zammad подржава само следеће типове налога (зависно од апликације):

source: Accounts in this organizational directory only (Default Directory only - Single tenant)
de: Nur Konten in dieser Organisationseinheit (nur Standardverzeichnis - einzelner tenant)
sr: Налози само у овом организационом директоријуму (само подразумевани директоријум – један корисник)

source: Accounts in any organizational directory (Any Azure AD directory - Multitenant)
de: Konten in einer beliebigen Organisationseinheit (beliebiges Azur AD-Verzeichnis - Multi-Tenant)
sr: Налози у било ком организационом директоријуму (било који Azure AD директоријум - више корисника)

source: Accounts in any organizational directory (Any Azure AD directory - Multitenant) and personal Microsoft accounts (e.g. Skype, Xbox)
de: Konten in einer beliebigen Organisationseinheit (beliebiges Azur AD-Verzeichnis - Multi-Tenant) und persönliche Microsoft-Konten (z.B. Skype, Xbox)
sr: Налози у било ком организационом директоријуму (било који Azure AD директоријум - више корисника) и лични Microsoft налози (нпр. Skype, Xbox)

source: Avatars of signing in users:
de: Avatare der angemeldeten Benutzer:
sr: Аватари пријављених корисника:
