Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: After adding users and groups, go back to the Azure portals home and select *App registrations*. Within your desired app go to *API permissions* and use the *Grant admin consent for {company name}* button to generally allow connecting users you previously consented.
de: Nachdem Sie Benutzer und Gruppen hinzugefügt haben, kehren Sie zur Startseite des Azure-Portals zurück und wählen Sie *App-Registrierung* aus. Gehen Sie in Ihrer gewünschten App zu *API-Berechtigungen* und verwenden Sie die Schaltfläche *Administrator-Zustimmung für {Unternehmensname} erteilen*, um die Verbindung für Benutzer zu erlauben, denen Sie zuvor zugestimmt haben.
sr: Након што додате кориснике и групе, вратите се на почетну страницу Azure портала и изаберите *App registrations*. У оквиру жељене апликације идите на *API permissions* и користите дугме *Grand admin consent for {назив фирме}* да бисте генерално дозволили повезивање корисника за које сте претходно дали сагласност.

source: Not adding users / groups nor providing the granted admin consent right away will cause Microsoft to enforce at least the first user to be requested to provide a reason for the consent request. After that Microsoft will automatically grant the consent for your tenant.
de: Wenn Benutzer/Gruppen nicht sofort hinzugefügt oder Administrator-Zustimmung nicht sofort erteilt wird, erzwingt Microsoft zumindest den ersten Benutzer dazu, einen Grund für die Zustimmungs-Anfrage anzugeben. Danach erteilt Microsoft automatisch die Zustimmung für Ihren Mandanten.
sr: Недодавање корисника/група нити пружање администраторске сагласности одмах ће довести до тога да Microsoft принуди да барем од првог корисника буде затражено да наведе разлог за захтев за сагласност. Након тога ће Microsoft аутоматски дати сагласност вашем кориснику.

source: Administrative accounts can also use the option *Consent on behalf of your organization* in above mentioned permission dialogue.
de: Administrator-Konten können auch die Option "Einwilligung im Namen Ihrer Organisation“ im oben genannten Berechtigungsdialog verwenden.
sr: Административни налози такође могу да користе опцију *Consent on behalf of your organization* у горе поменутом дијалогу за дозволе.

source: Screenshot showing popup about connecting app
de: Screenshot mit Popup-Fenster zum Verbinden der App
sr: Снимак екрана који приказује дијалог повезивања апликације

source: 🍾 Congratulations! Now you're ready to connect Microsoft 365 accounts to Zammad.
de: 🍾 Herzlichen Glückwunsch! Jetzt können Sie Microsoft 365-Konten mit Zammad verbinden.
sr: 🍾 Честитамо! Сада сте спремни да повежете Microsoft 365 налоге са Zammad-ом.

source: Secondary addresses in Microsoft 365 channels work in the same way as in email channels. This is why the section has been adopted verbatim from :doc:`here </channels/email/accounts/secondary-addresses>`.
de: Zusätzliche Adressen in Microsoft 365-Kanälen funktionieren genauso wie in E-Mail-Kanälen. Deshalb wurde der Abschnitt wörtlich von :doc:`hier </channels/email/accounts/secondary-addresses>` übernommen.
sr: Секундарне адресе у Microsoft 365 каналима функционишу идентично као у имејл каналима. Зато је овај чланак дословно пренешен :doc:`одавде </channels/email/accounts/secondary-addresses>`.

source: 👀 **Secondary addresses must be added to your Microsoft account first.**
de: 👀 **Alias-Adressen müssen zuerst Ihrem Microsoft-Konto hinzugefügt werden.**
sr: 👀 **Секундарне адресе прво морају да се додају у вашем Microsoft налогу.**

source: Personal accounts
de: Persönliche Accounts
sr: Лични налози

source: Use the `Manage how you sign in to Microsoft <https://account.live.com/names/Manage>`_ panel at https://account.live.com.
de: Nutze die `Anmeldung bei Microsoft verwalten <https://account.live.com/names/Manage>`_ Oberfläche von https://account.live.com.
sr: Користите панел `Manage how you sign in to Microsoft <https://account.live.com/names/Manage>`_ на https://account.live.com.

source: Hosted Exchange accounts
de: Gehostete Exchange Accounts
sr: Хостовани Exchange налози

source: In your `Exchange admin center <https://outlook.office.com/ecp/>`_:
de: In Ihrem `Exchange admin center <https://outlook.office.com/ecp/>`_:
sr: У вашем `Exchange admin center <https://outlook.office.com/ecp/>`_:

source: select a user under **recipients > mailboxes**,
de: wählen Sie einen Benutzer unter **Empfänger > Postfächer**,
sr: изаберите корисника под **recipients > mailboxes**,

source: edit it (double-click or ✏️), and
de: editieren Sie diesen (Doppelklick oder ✏️), und
sr: уредите га (двапут кликните или ✏️), и

source: add an an alias under **email address**.
de: fügen Sie einen neuen Alias unter **E-Mail Adressen** hinzu.
sr: додајте псеудоним под **email address**.

source: Contact your administrator if you don’t have access to an admin account.
de: Kontaktieren Sie Ihre Administrator, falls Sie keinen Zugriff auf einen Administrator-Account haben.
sr: Обратите се администратору ако немате приступ администраторском налогу.

source: Here you can find some common errors in M365 context. Also have a look at the general :doc:`M365 documentation </channels/microsoft365/index>` for the configuration.
de: Hier finden Sie einige häufige Fehler im M365-Kontext. Schauen Sie sich auch die allgemeine :doc:`M365-Dokumentation </channels/microsoft365/index>` für die Konfiguration an.
sr: Овде можете пронаћи неке уобичајене грешке у М365 контексту. Такође погледајте општу :doc:`М365 документацију </channels/microsoft365/index>` у вези подешавања.

source: Incorrect Client ID
de: Nicht korrekte Client ID
sr: Погрешан клијент ID

source: **Error message:** AADSTS00016: Application with identifier 'xxxxxxxx' was not found in the directory 'MSFT'. This can happen if the application has not been installed by the administrator of the tenant or consented to by any user in the tenant. You may have sent your authentication request to the wrong tenant.
de: **Fehlermeldung:** AADSTS00016: Application with identifier 'xxxxxxxx' was not found in the directory 'MSFT'. This can happen if the application has not been installed by the administrator of the tenant or consented to by any user in the tenant. You may have sent your authentication request to the wrong tenant.
sr: **Порука о грешци:** AADSTS00016: Application with identifier ‘xxxxxxxx’ was not found in the directory ‘MSFT’. Ово се може десити ако апликацију није инсталирао администратор или није дао сагласност било ком кориснику. Можда сте послали захтев за аутентификацију погрешном кориснику.

source: Error message
de: Fehlermeldung
sr: Порука о грешци

source: In this case, please compare whether the client ID created in Zammad matches that in Azure for the Azure App.
de: Vergleichen Sie in diesem Fall bitte, ob die in Zammad erstellte Client-ID mit der in Azure für die Azure-App übereinstimmt.
sr: У овом случају, проверите да ли се клијент ID додат у Zammad-у подудара са оним панелу Azure апликације.

source: The Client ID can be found in Zammad under Settings > Channels > Microsoft 365 > App Configuration. See :doc:`here </channels/microsoft365/accounts>` how to find the client ID in Azure and where to copy it to in Zammad.
de: Die Client-ID finden Sie in Zammad unter Einstellungen > Kanäle > Microsoft 365 > App-Konfiguration. Unter :doc:`hier </channels/microsoft365/accounts>` sehen Sie, wie Sie die Client-ID in Azure finden und wohin Sie diese in Zammad kopieren müssen.
sr: Клијент ID се може пронаћи у Zammad-у под Подешавања > Канали > Microsoft 365 > Налози. Погледајте :doc:`овде </channels/microsoft365/accounts>` како пронаћи клијент ID у Azure панелу и где да га ископирате у Zammad.

source: Wrong or Expired Client Secret
de: Falsches oder abgelaufenes Client-Secret
sr: Погрешна или истекла клијентска шифра

source: **Error message:** 500: We're sorry, but something went wrong.
de: **Fehlermeldung:** 500: We're sorry, but something went wrong.
sr: **Порука о грешци:** 500: We’re sorry, but something went wrong.

source: This error occurs when the client uses an incorrect or expired client secret.
de: Dieser Fehler tritt auf, wenn der Client ein falsches oder abgelaufenes Client-Secret verwendet.
sr: Ова грешка се јавља када клијент користи погрешну или истеклу клијентску шифру.

source: **Important notice:** We never ask the client for the client secret as this can potentially be a security risk. We ask the customer to create a new client secret and copy the value and not the ID to Zammad.
de: **Wichtiger Hinweis:** Wir fragen unsere Kunden niemals nach dem Client-Secret, da dies möglicherweise ein Sicherheitsrisiko darstellen kann. Wir bitten den Kunden, ein neues Client-Secret zu erstellen und den Wert (und nicht die ID) in Zammad zu kopieren.
sr: **Важно обавештење:** Никада не тражимо од клијента да подели са нама клијентску шифру јер то потенцијално може представљати безбедносни ризик. Тражимо од клијента да креира нову клијентску шифру и копира вредност, а не ID у Zammad.

source: See :doc:`here </channels/microsoft365/accounts>` for more information.
de: Siehe :doc:`hier </channels/microsoft365/accounts>` für weitere Informationen.
sr: Погледајте :doc:`овде </channels/microsoft365/accounts>` за више информација.

source: Wrong Tenant
de: Falscher Tenant
sr: Погрешан корисник

source: **Error message:** AADSTS0023: Specified tenant identifier 'xxxxxxxx' is neither a valid DNS name, nor a valid external domain.
de: **Fehlermeldung:** AADSTS0023: Specified tenant identifier 'xxxxxxxx' is neither a valid DNS name, nor a valid external domain.
sr: **Порука о грешци:** AADSTS0023: Specified tenant identifier ‘xxxxxxxx’ is neither a valid DNS name, nor a valid external domain.

source: If a wrong tenant is used in Zammad or the email account is not a member of the tenant created in Zammad, this error message occurs.
de: Wenn in Zammad ein falscher Tenant verwendet wird oder das E-Mail-Konto kein Mitglied des in Zammad erstellten Tenant ist, tritt diese Fehlermeldung auf.
sr: Ако се у Zammad-у користи погрешан корсиник или имејл налог не припада кориснику из Zammad-а, појављује се ова порука о грешци.

source: In this case, please check if the tenant is entered correctly in Zammad, or remove the tenant completely.
de: Bitte prüfen Sie in diesem Fall, ob der Tenant korrekt in Zammad eingetragen ist, oder entfernen Sie den Tenant komplett.
sr: У овом случају, проверите да ли је корисник исправно унет у Zammad или потпуно уклоните корисника.

source: **Important notice:** Once the tenant is completely removed, all email accounts can be created in Zammad regardless of which tenant the email account is a member of.
de: **Wichtiger Hinweis:** Sobald der Tenant vollständig entfernt wurde, können alle E-Mail-Konten in Zammad erstellt werden, unabhängig davon, welchem Tenant das E-Mail-Konto angehört.
sr: **Важно обавештење:** Када се корисник потпуно уклони, сви имејл налози могу да се додају у Zammad без обзира на то ком кориснику припадају.

source: **Prompt:** approval required
de: **Dialog:** Genehmigung erforderlich
sr: **Порука:** approval required

source: This message occurs when the admin tries to create an email account in Zammad that has not yet received approval from the Azure global admin.
de: Diese Meldung erscheint, wenn der Administrator versucht, ein E-Mail-Konto in Zammad zu erstellen, das noch keine Zustimmung vom Azure-Administrator erhalten hat.
sr: Ова порука се јавља када администратор покуша да дода имејл налог у Zammad који још није добио одобрење од Azure глобалног администратора.

source: In our documentation, :doc:`step-by-step instructions </channels/microsoft365/accounts/account-setup>` can be found on how to request admin consent from Zammad.
de: In unserer Dokumentation finden Sie eine :doc:`Schritt-für-Schritt-Anleitungen </channels/microsoft365/accounts/account-setup>` zum Anfordern der Administrator-Zustimmung aus Zammad.
sr: У нашој документацији, можете пронаћи :doc:`упутство корак по корак </channels/microsoft365/accounts/account-setup>` о томе како да затражите сагласност администратора из Zammad-а.

source: The request for the admin consent can be bypassed by assigning the admin consent in Azure to the App.
de: Die Anforderung der Administrator-Zustimmung kann umgangen werden, indem die Zustimmung zur App in Azure gewährt wird.
sr: Захтев за сагласност администратора може се заобићи тако што ћете апликацији доделити сагласност администратора у Azure панелу.

source: Home > App Registration > Manage > API Permission > Grant admin consent for "MSFT".
de: Home > App-Registrierung > Verwalten > API-Berechtigung > Administrator-Zustimmung für "MSFT“ gewähren.

source: Missing Permissions for the Azure User
de: Fehlende Berechtigungen für den Azure-Benutzer
sr: Недостајуће дозволе за Azure корисника

source: **Error message:** Can't use Channel:Driver::SMTPAuthentificationError:Net::SMTPAuthentificationError
de: **Fehlermeldung:** Can't use Channel:Driver::SMTPAuthentificationError:Net::SMTPAuthentificationError
sr: **Порука о грешци:** Can’t use Channel:Driver::SMTPAuthentificationError:Net::SMTPAuthentificationError

source: Error message in the M365 channel settings
de: Fehlermeldung in den M365-Einstellungen
sr: Порука о грешци у подешавањима М365 канала

source: or
de: oder
sr: или

source: Error message in the ticket
de: Fehlermeldung im Ticket
sr: Порука о грешци у тикету

source: This error occurs when the admin wants to create an email account in Zammad whose user does not have permission for SMTP authentication to the mail server. Please check the following two most common problems in this case.
de: Dieser Fehler tritt auf, wenn der Administrator in Zammad ein E-Mail-Konto erstellen möchte, dessen Benutzer keine Berechtigung zur SMTP-Authentifizierung auf dem Mailserver hat. Bitte überprüfen Sie in diesem Fall die beiden folgenden und häufigsten Probleme.
sr: Ова грешка се јавља када администратор жели да дода имејл налог у Zammad чији корисник нема дозволу за SMTP аутентификацију на имејл серверу. Проверите следећа два најчешћа проблема у овом случају.

source: Private Email Account
de: Privates E-Mail-Konto
sr: Приватни имејл налог

source: If it is a private email account, the admin must grant the SMTP authentication permission to the user of the inbox. The permission is provided at https://admin.microsoft.com.
de: Wenn es sich um ein privates E-Mail-Konto handelt, muss der Administrator dem Benutzer des Postfachs die SMTP-Authentifizierungsberechtigung erteilen. Die Berechtigung wird unter https://admin.microsoft.com erteilt.
sr: Ако се ради о приватном имејл налогу, администратор мора да додели дозволу за SMTP аутентификацију кориснику пријемног сандучета. Дозвола се даје преко https://admin.microsoft.com.

source: Add the SMTP authentication permission under Users > Active Users > click on the User > Email > Manage Email Apps.
de: Fügen Sie die SMTP-Authentifizierungsberechtigung unter Benutzer > Aktive Benutzer hinzu und klicken Sie auf Benutzer > E-Mail > E-Mail-Apps verwalten.
sr: Додајте дозволу за SMTP аутентификацију под Users > Active Users > кликните на корисника > Email > Manage Email Apps.

source: Shared Inbox
de: Geteilter Posteingang
sr: Дељено пријемно сандуче

source: If it is a shared inbox, you can try to enable the SMTP Authentication (``SmtpClientAuthenticationDisabled``) in the Azure shell. This isn't a Zammad problem, so we can only help to a limited extent here.
de: Wenn es sich um einen geteilten Posteingang handelt, können Sie versuchen, die SMTP-Authentifizierung ("SmtpClientAuthenticationDisabled“) in der Azure-Shell zu aktivieren. Dies ist kein Zammad-Problem, daher können wir hier nur bedingt helfen.
sr: Ако се ради о дељеном пријемном сандучету, можете покушати да омогућите SMTP аутентификацију (``SmtpClientAuthenticationDisabled``) у Azure конзоли. Ово није проблем до Zammad-а, тако да вам овде можемо помоћи само у ограниченој мери.

source: To enable the SMTP Authentication, use the following commands:
de: Um die SMTP-Authentifizierung zu aktivieren, verwenden Sie die folgenden Befehle:
sr: Да бисте омогућили SMTP аутентификацију, користите следеће команде:

source: If not installed::
de: Falls noch nicht installiert::
sr: Уколико није инсталирана::

source: Log in to Exchange using Powershell::
de: Melden Sie sich mit Powershell bei Exchange an::
sr: Пријавите се на Exchange користећи Powershell::

source: Switching on the SMTP authentication for a mailbox - also possible with a shared mailbox::
de: Einschalten der SMTP-Authentifizierung für ein Postfach – auch bei einem freigegebenen Postfach möglich::
sr: Укључивање SMTP аутентификације за поштанско сандуче - могуће и са дељеним сандучетом::

source: Retrieval of Email Failed
de: Abruf der E-Mail fehlgeschlagen
sr: Неуспешно добављање имејл порука

source: This can be caused by Microsoft Defender for Office 365 when Zammad fetches an email while its attachment is still being checked.
de: Dies kann durch Microsoft Defender für Office 365 verursacht werden, wenn Zammad eine E-Mail abruft, während ihr Anhang noch geprüft wird.
sr: Ово може бити изазвано од стране Microsoft Defender за Office 365 када Zammad добавља имејл поруку док се њени прилози још увек скенирају.

source: To avoid this, you should change the `Safe Attachments unknown malware response <https://learn.microsoft.com/en-us/defender-office-365/safe-attachments-about?view=o365-worldwide#safe-attachments-policy-settings>`_ from "Dynamic Delivery" to something else fitting your needs (e.g. "Block") for your Office 365 instance.
de: Um dies zu vermeiden, sollten Sie die "Einstellungen der Richtlinie für sichere Anhänge <https://learn.microsoft.com/de-de/defender-office-365/safe-attachments-about?view=o365-worldwide#safe-attachments-policy-settings>`_" für Ihre Office 365-Instanz ändern von "Dynamische Zustellung" auf etwas anderes, das für Sie passt (z.B. "Blockieren").
sr: Да бисте избегли ову ситуацију, измените `Safe Attachments сигурносну полису <https://learn.microsoft.com/en-us/defender-office-365/safe-attachments-about?view=o365-worldwide#safe-attachments-policy-settings>`_ из "Dynamic Delivery" на неко подешавање које вам одговара (нпр. "Block") у вашој Office 365 инстанци.

source: Authentication Unsuccessful
de: Authentifizierung fehlgeschlagen
sr: Неуспешна аутентификација

source: **Error message:** 535 5.7.3 Authentication unsuccessful
de: **Fehlermeldung:** 535 5.7.3 Authentication unsuccessful

source: This error message can have different reasons. See description below for one of them.
de: Diese Fehlermeldung kann verschiedene Ursachen haben. Eine davon sehen Sie folgend.
sr: Ова порука грешке може имати различите разлоге. Погледајте опис испод за неке од њих.

source: Microsoft allows sign-in and authentication using the primary email address. While this works for fetching emails, SMTP authentication may not work in this case.
de: Microsoft erlaubt die Anmeldung und Authentifizierung mit einer primären E-Mail Adresse. Während dies für das Abrufen von E-Mails funktioniert, funktioniert die SMTP-Authentifizierung in diesem Fall möglicherweise nicht.
sr: Microsoft дозвољава пријаву и аутентификацију коришћењем примарне имејл адресе. Иако ово функцонише за пријем порука, SMTP аутентификација можда неће радити.

source: Try to delete the MS account and recreate it using your username. In Zammad, manually change the email address to the username. Then you should be able to send and receive emails again.
de: Versuchen Sie, das MS Konto zu löschen und es mit Ihrem Benutzernamen neu zu erstellen. Ändern Sie in Zammad die E-Mail-Adresse manuell in den Benutzernamen. Anschließend sollten Sie wieder in der Lage sein, E-Mails zu senden und zu empfangen.
sr: Покушајте да обришете MS налог и поново га додате коришћењем вашег корисничког имена. У Zammad-у, ручно измените имејл адресу на корисничко име. Онда би требало да будете у могућности да поново шаљете и примате имејл поруке.

source: Connect a Microsoft 365 account (formerly "Office 365") via IMAP to Zammad.
de: Verbinden Sie ein Microsoft 365 Konto (früher "Office 365") über IMAP mit Zammad.
sr: Повежите Microsoft 365 налог (раније „Office 365“) преко IMAP са Zammad-ом.

source: SMS integration primarily lets you create tickets, add articles and respond to tickets via SMS. It is also possible to send notifications, e.g. to agents.
de: Mit der SMS-Integration können Sie Tickets erstellen, Artikel hinzufügen und auf Tickets per SMS antworten. Es ist auch möglich, Benachrichtigungen zu versenden, z.B. an Agenten.
sr: SMS интеграција вам првенствено омогућава да отварате тикете, додајете чланке и одговарате на тикете путем SMS-а. Такође је могуће слати обавештења, нпр. оператерима.

source: You can configure the SMS channel in the admin interface under *Channels > SMS*.
de: Sie können den SMS-Kanal in der Verwaltungsoberfläche unter *Kanäle > SMS* konfigurieren.
sr: Можете подесити SMS канал у интерфејсу администратора преко *Канали > SMS*.

source: MessageBird and Twilio are currently the only supported providers to process incoming messages.
de: MessageBird und Twilio sind derzeit die einzigen unterstützten Anbieter für die Verarbeitung eingehender Nachrichten.
sr: MessageBird и Twilio су тренутно једини подржани провајдери за долазне поруке.

source: Our configuration example below is based on Twilio.
de: Unser folgendes Konfigurationsbeispiel basiert auf Twilio.
sr: Наш пример конфигурације испод је заснован на Twilio.

source: This guide assumes you have a Twilio account with an assigned number which is capable of sending and receiving SMS.
de: In dieser Anleitung wird davon ausgegangen, dass Sie über ein Twilio-Konto mit einer zugewiesenen Nummer verfügen, über die Sie SMS senden und empfangen können.
sr: Овај водич подразумева да имате Twilio налог са додељеним бројем који може да шаље и прима SMS поруке.

source: Configure Twilio
de: Twilio konfigurieren
sr: Подесите Twilio

source: In the Zammad settings, go to *Channels > SMS* and click on the ``New`` button
de: Gehen Sie in den Zammad-Einstellungen auf *Kanäle > SMS* und klicken Sie auf die Schaltfläche ``Neu``
sr: У Zammad подешавањима, идите на *Канали > SMS* и кликните на дугме ``Додај``

source: After selecting Twilio as provider, you can find your webhook URL in the **Webhook** field. Copy the complete URL and switch back to the Twilio console.
de: Nachdem Sie Twilio als Anbieter ausgewählt haben, finden Sie Ihre Webhook-URL im Feld **Webhook**. Kopieren Sie die vollständige URL und wechseln Sie zurück zur Twilio-Konsole.
sr: По одабиру Twilio провајдера, можете наћи вашу URL адресу повратног позива у пољу **Повратни позив**. Ископирајте комплетну адресу и вратите се у Twilio конзолу.

source: Go to the `Twilio console <https://console.twilio.com>`_ and log in.
de: Rufen Sie die `Twilio-Konsole <https://console.twilio.com>`_ auf und melden Sie sich an.
sr: Идите на `Twilio конзолу <https://console.twilio.com>`_ и пријавите се.

source: Go to the configuration of your number you want to use with Zammad, switch to the **Configure** tab and scroll to **Messaging Configuration**.
de: Gehen Sie zur Konfiguration Ihrer Nummer, die Sie mit Zammad verwenden möchten, wechseln Sie zum Tab **Konfigurieren** und scrollen Sie zu **Messaging Configuration**.
sr: Идите на подешавања вашег броја који желите да користите у Zammad-у, пребаците се на **Configure** језичак и пронађите **Messaging Configuration**.
