Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: Screencast showing expert mode being enabled in trigger dialog
de: Screencast zeigt die Aktivierung des Expertenmodus im Trigger Dialog
sr: Снимак екрана који приказује стручни режим који је укључен у дијалогу окидача

source: Logic Block Conditions
de: Logikblock Bedingungen
sr: Услови логичког блока

source: In Zammad's expert mode, you can establish relationships between conditions using logical operators. These operators enable you to have one or several sets of conditions that have to match your requirement.
de: Im Expertenmodus von Zammad können Sie mithilfe von logischen Operatoren Beziehungen zwischen Bedingungen herstellen. Diese Operatoren ermöglichen es Ihnen, eine oder mehrere Gruppen von Bedingungen zu haben, die Ihren Anforderungen entsprechen.
sr: У Zammad-овом стручном режиму услова можете одредити однос између услова коришћењем логичких оператора. Ови оператори вам омогућавају да имате један или неколико скупова услова који морају да задовољавају ваше захтеве.

source: Match all (AND)
de: Mit allen übereinstimmen (UND)
sr: Конјункција (AND)

source: All conditions in this block will be matched with "AND". This requires all conditions to be met in order to be matched positive.
de: Alle Bedingungen in diesem Block werden mit "UND" verknüpft. Das bedeutet, dass alle Bedingungen erfüllt sein müssen, damit die Bedingung als erfüllt gilt.
sr: Сви услови у овом блоку ће бити повезани са операцијом „AND”. Ово захтева да буду испуњени сви услови да би се поклопило.

source: Match any (OR)
de: Mit beliebigem übereinstimmen (ODER)
sr: Дисјункција (OR)

source: Conditions in this block will be matched with "OR". This requires one or more conditions - but not all - to be met in order to be matched positive.
de: Alle Bedingungen in diesem Block werden mit "ODER" verknüpft. Das bedeutet, dass eine Bedingung erfüllt sein muss, damit der Block als erfüllt gilt.
sr: Услови у овом блоку ће бити повезани са операцијом „OR”. Ово захтева да буде испуњен бар један услов – али не сви – да би се подударало.

source: Match none (NOT)
de: Mit keinem übereinstimmen (NICHT)
sr: Негација (NOT)

source: All conditions in this block will be matched with "NOT". To be matched positive, no condition may match.
de: Alle Bedingungen in diesem Block werden mit "NICHT" verknüpft. Das bedeutet, dass keine Bedingung erfüllt sein darf, damit der Block als erfüllt gilt.
sr: Сви услови у овом блоку ће бити повезани са операцијом „NOT”. Да би се подударало, ниједан услов не сме бити задовољен.

source: See :ref:`evaluation order <evaluation-order>` to understand how Zammad evaluates triggers in expert mode.
de: Siehe :ref:`Prüfreihenfolge <evaluation-order>`, um zu verstehen, wie Zammad Trigger im Expertenmodus durchläuft.
sr: Погледајте :ref:`редослед процене <evaluation-order>` да бисте разумели како Zammad процењује окидаче у стручном режиму.

source: Adding Conditions and Logic Blocks
de: Hinzufügen von Bedingungen und Logikblöcken
sr: Додавање услова и логичких блокова

source: By using the |subclause| icon you can add new logic blocks. New blocks will be added below the object you're using the |subclause| icon on.
de: Mit dem Symbol |subclause| können Sie neue Logikblöcke hinzufügen. Neue Blöcke werden unterhalb des Objekts hinzugefügt, in dem Sie das |subclause|-Symbol geklickt habe.
sr: Коришћењем |subclause| можете додати нове логичке блокове. Нови блокови ће бити додати испод објекта за који користите иконицу |subclause|.

source: Icon for adding a new subclause block
de: Symbol für das Hinzufügen eines neuen untergeordneten Blocks
sr: Иконица за додавање новог блока подклаузуле

source: The level will be automatically set to a lower level than the object you're using it on.
de: Die Ebene wird automatisch eine niedrigere Ebene gesetzt als das Objekt, von dem Sie die Bedingung hinzufügen.
sr: Ниво ће аутоматски бити постављен на нижи ниво од објекта на коме га користите.

source: Screencast showing new logic blocks being added
de: Screencast mit neuen Logikblöcken, die hinzugefügt werden
sr: Снимак екрана који приказује додавање нових логичких блокова

source: The same behavior also applies to conditions *within* logic blocks!
de: Das gleiche Verhalten gilt auch für Bedingungen *innerhalb* von Logikblöcken!
sr: Исто понашање важи и за услове *унутар* логичких блокова!

source: Screencast showing new conditions being added to logic blocks
de: Screencast mit neuen Bedingungen, die zu Logikblöcken hinzugefügt werden
sr: Снимак екрана који приказује додавање нових услова логичким блоковима

source: Note that removing condition blocks removes **all blocks and conditions** with it!
de: Beachten Sie, dass beim Entfernen von Bedingungsblöcken **alle Blöcke und Bedingungen** mit entfernt werden!
sr: Имајте на уму да уклањање блокова услова уклања **све блокове и услове** са њима!

source: Re-arranging Conditions and Logic Blocks
de: Bedingungen und Logikblöcke neu anordnen
sr: Прерасподела услова и логичких блокова

source: Use the ≡ handle to drag conditions or logic blocks and drop them to the desired position. Moving logic blocks will also move any condition and, if applicable, logic blocks that are below it.
de: Ziehen Sie Bedingungen oder Logikblöcke mit der ≡-Schaltfläche an die gewünschte Position und lassen Sie sie dort los. Das Verschieben von Logikblöcken verschiebt auch alle Bedingungen und ggf. untergeordnete Logikblöcke.
sr: Користите ручицу ≡ за померање услова или логичких блокова и поставите их на жељено место. Померање логичких блокова ће такође померити било који услов и, ако постоје, логичке блокове који су испод њега.

source: While you can adjust the order of conditions without any further logic blocks, this won't have any consequences.
de: Sie können die Reihenfolge der Bedingungen ohne weitere Logikblöcke ändern, aber das hat keine Auswirkungen.
sr: Иако можете да прилагодите редослед услова без додатних логичких блокова, то неће имати икаквог ефекта.

source: Screencast showing dragging and dropping conditions
de: Screencast zum Ziehen und Ablegen von Bedingungen
sr: Снимак екрана који приказује превлачење и испуштање услова

source: Evaluation Order
de: Prüfreihenfolge
sr: Редослед процене

source: Here's a fairly complex diagram on how Zammad evaluates conditions and their blocks.
de: Im Folgenden sehen Sie ein ziemlich komplexes Diagramm, das zeigt, wie Zammad die Bedingungen und ihre Blöcke auswertet.
sr: Ево прилично сложеног дијаграма о томе како Zammad процењује услове и њихове блокове.

source: In many places in Zammad you can use conditions based on attribute checks to filter tickets and perform actions.
de: An vielen Stellen in Zammad können Sie Bedingungen auf der Grundlage von Attributprüfungen verwenden, um Tickets zu filtern und Aktionen durchzuführen.
sr: На много места у Zammad-у можете користити услове на основу провере атрибута за филтрирање тикета и извршавање радњи.

source: Please note that the availability of the different attributes and special fields depend on the feature you are using and the object context.
de: Bitte beachten Sie, dass die Verfügbarkeit der verschiedenen Attribute und Spezialfeldern von der Funktion, die Sie verwenden, und dem Objektkontext abhängt.
sr: Обратите пажњу да доступност различитих атрибута и посебних поља зависи од функције коју користите и контекста објекта.

source: This guide is split into two sections:
de: Diese Dokumentation ist in zwei Abschnitte unterteilt:
sr: Овај водич је подељен на два одељка:

source: Learn how Zammad's conditions work to adapt to your environment.
de: Erfahren Sie, wie die Bedingungen von Zammad funktionieren, um sie an Ihre Umgebung anzupassen.
sr: Научите како Zammad-ови услови функционишу да би се прилагодили вашем окружењу.

source: Learn how Zammad's expert mode for conditions allows you to create even more powerful conditions with AND/OR relations.
de: Erfahren Sie, wie Sie mit dem Expertenmodus von Zammad noch leistungsfähigere Bedingungen mit UND/ODER-Beziehungen erstellen können.
sr: Сазнајте како вам Zammad-ов стручни режим за услове омогућава да дефинишете још моћније услове са AND/OR клаузулама.

source: Variables
de: Variablen
sr: Променљиве

source: Use variables in text modules, triggers and many other places in Zammad to dynamically reflect information from object attributes.
de: Verwenden Sie Variablen in Textbausteinen, Triggern und vielen anderen Stellen in Zammad, um Informationen aus Objektattributen dynamisch auszugeben.
sr: Користите променљиве у текстуалним исечцима, окидачима и многим другим местима у Zammad-у за повлачење динамичких информација атрибута објекта.

source: Please note that this is just an overview of available variables. It might be incomplete or variables might not be available within some functions. If you're missing variables or are not sure if something is not working as expected, feel free to ask over at the `community <https://community.zammad.org>`_.
de: Bitte beachten Sie, dass dies nur eine Übersicht der verfügbaren Variablen ist. Manche Variablen können in bestimmten Funktionen inkompatibel oder nicht verfügbar sein. Wenn Sie Variablen vermissen oder sich nicht sicher sind, ob diese wie erwartet funktionieren, fragen Sie sehr gern in unserer `Community <https://community.zammad.org>`_ nach.
sr: ОБратите пажњу да је ово само преглед доступних променљивих. Може бити некомплетан или променљиве можда нису доступне унутар неких функција. Ако вам зафале променљиве или нисте сигурни да ли раде на очекиван начин, слободно питајте на `форуму заједнице <https://community.zammad.org>`_.

source: Basic Usage
de: Grundlagen
sr: Основна употреба

source: Variables can be called by typing ``::`` (just like text modules in the frontend), as long as you're in a supported text field in the settings. Zammad will display all variables being available within this context and add the variable to your text as soon as you selected an entry. You can even search for and use variables for custom object attributes.
de: Variablen können durch Eingabe von ``::`` aufgerufen werden (genau wie Textbausteine im Editor), solange Sie sich in einem unterstützten Textfeld in den Einstellungen befinden. Zammad zeigt alle Variablen an, die in diesem Kontext verfügbar sind, und fügt die Variable zu Ihrem Text hinzu, sobald Sie einen Eintrag ausgewählt haben. Sie können sogar nach Variablen für benutzerdefinierte Objektattribute suchen und diese verwenden.
sr: Променљиве могу бити излистане уносом ``::`` (баш као и текстуални исечци у корисничком интерфејсу), све док сте у оквиру подржаног поља подешавања. Zammad ће приказати све доступне променљиве у овом контексту и додати у текст чим их одаберете. Можете чак претражити за и користити променљиве прилагођених атрибута објекта.

source: After selecting a variable, it is displayed in a structure like this: ``#{object.attribute}``
de: Nach der Auswahl einer Variablen wird diese in einer Struktur wie dieser angezeigt: ``#{Objekt.Attribut}``
sr: По одабиру променљиве, биђе приказана структура налик на: ``#{object.attribute}``

source: You have an empty field which you referenced and it appears as ``-``? That's currently working as designed - you might want to ensure that these fields always have a value.
de: Haben Sie ein leeres Feld, auf das Sie verweisen, und es erscheint als ``-``? Das funktioniert derzeit wie vorgesehen - Sie sollten sicherstellen, dass diese Felder immer einen Wert beinhalten.
sr: Референцирате на празно поље и приказује се као ``-``? Ово је очекивано понашање – пробајте да обезбедите да ова поља увек имају вредност.

source: Variable Categories
de: Variablen Kategorien
sr: Категорије променљивих

source: Structure
de: Struktur
sr: Структура

source: The first part of the variable name consist of the object type, e.g. ``ticket``, ``config``, ``user``.
de: Der erste Teil des Variablennamens besteht aus dem Objekttyp, z.B. ``ticket``, ``config``, ``user``.
sr: Први део назива променљиве садржи врсту објекта, нпр. ``ticket``, ``config``, ``user``.

source: The second part is the name of the attribute. For custom object attributes, this is the name you defined for the attribute and can be found in the object attribute menu at any time. The first and second part of a variable is divided by a point, e.g.: ``ticket.number`` which will in total be ``#{ticket.number}``.
de: Der zweite Teil ist der Name des Attributs. Bei benutzerdefinierten Objektattributen ist dies der Name, den Sie für das Attribut definiert haben und der jederzeit im Menü Objektattribut zu finden ist. Der erste und zweite Teil einer Variablen wird durch einen Punkt geteilt, z.B.: ``ticket.number``, was am Ende in ``#{ticket.number}`` resultiert.
sr: Други део је назив атрибута. За прилагођене атрибуте објкета, ово је назив који одређујете за атрибут и можете га пронађи унутар панела атрибута. Први и други део променљиве су одвојени тачком, нпр.: ``ticket.number`` што на крају резултује у ``#{ticket.number}``.

source: In some situations it might be needed to use a third part. The best example for such a situation is a **select** or **tree-select** field which will return the key value by default, not it's display name. For this, just extend your variable with ``.value``. This will result in ``#{ticket.select.value}``.
de: In manchen Situationen kann es erforderlich sein, einen dritten Teil zu verwenden. Das beste Beispiel für eine solche Situation ist ein **Auswahl**- oder **Baumauswahl**-Feld, das standardmäßig den Schlüsselwert zurückgibt, nicht seinen Anzeigenamen. Erweitern Sie dazu einfach Ihre Variable mit ``.value``. Das Ergebnis ist dann ``#{ticket.select.value}``.
sr: У неким ситуацијама, можда ће вам бити неопходан и трећи део. Најбољи пример за ову ситацију је ``select`` или ``tree-select`` поље које подразумевано враћа вредност кључа, а не назив за приказ. Да бисте приступили овој вредности, само продужите вашу променљиву са ``.value``. Ово ће резултовати у ``#{ticket.select.value}``.

source: Using Translated Variables
de: Verwendung übersetzter Variablen
sr: Коришћење преведених променљивих

source: If you want to use a translated variable in triggers or schedulers, you can extend the placeholder like this: ``#{t(ticket.state.name)}``. The ``t`` tells Zammad to search for fitting translated strings. The used output language is based on the system language of Zammad which you can set in the admin panel under :doc:`/settings/branding` or based on the selected locale in the trigger/scheduler edit dialog.
de: Wenn Sie eine übersetzte Variable in Triggern oder Automatisierungen verwenden möchten, können Sie den Platzhalter wie folgt erweitern: ``#{t(ticket.status.name)}``. Das ``t`` sagt Zammad, dass es nach passenden übersetzten Zeichenketten suchen soll. Die verwendete Ausgabesprache basiert auf der Systemsprache von Zammad, die Sie im Admin-Panel unter :doc:`/settings/branding` einstellen können oder basierend auf der ausgewählten Sprache im Trigger-/Automatisierungs-Dialog.
sr: Ако желите да користите преведене променљиве у окидачима или планеерима, можете проширити поље променљиве на следећи начин: ``#{t(ticket.state.name)}``. Функција ``t`` ће потражити међу одговарајућим преводима. Циљни језик је базиран на основу системског језика Zammad-а који можете подесити у панелу администратора под :doc:`брендингом </settings/branding>` или на основу одабраног језика у дијалогу окидача/планера.

source: A possible use-case: you want to send your customers updates on tickets via trigger or scheduler which should include the state of the ticket. Using the default ``#{ticket.state.name}`` (without the translation flag ``t()``) would lead to the output of the original (english) name of the state.
de: Ein möglicher Anwendungsfall: Sie möchten Ihren Kunden per Trigger oder Scheduler Updates zu Tickets schicken, die den Status des Tickets enthalten sollen. Die Verwendung des Standardwertes ``#{ticket.state.name}`` (ohne das Übersetzungsflag ``t()``) würde zur Ausgabe des ursprünglichen (englischen) Namens des Status führen.
sr: Могући случај употребе: ако желите да пошаљете својим клијентима обавештења о тикетима путем окидача или планера која укључују и стање тикета. Коришћење подразумеване променљиве `#{ticket.state.name}`` (без функције превода ``t()``) ће резултовати у вредности назива стања на оригиналном (енглеском) језику.

source: Date and Time Formatting
de: Formatierung von Datum und Uhrzeit
sr: Форматирање датума и времена

source: The system (trigger/scheduler selected) locale and timezone predefines a default format of date and timestamp. This format is customizable by using the ``dt()`` method.
de: Die Sprache und Zeitzone des Systems (oder in Trigger/Automatisierung ausgewählt) gibt ein Standardformat für Datum und Zeitstempel vor. Dieses Format kann mit Hilfe der Methode ``dt()`` angepasst werden.
sr: Језик и временска зона система одређују подразумевани формат датума и времена. Овај формат може бити прилагођен коришћењем ``dt()``функције.

source: The method arguments are as follows:
de: Die Argumente der Methode lauten wie folgt:
sr: Параметри функције су следећи:

source: The date or timestamp variable you want to format.
de: Die Datums- oder Zeitstempelvariable, die Sie formatieren möchten.
sr: Променљива датума или временске ознаке коју желите да форматирате.

source: The output format string.
de: Die Zeichenkette für das Ausgabeformat.
sr: Формаз излазног низа текста.

source: The timezone to apply (optional).
de: Die zu verwendende Zeitzone (optional).
sr: Временска зона за примену (необавезно).

source: **Example:**
de: **Beispiel:**
sr: **Пример:**

source: ``#{dt(ticket.updated_at, "%A %Y-%m-%d %H:%M in the office", "Europe/Berlin")}``
de: ``#{dt(ticket.updated_at, "%A %Y-%m-%d %H:%M im Büro", "Europa/Berlin")}``
sr: ``#{dt(ticket.updated_at, "%A %Y-%m-%d %H:%M у канцеларији", "Europe/Berlin")}``

source: Monday, 2024-03-18 15:31 in the office
de: Montag, 2024-03-18 15:31 im Büro
sr: Понедељак, 2024-03-18 15:31 у канцеларији

source: If you want to use our example, make sure to paste the string above without formatting (:kbd:`CTRL` :kbd:`Shift` :kbd:`v`), otherwise it won't work.
de: Wenn Sie unser Beispiel verwenden wollen, fügen Sie die obige Zeichenkette ohne Formatierung (:kbd:`CTRL` :kbd:`Shift` :kbd:`v`) ein, sonst funktioniert es nicht.
sr: Уколико желите да користите наш пример, обавезно налепите текст изнад без формата (:kbd:`CTRL` :kbd:`Shift` :kbd:`v`), у супротном неће успети.

source: The following table lists available format directives:
de: In der folgenden Tabelle sind die verfügbaren Formatparameter aufgeführt:
sr: Следећа табела приказује доступне директиве формата:

source: Year with 4 digits
de: Jahr mit 4 Ziffern
sr: Година са 4 цифре

source: Use ``%y`` for year with 2 digits
de: Verwenden Sie ``%y`` für Jahreszahlen mit 2 Ziffern
sr: Користите ``%y`` за годину са 2 цифре

source: Month of year (as number with zero-padding)
de: Monat des Jahres (als Zahl, ggf. mit vorangestellter Null)
sr: Месец године (као број са допуном нула)

source: Use ``%-m`` for month without zero-padding
de: Verwenden Sie ``%-m`` für den Monat ohne vorangestellte Null
sr: Користите ``%-m`` за месец без допуне нула

source: Day of month (as number with zero-padding)
de: Tag des Monats (als Zahl, ggf. mit vorangestellter Null)
sr: Дан месеца (као број са допуном нула)

source: Use ``%e`` for day without zero-padding
de: Verwenden Sie ``%e`` für Tage ohne vorangestellte Null
sr: Користите ``%e`` за дан без допуне нула

source: Hour of day in 24h notation with zero-padding
de: Stunde des Tages in 24-Stunden-Schreibweise, ggf. mit vorangestellter Null
sr: Час дана у 24-часовном формату са допуном нула

source: Use ``%k`` for hour without zero-padding
de: Verwenden Sie ``%k`` für Stunden ohne führende Null
sr: Користите ``%k`` за час без допуне нула

source: Hour of day in 12h notation with zero-padding
de: Uhrzeit im 12-Stunden-Format, ggf. mit vorangestellter Null
sr: Час дана у 12-часовном формату са допуном нула

source: Use ``%l`` for hour without zero-padding and ``%p`` / ``%P`` for meridian indicator
de: Verwenden Sie ``%l`` für die Stunde ohne vorangestellte Null und ``%p`` / ``%P`` für den Tageszeit-Indikator
sr: Користите ``%l`` за час без допуне нула и ``%p`` / ``%P`` за индикатор меридијана

source: Minute of hour
de: Minute der Stunde
sr: Минут часа

source: Second of Minute
de: Sekunde der Minute
sr: Секунда минута

source: Weekday name
de: Name des Wochentags
sr: Назив дана у недељи

source: Use ``%a`` for abbreviated name or ``%^A`` for uppercase name
de: Verwenden Sie ``%a`` für abgekürzte Namen oder ``%^A`` für den Name in Großbuchstaben
sr: Користите ``%a`` за скраћеницу или ``%^A`` за велика слова

source: Month name
de: Name des Monats
sr: Назив месеца

source: Use ``%b`` for abbreviated name
de: Verwenden Sie ``%b`` für den abgekürzte Namen
sr: Користите ``%b`` за скраћеницу

source: Week number of current year
de: Wochennummer des laufenden Jahres
sr: Број недеље у текућој години

source: Use ``%W`` for a different calculation method
de: Verwenden Sie ``%W`` für eine andere Berechnungsmethode
sr: Користите ``%W`` за другачији обрачун

source: We support the known format directives for the Ruby built-in method ``strftime`` of the ``DateTime`` class. For more information, see `here <https://apidock.com/ruby/DateTime/strftime>`_.
de: Wir unterstützen die bekannten Formatparameter für die in Ruby eingebaute Methode ``strftime`` der Klasse ``DateTime``. Für weitere Informationen siehe `hier <https://apidock.com/ruby/DateTime/strftime>`_.
sr: Подржане су све директиве Ruby метода ``strftime`` из DateTime`` класе. За више информације, погледајте `овде <https://apidock.com/ruby/DateTime/strftime>`_.

source: Articles
de: Artikel
sr: Чланци

source: If you're missing variables or are not sure if something is not working as expected, feel free to ask over at the `community <https://community.zammad.org>`_.
de: Wenn Sie Variablen vermissen oder sich nicht sicher sind, ob diese wie erwartet funktionieren, fragen Sie gern in unserer `Community <https://community.zammad.org>`_ nach.
sr: Ако вам недостају променљиве или нисте сигурни да ли нешто функционише на очелован начин, слободно питајте у `форуму заједнице <https://community.zammad.org>`_.

source: Below you can find all available ticket article-based variables within Zammad. These can be called via triggers for example. If you're unsure if Zammad does support variables at the point you're at, you can try to type ``::`` to check.
de: Nachfolgend finden Sie alle verfügbaren Ticketartikel-basierten Variablen in Zammad. Diese können z.B. über Trigger aufgerufen werden. Wenn Sie sich nicht sicher sind, ob Zammad an der von Ihnen gewünschten Stelle Variablen unterstützt, können Sie das prüfen indem Sie ``::`` einzugeben.
sr: Испод можете пронажи све доступне променљиве чланака тикета у оквиру Zammad-а. Могу се користити унутар нпр. окидача. Ако нисте сигурни да ли Zammad подржава променљиве у делу у коме се налазите, пробајте да откуцате ``::``да бисте проверили.

source: The below list gives you an example what kind of data you can expect, it's not intended to explain the data itself.
de: Die folgende Liste gibt Ihnen ein Beispiel dafür, welche Art von Daten Sie erwarten können. Sie ist nicht dazu gedacht, die Daten selbst zu erklären.
sr: Листа испод вам пружа пример какав тип података можете очекивати, није јој циљ да објасни саме податке.

source: Article Variables
de: Artikel-Variablen
sr: Променљиве чланка

source: example
de: Beispiel
sr: пример

source: Article > Cc
de: Artikel > CC
sr: Чланак > Cc

source: ``jdoe@example.com, company@example.com``
de: ``jdoe@example.com, firma@example.com``

source: Article > Created by > Address
de: Artikel > Erstellt von > Adresse
sr: Чланак > Додато од стране > Адреса
