Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: A customer's inbox with an auto-reply from **Chrispresso Sales**.
de: Der Posteingang eines Kunden mit einer automatischen Antwort von **Chrispresso Sales**.
sr: Пријемно сандуче клијента са аутоматским одговором од **Chrispresso Sales**.

source: If you add :doc:`multiple addresses <secondary-addresses>` to a single account, you can define a separate Organization & Department Name for each one.
de: Wenn Sie :doc:`mehrere Adressen <Sekundäradressen>` zu einem einzigen Konto hinzufügen, können Sie für jede Adresse einen eigenen Organisations- und Abteilungsnamen festlegen.
sr: Ако додате :doc:`више адреса <secondary-addresses>` на један налог, можете дефинисати посебну организацију и назив одељења за сваку од њих.

source: Email display names value can be :ref:`further customized in the Settings tab <email-settings-sender-format>`.
de: Die E-Mail-Anzeigenamen können :ref:`hier <email-settings-sender-format>` weiter angepasst werden.
sr: Вредност приказаних назива имејла може се :ref:`даље прилагодити у језичку Подешавања <email-settings-sender-format>`.

source: Your email address.
de: Ihre Email-Adresse.
sr: Ваша имејл адреса.

source: If your account login/username is different from your email address, use the *Experts* dialog (see below).
de: Wenn Ihr Konto-Login/Benutzername nicht mit Ihrer E-Mail-Adresse übereinstimmt, verwenden Sie den Dialog *Experten* (siehe unten).
sr: Ако се ваш налог/корисничко име разликује од ваше имејл адресе, користите дијалог *Стручњаци* (погледајте испод).

source: If your inbox receives mail for more than one email address, be sure to :doc:`add your alternate addresses <secondary-addresses>` after account setup.
de: Wenn Ihr Posteingang E-Mails für mehr als eine E-Mail-Adresse empfängt, müssen Sie nach der Einrichtung des Kontos die alternativen Adressen <Zweitadressen> hinzufügen.
sr: Ако ваше пријемно сандуче прима пошту за више од једне имејл адресе, обавезно :doc:`додајте своје алтернативне адресе <secondary-addresses>` након подешавања налога.

source: Password
de: Passwort
sr: Лозинка

source: Your account password.
de: Ihr Konto-Passwort.
sr: Лозинка вашег налога.

source: Destination group
de: Zielgruppe
sr: Одредишна група

source: The :doc:`group </manage/groups/index>` that incoming emails will be assigned to.
de: Die :doc:`Gruppe </manage/groups/index>`, der eingehende E-Mails zugeordnet werden.
sr: :doc:`Група </manage/groups/index>` којој ће бити додељена долазна пошта.

source: Use :doc:`filters </channels/email/filters>` for more fine-grained sorting of incoming email.
de: Verwenden Sie :doc:`Filter </channels/email/filters>` für eine feinere Sortierung der eingehenden E-Mails.
sr: Користите :doc:`филтере </channels/email/filters>` за прецизније сортирање долазне поште.

source: Destination group > Sending email address
de: E-Mail-Versandadresse der Zielgruppe
sr: Одредишна група > Имејл адреса за слање

source: Decide if the email address should be assigned to the selected group for outgoing emails.
de: Legen Sie fest, ob die E-Mail-Adresse der ausgewählten Gruppe für ausgehende E-Mails zugewiesen werden soll.
sr: Одлучите да ли ће имејл адреса бити додељена одабраној групи за одлазну пошту.

source: **Change to channel email address** will add this email address to the group for outgoing emails. This may overwrite an already assigned email address.
de: Durch **Zur E-Mail-Adresse des Kanals wechseln** wird diese E-Mail-Adresse der Gruppe für ausgehende E-Mails hinzugefügt. Dies kann eine bereits zugewiesene E-Mail-Adresse überschreiben.
sr: **Измени на имејл адресу канала** ће поставити ову имејл адресу групе за одлазну пошту.

source: **Do not change email address** doesn't assign an email address to the group or change it. If the group has no assigned email address, it stays empty. If the group already has an assigned email address, it will stay the same.
de: **E-Mail-Adresse nicht ändern** weist der Gruppe keine E-Mail-Adresse zu und ändert sie nicht. Wenn die Gruppe keine zugewiesene E-Mail-Adresse hat, bleibt sie leer. Wenn der Gruppe bereits eine E-Mail-Adresse zugewiesen wurde, bleibt diese unverändert.
sr: **Без измене имејл адресе** ће прескочити доделу имејл адресе групи и неће је променити. Уколико група нема додељену имејл адресу, остаће празна. Уколико група већ има додељену имејл адресу, остаће иста.

source: Experts
de: Experten
sr: Стручњаци

source: If Zammad can't figure out how to connect your account (or if you just want to access advanced settings), use the *Experts* dialog.
de: Falls Zammad nicht herausfindet, wie Sie Ihr Konto verbinden können (oder wenn Sie nur auf erweiterte Einstellungen zugreifen möchten), verwenden Sie das Dialogfeld *Experten*.
sr: Ако Zammad не може да закључи како да повеже ваш налог (или ако желите да приступите напредним подешавањима), користите дијалог *Стручњаци*.

source: When auto-detection fails, you will be presented with the "Experts" account setup dialog.
de: Wenn die automatische Erkennung fehlschlägt, wird der Dialog "Experten" angezeigt Dialog zur Einrichtung des Kontos.
sr: Ако аутоматско откривање не успе, биће вам представљен дијалог „Стручњаци“ за подешавање налога.

source: Expert configuration dialog
de: Experten-Konfigurationsdialog
sr: Дијалог за стручно подешавање

source: Email Inbound
de: Eingehende E-Mail
sr: Долазни имејл

source: Type
de: Typ
sr: Тип

source: Choose from **IMAP** and **POP3**.
de: Wählen Sie zwischen **IMAP** und **POP3**.
sr: Избор између **IMAP** и **POP3**.

source: In most cases, you want IMAP. (With POP3, you won't be able to :ref:`keep messages on the server <email-experts-keep-messages-on-server>` or :ref:`specify which folder to fetch from <email-experts-folder>`.)
de: In den meisten Fällen werden Sie vermutlich IMAP verwenden. (Bei POP3 können Sie weder :ref:`Nachrichten auf dem Server aufbewahren <email-experts-keep-messages-on-server>` noch :ref:`festlegen, aus welchem Ordner abgerufen werden soll <email-experts-folder>`.)
sr: У већини случајева желите IMAP. (Са POP3, нећете моћи да :ref:`задржите поруке на серверу <email-experts-keep-messages-on-server>` или :ref:`наведете из ког фолдера да преузимате поруке <email-experts-folder>`.)

source: Your email server's hostname or IP address (e.g. ``imap.gmail.com``).
de: Der Hostname oder die IP-Adresse Ihres E-Mail-Servers (z.B. ``imap.gmail.com``).
sr: Назив хоста вашег имејл сервера или IP адреса (нпр. ``imap.gmail.com``).

source: Contact your email provider or system administrator if you don't know.
de: Wenden Sie sich an Ihren E-Mail-Anbieter oder Systemadministrator, wenn Sie es nicht wissen.
sr: Обратите се свом имејл провајдеру или администратору система ако га не знате.

source: User
de: Benutzer
sr: Корисник

source: This field is being pre-filled with your email address in case you've provided one before opening the expert settings.
de: Dieses Feld wird mit Ihrer E-Mail-Adresse vorausgefüllt, falls Sie eine angegeben haben, bevor Sie die Experteneinstellungen öffnen.
sr: Ово поље се унапред попуњава вашом имејл адресом у случају да сте је навели пре отварања стручних подешавања.

source: Adjust this setting in case your username and email address differ.
de: Passen Sie diese Einstellung an, falls Ihr Benutzername und Ihre E-Mail-Adresse voneinander abweichen.
sr: Измените ово подешавање у случају да се ваше корисничко име и имејл адреса разликују.

source: Enable encryption when fetching messages.
de: Aktivieren Sie die Verschlüsselung beim Abrufen von Nachrichten.
sr: Омогућите шифровање приликом преузимања порука.

source: You can choose from the following options:
de: Sie können zwischen den folgenden Optionen wählen:
sr: Можете бирати између следећих опција:

source: No SSL (*not recommended!*)
de: Kein SSL (*nicht empfohlen!*)
sr: Без SSL (*није препоручљиво*)

source: SSL verification
de: SSL-Verifizierung
sr: SSL провера

source: Here you can decide if the certificate of the email server has to be verified or not (default: ``yes``). In case you are using custom certificates, please have a look at :doc:`how to add them to Zammad </settings/security/ssl-certificates>`.
de: Hier können Sie festlegen, ob das Zertifikat des E-Mail-Servers überprüft werden soll oder nicht (Standard: ``Ja``). Falls Sie eigene Zertifikate verwenden, schauen Sie bitte zunächst den Bereich :doc:`/settings/security/ssl-certificates` an.
sr: Овде можете одлучити да ли ће сертификат имејл сервера бити проверен или не (подразумевано: ``да``). У случају да користите прилагођене серфикате, молимо погледајте :doc:`како да их додате у Zammad </settings/security/ssl-certificates>`.

source: Please be aware that **turning off SSL verification is a security risk**. It should only be used temporarily or for testing purposes. If turned off, there is no verification of the certificate, which means that any presented certificate will be accepted.
de: Bitte beachten Sie, dass **das Deaktivieren der SSL-Verifizierung ein Sicherheitsrisiko darstellt**. Es sollte nur vorübergehend oder zu Testzwecken verwendet werden. Wenn diese Option deaktiviert ist, findet keine Überprüfung des Zertifikats statt, was bedeutet, dass jedes vorgelegte Zertifikat akzeptiert wird.
sr: Имајте на уму да **искључивање SSL провере носи безбедносни ризик**. Требало би је искључити само привремено или ради тестирања. Уколико је искључена, сертификати неће бити верификовани, што значи да ће било који достављени сертификат бити признат.

source: Your email server's port (usually ``993`` for IMAP, or ``995`` for POP3).
de: Der Port Ihres E-Mail-Servers (typischerweise ``993`` für IMAP, oder ``995`` für POP3).
sr: Порт вашег имејл сервера (обично ``993`` за IMAP, или ``995`` за POP3).

source: Folder
de: Ordner
sr: Фолдер

source: Specify which folder to fetch from, or leave empty to fetch from ``INBOX``.
de: Geben Sie an, aus welchem Ordner geholt werden soll, oder lassen Sie ihn leer, um aus ``INBOX`` zu holen.
sr: Одредите из ког фолдера желите да преузимате, или оставите празно за преузимање из ``INBOX``.

source: If specifying a nested folder, be sure to use the full path. (Some systems use different **path separators**; *e.g.,* ``Inquiries/Tech-Support`` vs. ``Inquiries.Tech-Support``. Contact your email provider or system administrator if you don't know.)
de: Wenn Sie einen verschachtelten Ordner angeben, achten Sie darauf, dass Sie den vollständigen Pfad verwenden. (Einige Systeme verwenden unterschiedliche **Pfad-Trennzeichen**; *z.B.* ``Anfragen/Tech-Support`` vs. ``Anfragen.Tech-Support``. Wenden Sie sich an Ihren E-Mail-Anbieter oder Systemadministrator, wenn Sie das nicht wissen.)
sr: Ако одређујете угнежђени фолдер, молимо користите пуну путању. (Неки системи користе различите **сепараторе путање**; *нпр.* ``Inquiries/Tech-Support`` наспрам ``Inquiries.Tech-Support``. Питајте вашег имејл провајдера или систем администратора ако нисте сигурни.)

source: If you selected a folder, additional steps may be required: In the last step of the account setup process, Zammad sends you an email from your own account, then waits for it to appear in the folder specified here. **Account verification will not complete until this test message has been received.**
de: Wenn Sie einen Ordner ausgewählt haben, sind möglicherweise weitere Schritte erforderlich: Im letzten Schritt der Einrichtung Ihres Kontos sendet Zammad Ihnen eine E-Mail von Ihrem eigenen Konto und wartet dann darauf, dass sie in dem hier angegebenen Ordner erscheint. **Die Verifizierung des Kontos wird erst nach Erhalt dieser Testnachricht abgeschlossen.**
sr: Уколико одаберете фолдер, биће неопходно још акција: у последњем кораку процеса подешавања налога, Zammad шаље имејл поруку путем вашег налога, а затим чека да се иста појави у фолдеру који је овде наведен. **Верификација налога није комплетна док се не детектује ова пробна порука.**

source: If this folder does not receive incoming messages automatically, you may have to manually check your inbox during the verification step and move Zammad's test message there when it arrives.
de: Wenn in diesem Ordner keine eingehenden E-Mails landen, prüfen Sie bitte manuell den Posteingang und verschieben die E-Mail in den Unterordner, sobald sie ankommt.
sr: Ако овај фолдер не прима долазне поруке аутоматски, можда ћете морати да ручно проверите ваше сандуче током корака верификације и преместите Zammad тест поруку тамо чим буде примљена.

source: Keep messages on server
de: Nachrichten auf Server belassen
sr: Чувај поруке на серверу

source: Specify what happens to your emails after Zammad imports them:
de: Spezifizieren Sie, was mit den Emails nach Zammads Import passieren soll:
sr: Одредите шта се дешава са вашим имејловима након што их Zammad увезе:

source: ``no``: Zammad deletes all imported messages
de: ``nein``: Zammad löscht alle importierten Nachrichten
sr: ``не``: Zammad брише све увезене поруке

source: ``yes``: Zammad marks imported messages as read. With this option, Zammad will only import unread messages. This means Zammad may miss messages if the mailbox is externally modified.
de: ``Ja``: Zammad markiert importierte Nachrichten als gelesen. Mit dieser Option wird Zammad nur ungelesene Nachrichten importieren. Das bedeutet, dass Zammad Nachrichten übersehen kann, wenn das Postfach bzw. Mails darin von extern verändert werden.
sr: ``да``: Zammad означава све увежене поруке као прочитане. Са овом опцијом, Zammad ће увести само непрочитане поруке. То значи да Zammad може пропустити поруке ако је поштанско сандуче измењено споља.

source: **Why does Zammad delete messages by default?**
de: **Warum löscht Zammad standardmäßig Nachrichten?**
sr: **Зашто Zammad подразумевано брише поруке?**

source: If you never clean up your inbox, you reach a storage limit some day and your mail server will start **rejecting incoming messages**.
de: Wenn Sie Ihren Posteingang nie bereinigen, laufen Sie irgendwann in ein Speicherlimit und Ihr Mailserver beginnt, **eingehende Nachrichten abzulehnen**.
sr: Ако никада не чистите ваше сандуче, и достигнете свој лимит складиштења, једног дана ваш имејл сервер ће почети да **одбија долазне поруке**.

source: If you choose **yes** here, remember that it's your responsibility to clean out your inbox from time to time to keep it below its storage limit.
de: Wenn Sie hier **Ja** auswählen, denken Sie bitte daran, Ihren Posteingang gelegentlich zu bereinigen. Andernfalls laufen Sie Gefahr, Speicherplatz-Probleme zu bekommen.
sr: Ако одаберете **да** овде, запамтите да је ваша одговорност да чистите ваше сандуче са времена на време да бисте га држали испод лимита складиштења.

source: Archive Mode
de: Archiv-Modus
sr: Архивски режим

source: Archive Mode dialog during email account setup
de: Dialogfeld "Archivmodus" bei der Einrichtung eines E-Mail Kontos
sr: Дијалог архивског режима током подешавања имејл налога

source: How should old emails be imported?
de: Wie sollen alte Emails importiert werden?
sr: На који начин увести старе имејл поруке?

source: During the process of setting up an email based channel, Zammad checks if emails are present in the inbox. If Zammad detects at least one email, the archive mode dialog is triggered and the archive mode is turned on by default. This dialog is also present if you edit an existing email based channel. The archive mode lets you:
de: Bei der Einrichtung eines E-Mail-basierten Kanals prüft Zammad, ob E-Mails im Posteingang vorhanden sind. Wenn Zammad mindestens eine E-Mail findet, wird das Dialogfeld für den Archivierungsmodus getriggert und der Archivierungsmodus ist standardmäßig aktiviert. Dieser Dialog wird auch angezeigt, wenn Sie einen bestehenden E-Mail-basierten Kanal bearbeiten. Mit dem Archivierungsmodus können Sie:
sr: У току подешавања имејл канала, Zammad ће проверити да ли постоје имејл поруке у поштанском сандучету. Уколико Zammad детектује бар једну поруку, биће приказан дијалог архивског режима и исти бити подразумевано укључен. Дијалог ће бити приказан и приликом уређивања постојећег имејл канала. Архивски режим вам омогућава:

source: Set an archive **cut-off time**, which means: older emails are imported in archive mode, newer ones as standard tickets (including auto-reply messages and in state "new").
de: Legen Sie einen Stichtag fest, d.h. ältere E-Mails werden im Archivmodus importiert, neuere als reguläre Tickets (einschließlich Auto-Antwort-Nachrichten und im Status "neu").
sr: Подесите **време престанка** архивирања, које подразумева: старије поруће ће бити увежене у архивском режиму, новије као редовни тикети (укључујући аутоматске одговоре и стање „ново”).

source: Select a **target state** for the archived emails: in most cases you might want to import these archived emails in "closed" state. However, if your use case is different, you can choose another one which fits for you.
de: Wählen Sie einen **Zielstatus** für die archivierten E-Mails: In den meisten Fällen werden Sie die archivierten E-Mails im Status "geschlossen" importieren wollen. Wenn Sie jedoch einen anderen Anwendungsfall haben, können Sie einen anderen Status wählen, der für Sie geeignet ist.
sr: Одредите **циљно стање** за архивиране тикете: у већини случајева желећете да увезете ове архивиране имејл поруке у стању „затворено” Међутим, уколико је ваша ситуација другачија, можете изабрати друго стање које вам више одговара.

source: By archiving emails, their creation date and time is preserved and no automatic actions (e.g. trigger with auto-reply) will take place. If imported as regular tickets, the date and time is always the time of the import.
de: Bei der Archivierung von E-Mails bleiben Erstellungsdatum und -uhrzeit erhalten, und es finden keine automatischen Aktionen (z.B. Trigger mit Auto-Antwort) statt. Wenn sie als reguläre Tickets importiert werden, ist das Datum und die Uhrzeit immer die Uhrzeit des Imports.
sr: Архивирањем имејл порука, њихов датум и време пријема биће очувано и неће бити аутоматских радњи (нпр. окидача са аутоматским одговором). Уколико их увезете као редовне тикете, датум и време ће увек осликати време увоза.

source: To import all emails as regular tickets, just turn the archive mode toggle off.
de: Um alle E-Mails als reguläre Tickets zu importieren, schalten Sie einfach den Archivmodus aus.
sr: За увоз свих имејл порука као редовних тикета, само искључите прекидач архивског режима.

source: If you turn off the archive mode, Zammad treats **all emails** (even old ones) as if they had been sent today. This means senders will receive auto-replies and tickets are created with state "new" for each message.
de: Wenn Sie den Archivierungsmodus deaktivieren, behandelt Zammad **alle E-Mails** (auch alte) so, als wären sie heute versandt worden. Das bedeutet, dass die Absender automatische Antworten erhalten und Tickets im Status "neu" für jede Nachricht erstellt werden.
sr: Уколико искључите архивски режим, третира **све поруке** (укључујући и старе) као да су послате данас. Ово значи да ће пошиљаоци добити аутоматске одговоре и тикети ће бити отворени за сваку поруку у стању „ново“.

source: If you want to differentiate even more, you have to do it manually and disable things like :doc:`triggers </manage/trigger>` before adding an email account, depending on your use case.
de: Wenn Sie noch mehr differenzieren wollen, müssen Sie manuell eingreifen und Dinge wie :doc:`Trigger </manage/trigger>` deaktivieren, bevor Sie ein E-Mail Konto hinzufügen, abhängig davon was Sie erreichen möchten.
sr: Уколико желите да направите још већу разлику, мораћете да ручно искључите механизме као што су :doc:`окидачи </manage/trigger>` пре додавања имејл налога, у зависности од ваше ситуације.

source: Email Outbound
de: Email ausgehend
sr: Одлазни имејл

source: Screenshot showing email setup outbound
de: Screenshot, der die Admin-Einstellungen in Zammad zeigt
sr: Снимак екрана који приказује подешавање одлазног имејла

source: Configuration dialog of email channel outbound
de: Konfigurationsdialog des E-Mail-Kanals ausgehend
sr: Дијалог подешавања одлазног имејл канала

source: Send mails via
de: E-Mail verschicken über
sr: Шаљи имејл поруке путем

source: Choose from **SMTP** and **local MTA** (e.g. Sendmail).
de: Wählen Sie zwischen **SMTP** und **local MTA** (z.B. Sendmail).
sr: Изаберите између **SMTP** и **Локални МТА** (нпр. Sendmail).

source: Local MTA (mail transfer agent) configuration is only available on self-hosted installations.
de: Die Einstellungen für local MTA (mail transfer agent) ist nur in selbst gehosteten Installationen verfügbar.
sr: Опција локални МТА (агент за пренос поште) доступна је само на инсталацијама које су хостоване на вашем серверу.

source: Your email server's hostname or IP address (e.g. ``smtp.gmail.com``).
de: Der Hostname oder die IP-Adresse Ihres E-Mail-Servers (z.B. ``smtp.gmail.com``).
sr: Назив хоста или IP адреса вашег имејл сервера (нпр. ``smtp.gmail.com``).

source: Your account login/username.
de: Ihr Konto-Login/Benutzername.
sr: Корисничко име налога.

source: Leave blank to use the same value from incoming account setup.
de: Leer lassen, um den gleichen Wert wie bei der Einrichtung des Eingangskontos zu verwenden.
sr: Оставите празно да бисте користили исту вредност из подешавања долазног налога.

source: Your email server's port (usually ``587`` or ``465``).
de: Der Port, auf dem Ihr E-Mail-Server erreichbar ist (typischerweise ``587`` oder ``465``).
sr: Порт вашег имејл сервера (обично ``587`` или ``465``).

source: Zammad will detect and enable SSL/STARTTLS support automatically.
de: Zammad wird SSL/STARTTLS-Unterstützung automatisch erkennen und aktivieren.
sr: Zammad ће аутоматски детектовати и омогућити подршку за SSL/STARTTLS.

source: Verification
de: Verifizierung
sr: Верификација

source: Email account verification step
de: Schritt zur Überprüfung des E-Mail-Kontos
sr: Корак верификације имејл налога

source: As a final step, Zammad sends a test email from your own account, to your own account, and to ``verify-external-smtp-sending@discard.zammad.org`` which discards the test mail right away.
de: Im letzten Schritt prüft Zammad die Konfiguration, indem eine E-Mail von dem angelegten Account an denselben Account geschickt wird und an ``verify-external-smtp-sending@discard.zammad.org``, wo die Mail direkt verworfen wird.
sr: Као последњи корак, Zammad шаље пробну имејл поруку путем вашег налога, на ваш налог и на ``verify-external-smtp-sending@discard.zammad.org`` која одмах одбацује пробну поруку.

source: We've created a `landing page for discard.zammad.org <https://discard.zammad.org>`_ which describes the backgrounds as well.
de: Wir haben eine `eigene Seite für discard.zammad.org <https://discard.zammad.org>`_ erstellt, die die Hintergründe beschreibt.
sr: Направили смо `страницу са информацијама за discard.zammad.org <https://discard.zammad.org>`_ која такође описује поступак.

source: If you did not assign the email address to the group, make sure to check now if the correct email address is :doc:`assigned to the group </manage/groups/settings>`.
de: Wenn Sie die E-Mail-Adresse nicht der Gruppe zugewiesen haben, überprüfen Sie nun, ob :doc:`der Gruppe die richtige E-Mail-Adresse zugewiesen ist </manage/groups/settings>`.
sr: Уколико нисте изменили имејл адресу групе, обавезно проверите да ли је исправна имејл адреса већ :doc:`додељена групи </manage/groups/settings>`.

source: Otherwise, the agents in this group will not be able to send e-mails.
de: Andernfalls können die Agenten in dieser Gruppe keine E-Mails versenden.
sr: У супротном, оператери ове групе неће моћи да шаљу имејл поруке.

source: Troubleshooting
de: Fehlerbehebung
sr: Решавање проблема
