Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: You can create or edit macros on the Macros page of the admin panel:
de: Sie können "Makros" im Admin-Panel erstellen oder bearbeiten:
sr: Можете додати или уређивати макрое на страници Макрои у административном панелу:

source: Screenshot of "Macros" page in admin panel
de: Screenshot von Makros im Admin-Bereich
sr: Снимак екрана странице „Макрои“ у административном панелу

source: How Do Macros Work
de: Wie funktionieren Makros
sr: Како макрои уствари раде

source: Macros are made up of **actions** (changes to a ticket). You can add as many actions to a macro as you want.
de: Makros bestehen aus **Aktionen** (Änderungen an einem Ticket). Sie können einem Makro beliebig viele Aktionen hinzufügen.
sr: Макрои се састоје од **радњи** (измена тикета). Макроу можете додати онолико радњи колико желите.

source: There are also a few other settings that affect who can use a macro or how it behaves.
de: Es gibt zusätzliche Einstellungen, die beeinflussen, wer ein Makro verwenden kann oder wie es sich verhält.
sr: Постоји и неколико других подешавања која утичу на то ко може да користи макро или како се он понаша.

source: Creating Macros
de: Makros erstellen
sr: Додавање макроа

source: Screenshot showing different possible actions for macros.
de: Screenshot zeigt verschiedene Aktionen für Makros.
sr: Снимак екрана који приказује различите могуће радње за макрое.

source: Actions
de: Aktionen
sr: Радње

source: You can create actions to:
de: Sie können Aktionen erstellen, um:
sr: Можете креирати радње за:

source: set ticket attributes (priority, state, group, etc.)
de: Ticketattribute festzulegen (Priorität, Status, Gruppe, usw.)
sr: подешавање атрибута тикета (приоритет, стање, група, итд.)

source: add new notes to a ticket
de: Notizen zu Tickets hinzuzufügen
sr: додавање нових напомена у тикет

source: There are **no** actions for:
de: Es gibt **keine** Aktionen für:
sr: **Не постоје** радње за:

source: sending a reply to the customer
de: Eine Antwort an Ihren Kunden zu senden
sr: слање одговора клијенту

source: Unlike triggers, the scheduler, and text modules, macro actions do **not** support the use of :doc:`/misc/variables`.
de: Im Gegensatz zu Triggern, der Automatisierung und Textmodulen unterstützen Aktionen in Makros **keine** Verwendung von :doc:`Variablen </misc/variables>`.
sr: За разлику од окидача, планера и текстуалних исечака, макро радње **не подржавају** употребу :doc:`/misc/variables`.

source: If the ticket is missing a required attribute and the macro doesn't set it, then **no actions will be applied**.
de: Wenn dem Ticket ein erforderliches Attribut fehlt und das Makro es nicht festlegt, werden **keine Änderungen angewendet**.
sr: Ако тикету недостаје обавезни атрибут и макро га не подеси, онда **неће бити примењене никакве радње**.

source: Once completed...
de: Nach Abschluss...
sr: Када се заврши…

source: After running this macro, should Zammad remain on the current tab, close it, or automatically switch to the next ticket? (Does not apply when running macros "in bulk".)
de: Soll Zammad nach der Ausführung dieses Makros auf der aktuellen Registerkarte bleiben, diese schließen oder automatisch zum nächsten Ticket wechseln? (Gilt nicht, wenn Makros auf mehrere Tickets angewandt werden.)
sr: Након покретања овог макроа, да ли Zammad треба да остане у тренутном прозору, затвори га или аутоматски пређе на следећи тикет? (Не примењује се када се макрои покрећу „масовном радњом“.)

source: What should other Zammad admins know about this macro? (Visible only via the "Edit: Macro" dialog, Rails console, and API.)
de: Was sollten andere Zammad-Administratoren über dieses Makro wissen? (Nur sichtbar über das Dialogfeld "Bearbeiten: Makro“, die Rails-Konsole und die API.)
sr: Шта други Zammad администратори треба да знају о овом макроу? (Видљиво само преко дијалога „Измена: Макро“, Rails конзоле и API-ја.)

source: Which :doc:`/manage/groups/index` are allowed to see/use this macro?
de: Welche :doc:`/manage/groups/index` dürfen das Makro sehen und verwenden?
sr: Који :doc:`групе </manage/groups/index>` смеју да виде/користе овај макро?

source: Choose "inactive" to disable this macro without deleting it.
de: Wählen Sie "inaktiv“, um dieses Makro zu deaktivieren, ohne es zu löschen.
sr: Изаберите „искључено“ да бисте онемогућили овај макро без брисања.

source: Managing Macros
de: Verwaltung von Makros
sr: Управљање макроима

source: Edit your macros by simply clicking on it. You can delete or even clone existing macros by clicking on the ︙ action menu and select the desired action:
de: Bearbeiten Sie Ihre Makros, indem Sie sie einfach anklicken. Sie können bestehende Makros löschen oder sogar klonen, indem Sie auf das Aktionsmenü ︙ klicken und die gewünschte Aktion auswählen:
sr: Уредите ваше макрое једноставник кликом. Моћжете обрисати или чак и клонирати постојеће макрое кликом на ⁝ мени радњи и одабиром жељене функције:

source: Screenshot showing the macro action menu
de: Screenshot des Makro-Aktionsmenüs
sr: Снимак екрана који приказује мени макро радњи

source: When cloning a macro, make sure to click "Submit" for the duplicate to be created.
de: Wenn Sie ein Makro klonen, müssen Sie auf "Übermitteln" klicken, damit das Duplikat erstellt wird.
sr: Када клонирате макро, обавезно кликните на „Пошаљи“ да би се направио дупликат.

source: Macro Example
de: Makro-Beispiel
sr: Пример макроа

source: To get you up and running quickly, here are some examples of the kinds of one-click actions you can set up using macros.
de: Damit Sie schnell loslegen können, finden Sie hier einige Beispiele für Ein-Klick-Aktionen, die Sie mithilfe von Makros einrichten können.
sr: Да бисте брзо схватили, ево неколико примера врста радњи једног клика које можете подесити помоћу макроа.

source: To learn about macros in detail, go to the section :doc:`/manage/macros/how-do-they-work`.
de: Um mehr über Makros im Detail zu erfahren, lesen Sie den Abschnitt :doc:`/manage/macros/how-do-they-work`.
sr: Да бисте сазнали више о макроима, посетите одељак :doc:`/manage/macros/how-do-they-work`.

source: If you deal with a lot of spam, you could set up a macro that applies the following changes to a ticket:
de: Wenn Sie mit viel Spam zu tun haben, können Sie ein Makro einrichten, das die folgenden Änderungen auf ein Ticket anwendet:
sr: Ако имате посла са пуно нежељене поште, можете да подесите макро који примењује следеће измене на тикет:

source: State
de: Status
sr: Стање

source: closed
de: geschlossen
sr: затворено

source: add ``spam``
de: Hinzufügen von``spam``
sr: додај ``spam``

source: Owner
de: Besitzer
sr: Власник

source: current user
de: aktueller Benutzer
sr: тренутни корисник

source: Screenshot showing spam macro configuration
de: Screenshot zeigt Spam-Makro-Konfiguration
sr: Снимак екрана који приказује подешавање макроа нежељене поште

source: 💡 Run this macro in a :doc:`/manage/scheduler` to periodically clean up unwanted tickets.
de: 💡 Führen Sie dieses Makro in einer :doc:`/manage/scheduler` aus, um regelmäßig unerwünschte Tickets zu bereinigen.
sr: 💡 Покрените овај макро у :doc:`/manage/scheduler` да бисте повремено очистили нежељене тикете.

source: If you want to set a ticket's state to *pending reminder*, it's usually a two-step process - first select the state, then select a date. To always set a reminder for the same, fixed amount of time (say, seven days later), you can bundle the whole change into a macro:
de: Wenn Sie den Status eines Tickets auf "warten auf Erinnerung“ setzen möchten, erfolgt dies normalerweise in zwei Schritten: Wählen Sie zunächst den Status und dann ein Datum aus. Um eine Erinnerung immer für den gleichen, festen Zeitraum (z.B. sieben Tage später) festzulegen, können Sie die gesamte Änderung in einem Makro bündeln:
sr: Ако желите да подесите стање тикета на *чека на подсетник*, то је обично процес у два корака – прво изаберите стање, а затим изаберите датум. Да бисте увек подесили подсетник за исто, фиксно време (рецимо, седам дана касније), можете да групишете целу измену у макро:

source: "Postponing ticket for 7 days." (🔒 internal visibility only)
de: "In 7 Tagen erinnern.“ (🔒 nur interne Sichtbarkeit)
sr: „Одлагање тикета за 7 дана.” (🔒 видљиво само интерно)

source: pending reminder
de: warten auf Erinnerung
sr: на чекању

source: Pending Till
de: Warten bis
sr: На чекању до

source: relative / 7 / days
de: relativ / 7 / Tage
sr: релативно / 7 / дан(а)

source: Screenshot showing postpone macro configuration
de: Screenshot der Konfiguration des Verschieben-Makros
sr: Снимак екрана који подешавање макроа за одлагање

source: via the Admin Panel
de: über das Admin-Panel
sr: преко администраторског панела

source: via CSV import
de: über einen CSV-Import
sr: преко CSV увоза

source: via REST API (system documentation)
de: via REST API (System-Dokumentation)
sr: преко REST API (системска документација)

source: Organizations
de: Organisationen
sr: Организације

source: Organizations can be managed individually via UI, via CSV import or the API.
de: Organisationen können individuell über die Benutzeroberfläche, über einen CSV-Import oder die API verwaltet werden.
sr: Организације је могуће уређивати појединачно путем корисничког интерфејса, путем CSV увоза или путем API-ја.

source: Organizations can be managed by admins. However, in most cases agents can, too (using the :user-docs:`ticket pane </extras/organizations.html>` or organization detail page).
de: Organisationen können von Administratoren verwaltet werden. In den meisten Fällen können dies jedoch auch Agenten tun (über die :user-docs:`Ticket-Ansicht </extras/organizations.html>` oder die Detailseite der Organisation).
sr: Организације уређују администратори. У већини случајева могу и оператери (користећи :user-docs:`панел тикета </extras/organizations.html>` или страницу са детаљима о организацији).

source: Creating and editing users directly in the Admin Panel
de: Erstellen und Bearbeiten von Benutzern direkt im Admin-Panel
sr: Додавање и уређивање корисника директно у панелу администратора

source: The simplest way to manage organizations is directly in the organization detail view.
de: Der einfachste Weg, Organisationen zu verwalten, ist direkt in der Organisations-Detailseite.
sr: Најједноставнији начин управљања организацијама је директно из прегледа организације.

source: Learn more about managing organizations...
de: Erfahren Sie mehr über die Verwaltung von Organisationen...
sr: Сазнајте више о управљању организацијама...

source: **There are some technical limitations:**
de: **Es gibt einige technische Einschränkungen:**
sr: **Постоје нека техничка ограничења:**

source: Organizations currently cannot be removed. The only exception is Zammad's :doc:`/system/data-privacy` function.
de: Organisationen können derzeit nicht entfernt werden. Die einzige Ausnahme ist die Funktion :doc:`/system/data-privacy` in Zammad.
sr: Организације тренутно не могу да се уклоне. Једини изузетак је Zammad функција :doc:`/system/data-privacy`.

source: Unlike users, agents cannot just create new organizations. Check the :doc:`permission reference </manage/roles/admin-permissions>` to learn more.
de: Im Gegensatz zu Benutzern können Agenten nicht einfach neue Organisationen erstellen. Weitere Informationen finden Sie unter :doc:`Berechtigungen </manage/roles/admin-permissions>`.
sr: За разлику од корисника, оператери не могу само да додају нове организације. Консултујте :doc:`референцу дозволa </manage/roles/admin-permissions>` да бисте сазнали више.

source: Because of how organization references work with users, external syncs like LDAP or Exchange *do not* support organization mapping. If this is relevant to you, consider domain based assignments.
de: Aufgrund der Art und Weise, wie Organisationen im Zusammenhang mit Benutzern funktionieren, unterstützen externe Verwaltungsdienste wie LDAP oder Exchange *keine* Synchronisierung von Organisationen. Wenn dies für Sie relevant ist, sollten Sie domänenbasierte Zuweisungen in Betracht ziehen.
sr: Због начина на који организационе референце функционишу са корисницима, спољне синхронизације као што су LDAP или Exchange *не* подржавају мапирање организације. Уколико се ово не односи на вас, размотрите доделу на основу домена.

source: BIG organizations can cause *performance issues*. Especially organizations with many members can cause a fairly high system load if their members run many updates, for example ticket creations or frequent communication.
de: Große Organisationen können *Leistungsprobleme* verursachen. Insbesondere Organisationen mit vielen Mitgliedern können eine ziemlich hohe Systemlast verursachen, wenn ihre Mitglieder viele Aktualisierungen durchführen, z.B. Ticket-Erstellungen oder häufige Kommunikation.
sr: Велике организације могу изазвати *проблеме са перформансама*. Поготову организације са много чланова могу довести до прилично великог оптерећења система у случају да њихови чланови покрећу многа освежавања, на пример отварање тикета или честа комуникација.

source: Reference Guide: Organization Details
de: Dokumentation: Details zur Organisation
sr: Референтни водич: детаљи организација

source: Most of the attributes you can set on organizations are self-explanatory. The ones that aren't are described below.
de: Die meisten Attribute, die Sie für Organisationen festlegen können, sind selbsterklärend. Diejenigen, bei denen dies nicht der Fall ist, werden unten beschrieben.
sr: Већина атрибута које можете поставити организацијама су сами по себи разумљиви. Они који нису описани су у наставку.

source: The edit organization dialog, showing the various organization detail fields
de: Das Dialogfeld "Organisation bearbeiten“ zeigt die verschiedenen Detailfelder an
sr: Дијалог за уређивање организације, који приказује различита поља детаља о организацији

source: User details can be set in the **New/Edit Organization** dialog.
de: Details können im Dialogfeld **Neu/Bearbeiten Organisation** festgelegt werden.
sr: Детаљи о организацији се могу подесити у дијалогу **Ново/Измена: Организација**.

source: 📢 Shared Organization
de: 📢 Geteilte Organisation
sr: 📢 Заједничка организација

source: If you set this option to ``yes``, all organization members will be able to **view** and **update** tickets of their organizational members in addition to their own.
de: Wenn Sie diese Option auf ``Ja`` setzen, können alle Organisationsmitglieder zusätzlich zu ihren eigenen Tickets auch die Tickets ihrer Organisationsmitglieder **ansehen** und **aktualisieren**.
sr: Ако ову опцију поставите на ``да``, сви чланови организације ће моћи да **виде** и **освежавају** тикете чланова исте организације поред својих.

source: This can cause serious issues if you have e.g. human resources working in the same Zammad instance. Shared organizations usually are relevant for Support companies with fairly big customers and support contingents.
de: Dies kann zu ernsthaften Problemen führen, wenn z.B. die Personalabteilung in derselben Zammad-Instanz arbeitet. Gemeinsame Organisationen sind in der Regel für Supportunternehmen mit relativ großen Kunden und Supportkontingenten relevant.
sr: Ово може изазвати озбиљне проблеме ако имате, на пример, људске ресурсе који раде у истој Zammad инстанци. Заједничке организације су обично релевантне за фирме за подршку са прилично великим клијентима и контингентима подршке.

source: Setting this option to yes also provides access to overviews being available to shared organizations only. Learn more on :doc:`/manage/overviews`.
de: Wenn Sie diese Option auf Ja setzen, erhalten Sie außerdem Zugriff auf Übersichten, die nur für gemeinsam genutzte Organisationen verfügbar sind. Erfahren Sie mehr unter :doc:`/manage/overviews`.
sr: Постављање ове опције на да такође омогућава приступ прегледима који су доступни само дељеним организацијама. Сазнајте више у секцији :doc:`/manage/overviews`.

source: The default value on creation dialogues is ``yes``.
de: Der Standardwert dafür ist ``Ja``.
sr: Подразумевана вредност у дијалозима за додавање је ``да``.

source: If you want to provide ticket access to agents, please see the :ref:`permission-guide`.
de: Wenn Sie Agenten Ticketzugriff ermöglichen möchten, lesen Sie bitte :ref:`permission-guide`.
sr: Уколико желите да омогућите приступ тикетима оператера, погледајте :ref:`permission-guide`.

source: Screenshot showing "My Organization Tickets" overview with tickets belonging to all organization members
de: Screenshot mit der Übersicht "Meine Organisationstickets“ mit Tickets von allen Organisationsmitgliedern
sr: Снимак екрана који приказује преглед „Тикети моје организације“ са тикетима свих чланова организације

source: Members of shared organization have access to organization based overviews
de: Mitglieder einer teilenden Organisation haben Zugriff auf organisationsbasierte Übersichten
sr: Чланови заједничке организације имају приступ прегледима заснованим на организацији

source: 🗄️ Domain based assignment
de: 🗄️ Domainbasierte Zuweisung
sr: 🗄 Додела на основу домена

source: Activating domain based assignment will cause Zammad to automatically add *newly created* users to said organization. This can greatly reduce your maintenance effort and is seen as workaround for not being able to map organizations via LDAP.
de: Die Aktivierung der Domainbasierten Zuweisung führt dazu, dass Zammad *neu erstellte* Benutzer automatisch zu dieser Organisation hinzufügt. Dies kann Ihren Arbeitsaufwand erheblich reduzieren und dient als Workaround, da Organisationen nicht über LDAP abgebildet werden können.
sr: Активирање доделе на основу домена ће проузроковати да Zammad аутоматски дода *нове* кориснике у поменуту организацију. Ово може у великој мери смањити ваше напоре у одржавању и сматра се решењем за немогућност мапирања организација преко LDAP.

source: The default value on creation dialogues is ``no``
de: Der Standardwert für Erstellungsdialoge ist ``nein``
sr: Подразумевана вредност у дијалогу за додавање је ``не``

source: Add the email domain of the organization with this option. It's being used on user creation to determine the assignment. This option belongs to domain based assignment and is required if set to ``yes``.
de: Fügen Sie mit dieser Option die E-Mail-Domain der Organisation hinzu. Es wird bei der Benutzererstellung verwendet, um die Zuweisung zu bestimmen. Diese Option gehört zur Domainbasierten Zuweisung und ist erforderlich, wenn sie auf ``Ja`` gesetzt ist.
sr: Додајте имејл домен организације са овом опцијом. Користи се при додавању корисника да би се одредила додела. Ова опција припада додели на основу домена и потребна је ако је иста постављена на ``да``.

source: Currently, Zammad allows *one* domain per organization. You may also want to ensure to not use free mailer domains like ``gmail.com`` for these assignments.
de: Derzeit erlaubt Zammad *eine* Domain pro Organisation. Achten Sie bitte darauf, keine Domains von kostenlosen E-Mail-Providern wie ``gmail.com`` einzutragen.
sr: Тренутно, Zammad дозвољава *један* домен по организацији. Такође можда желите и да проверите да за ове доделе не користите бесплатне имејл домене као што је ``gmail.com``.

source: This flag is a way for your team to indicate high-status organizations. Just as with customers, you can set up special :doc:`/manage/trigger`, :doc:`/manage/scheduler` jobs, :doc:`/manage/slas/index`, and :doc:`/manage/overviews` just for VIPs.
de: Mit dieser Kennzeichnung kann Ihr Team auf hochrangige Organisationen hingewiesen werden. Genau wie bei Kunden können Sie spezielle :doc:`/manage/trigger`, :doc:`Automatisierungs-Jobs </manage/scheduler>`, :doc:`/manage/slas/index` und :doc:`/manage/overviews` für VIPs einrichten.
sr: Овај атрибут је начин да ваш тим укаже на организације високог статуса. Као и код купаца, можете подесити посебне :doc:`окидаче </manage/trigger>`, :doc:`пленере </manage/scheduler>`, :doc:`/manage/slas/index` и :doc:`прегледе </manage/overviews>` само за VIP особе.

source: Ticket view showing a VIP organization's avatar with a crown on it
de: Ticketansicht mit dem Avatar einer VIP-Organisation mit einer Krone
sr: Приказ тикета који приказује аватар VIP организације са круном на њему

source: VIP organizations are displayed with a crown above their avatars.
de: VIP-Organisationen werden mit einer Krone über ihren Avataren angezeigt.
sr: VIP организације су приказане са круном изнад њихових аватара.

source: 📑 Note
de: 📑 Notiz
sr: 📑 Напомена

source: Notes are visible to all staff members, **including agents**.
de: Notizen sind für alle Mitarbeiter sichtbar, **einschließlich Agenten**.
sr: Напомене су видљиве свим члановима особља, **укључујући оператере**.

source: 😵 **Are you using the Note field to keep track of your own "custom" organization attributes?**
de: 😵 **Verwenden Sie das Notizfeld, um Ihre eigenen "benutzerdefinierten“ Organisationsattribute zu pflegen?**
sr: 😵 **Да ли користите поље напомене да бисте пратили сопствене „прилагођене“ атрибуте организације?**

source: Wish you could add your own fields to organizations?
de: Sie möchten Ihre eigenen Felder zu Organisationen hinzufügen?
sr: Желите да додате сопствена поља за организације?

source: You can! To learn more, see :doc:`/system/objects`.
de: Sie können! Weitere Informationen finden Sie unter :doc:`/system/objects`.
sr: Можете! Да бисте сазнали више, погледајте :doc:`/system/objects`.

source: ▶️ Active
de: ▶️ Aktiv
sr: Активно

source: Disabling this flag is a soft alternative to deleting an organization. So what's the difference?
de: Das Deaktivieren ist eine Alternative zum Löschen einer Organisation. Was ist denn der Unterschied?
sr: Искључивање овог атрибута је мека алтернатива брисању организације. Па, у чему је разлика?

source: There is no way to restore a deleted organization; inactive organizations can be reactivated at any time.
de: Es gibt keine Möglichkeit, eine gelöschte Organisation wiederherzustellen. Inaktive Organisationen können jederzeit reaktiviert werden.
sr: Не постоји начин за враћање избрисане организације; искључене организације могу се поново укључити у било ком тренутку.

source: Inactive organizations still appear in search results:
de: Inaktive Organisationen werden weiterhin in den Suchergebnissen angezeigt:
sr: Искључене организације се и даље појављују у резултатима претраге:

source: An inactive organization displayed in a quick search list
de: Eine inaktive Organisation wird in der Suche angezeigt
sr: Искључена организација приказана на листи брзе претраге

source: A slashed-out 🏢 icon indicates an inactive organization. In other cases, inactive organizations are grayed out.
de: Ein durchgestrichenes 🏢-Symbol zeigt eine inaktive Organisation. In anderen Fällen werden inaktive Organisationen ausgegraut.
sr: Пресечена иконица 🏢 означава искључену организацију. У другим случајевима, искључене организације су приказане у сивој боји.

source: Managing Organizations via CSV Import
de: Organisationen per CSV-Import verwalten
sr: Управљање организацијама преко CSV увоза

source: If your organization has information about customers (or personnel) already stored in a directory system that can export to CSV, you can batch-import them into Zammad in just three steps.
de: Wenn Ihre Firma über Informationen zu Kunden (oder Mitarbeitern) verfügt, die bereits in einem System gespeichert sind, das in eine CSV-Datei exportieren kann, können Sie diese in nur drei Schritten in Zammad importieren.
sr: Ако ваша организација има информације о клијентима (или особљу) већ ускладиштене у систему директоријума који може да извози у CSV, можете их групно увести у Zammad у само три корака.

source: The CSV import dialog
de: Der CSV-Importdialog
sr: CSV дијалог за увоз
