Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: Provides a date picker field and does not allow default values.
de: Bietet ein Datumsauswahlfeld und lässt keine Standardwerte zu.
sr: Приказује поље бирача датума и не подржава подразумеване вредности.

source: Default time diff (hours)
de: Standard-Zeit-Differenz (Stunden)
sr: Подразумевана временска разлика (сати)

source: This setting helps the user by highlighting the day from now plus the provided value. It *does not* pre-fill the field.
de: Diese Einstellung hilft dem Benutzer, indem sie einen Tag hervorhebt, der dem aktuellen Datum plus der Differenz entspricht. Das Feld wird *nicht* vorausgefüllt.
sr: Ово подешавање помаже кориснику означавањем датума унете временске разлике од сада. *Неће* аутоматски попунити вредност поља.

source: Available settings for Date fields
de: Verfügbare Einstellungen für Datumsfelder
sr: Доступна подешавања поља датума

source: Date & time field
de: Datum & Zeit-Feld
sr: Поље датума и времена

source: Provides a date and time picker – does not allow default values
de: Bietet eine Datums- und Zeitauswahl an - erlaubt keine Standardwerte
sr: Приказује бирач датума и времена – не подржава подразумеване врености

source: Allow future
de: Werte in der Zukunft erlauben
sr: Дозволи у будућности

source: Forbid dates and times in the future.
de: Verbietet Datum und Zeit in der Zukunft.
sr: Контролише могућност уноса датума и времена у будућности.

source: Allow past
de: Werte in der Vergangenheit erlauben
sr: Дозволи у прошлости

source: Forbid dates and times in the past.
de: Verbietet Datum und Zeit in der Vergangenheit.
sr: Контролише могућност уноса датума и времена у прошлости.

source: Default time diff (minutes)
de: Standard-Zeit-Differenz (Minuten)
sr: Подразумевана временска разлика (минути)

source: This setting helps the user by highlighting the day from now plus the provided value. It does not pre-fill the field.
de: Diese Einstellung hilft dem Benutzer, indem sie einen Tag hervorhebt, der dem aktuellen Datum plus der Differenz entspricht. Das Feld wird *nicht* vorausgefüllt.
sr: Ово подешавање помаже кориснику означавањем датума унете временсе разлике од сада. *Неће* аутоматски попунити вредност поља.

source: Available settings for Date & time fields
de: Verfügbare Einstellungen für Datum- und Zeitfelder
sr: Доступна подешавања за поља датуме и времена

source: Integer field
de: Zahlen-Feld
sr: Целобројно поље

source: Provides an input field that allows integer usage only. You may define a default value. You cannot enforce comma separation.
de: Bietet ein Eingabefeld, das nur die Verwendung von Ganzzahlen erlaubt. Sie können einen Standardwert definieren. Dezimalstellen sind nicht erlaubt bzw. werden ignoriert.
sr: Приказује поље уноса које дозвољава унос само целобројних вредности. Могуће је дефинисати подразумевану вредност. Није могуће захтевати децималну поделу.

source: Minimal
de: Minimum
sr: Минимални

source: The minimal value the field accepts.
de: Der Mindestwert, den das Feld akzeptiert.
sr: Минимална вредност коју поље прихвата.

source: Maximal
de: Maximum
sr: Максимални

source: The maximum value the field accepts.
de: Der Maximalwert, den das Feld akzeptiert.
sr: Максимална вредност коју поље прихвата.

source: Available settings for Integer fields
de: Verfügbare Einstellungen für Integer-Felder
sr: Доступна подешавања целобројних поља

source: Multiple selection field
de: Mehrfachauswahl-Feld
sr: Поље за вишеструки избор

source: Provides a selection field that allows the selection of one or more out of several. This field does allow setting a default value.
de: Bietet ein Auswahlfeld, das die Auswahl von einem oder mehreren Werten ermöglicht. In diesem Feld kann ein Standardwert festgelegt werden.
sr: Приказује поље падајућег менија које омогућава избор једне или више опција од понуђених. Ово поље дозвољава подешавање подразумеване вредности.

source: Available settings for Multiple selection fields
de: Verfügbare Einstellungen für Mehrfachauswahlfelder
sr: Доступна подешавања поља вишеструког избора

source: Single selection field
de: Einfachauswahl-Feld
sr: Поље за једноструки избор

source: Provides a drop-down field that allows selection of one value out of several. This field does allow setting a default value.
de: Bietet ein Dropdown-Feld, in dem ein Wert aus mehreren ausgewählt werden kann. In diesem Feld kann auch ein Standardwert festgelegt werden.
sr: Приказује поље падајућег менија које омогућава избор једне опције од понуђених. Ово поље дозвољава подешавање подразумеване вредности.

source: Available settings for Single selection fields
de: Verfügbare Einstellungen für Einfachauswahl-Felder
sr: Доступна подешавања поља једноструког избора

source: Textarea field
de: Textbereich-Feld
sr: Текстуално поље

source: Provides a text area input field (multiple lines) and thus allows e.g. new lines. You can set a default field value.
de: Bietet ein Eingabefeld für einen Textbereich und ermöglicht u.a. mehrere Zeilen. Sie können einen Standardfeldwert festlegen.
sr: Приказује поље текстуалног уноса (од више линија) и дозвољава унос нпр. ентера. Можете подесити подразумевану вредност поља.

source: Please note that this field *does not* support text formatting or HTML content (rich text).
de: Bitte beachten Sie, dass dieses Feld *keine* Textformatierung oder HTML-Inhalte (Rich Text) unterstützt.
sr: Обратите пажњу да ово поље *не* подржава форматирање текста или HTML садржај (обогаћен текст).

source: **🥵 This field can consume a lot of visual space**
de: **🥵 Dieses Feld kann viel Platz beanspruchen**
sr: **🥵 Ово поље може заузети доста визуелног простора**

source: Depending on where you use this field type, it may use a lot of visual space if you provide a lot of text. This may be an issue to work with.
de: Je nachdem, wo Sie diesen Feldtyp verwenden, kann er viel Platz beanspruchen, wenn Sie viel Text eingeben. Das kann zu Problemen führen.
sr: У зависности од тога где користите овај тип поља, могуће је да ће заузети доста визуелног простора по уносу веће количине текста. Ово може представљати проблем при раду.

source: Default
de: Standard
sr: Подразумевано

source: The here provided text will be shown within the text area field or new data sets.
de: Der hier eingegebene Text wird im Textfeld oder in neuen Datensätzen angezeigt.
sr: Унешен текст овде биће приказан у оквиру текстуалног поља или нових скупова података.

source: Maxlength
de: Maximale Länge
sr: Максимална дужина

source: You can pick the maximum length of the field.
de: Sie können die maximale Länge des Feldes wählen.
sr: Можете одредити максималну дозвољену дужину поља.

source: The default length of this object is ``500``.
de: Die Standardlänge dieses Objekts ist ``500``.
sr: Подразумевана дужина за овај објекат је ``500`` карактера.

source: Rows
de: Zeilen
sr: Редови

source: Change the number of rows to dislay so that you can use only the space you really need.
de: Ändern Sie die Anzahl der anzuzeigenden Zeilen, damit nur der wirklich benötigte Platz verwendet wird.
sr: Промените број редова за приказ тако да заузмете само простор који вам је заиста неопходан.

source: The default number of rows is ``4``.
de: Die Standardanzahl der Zeilen ist ``4``.
sr: Подразумеван број редова је ``4``.

source: Available settings for Textarea fields
de: Verfügbare Einstellungen für Textbereich-Felder
sr: Доступна подешавања текстуалних поља

source: Text field
de: Textfeld
sr: Поље текста

source: Provides a text field (one line) and allows choosing a default value.
de: Bietet ein Textfeld (eine Zeile) und ermöglicht die Auswahl eines Standardwerts.
sr: Приказује поље текста (у једној линији) и омогућава избор подразумеване вредности.

source: Defines the type of the input field. This allows e.g. your browser to ensure that you provide the specific type.
de: Legt den Typ des Eingabefeldes fest. So kann z.B. Ihr Browser sicherstellen, dass der richtige Typ eingeben wird.
sr: Одређује тип уноса поља. Ово омогућава нпр. вашем претраживачу да ограничи унос само одговарајућег типа.

source: Currently available:
de: Derzeit verfügbar:
sr: Тренутно доступно:

source: Phone
de: Telefon
sr: Позив

source: Url *(URL fields disable link-template availability)*
de: Url *(URL-Felder deaktivieren die Verfügbarkeit von Link-Templates)*
sr: URL *(URL поља онемогућавају шаблоне везе)*

source: Available settings for Text fields
de: Verfügbare Einstellungen für Textfelder
sr: Доступна подешавања поља текста

source: Single tree selection field
de: Einfach-Baumauswahl-Feld
sr: Поље за једноструки избор стабла

source: Available settings for Tree Select fields
de: Verfügbare Einstellungen für Baumauswahlfelder
sr: Доступна подешавања поља за избора стабла

source: Multiple tree selection field
de: Mehrfach-Baumauswahl-Feld
sr: Поље за вишеструки избор стабла

source: External Data Source field
de: Externe Datenquelle Feld
sr: Поље удаљеног извора података

source: Provides a searchable field which fetches data from an external system. This can be useful if you have data outside of Zammad and don't want to maintain both data sources.
de: Bietet ein durchsuchbares Feld, das Daten aus einem externen System abruft. Dies kann nützlich sein, wenn Sie Daten außerhalb von Zammad haben und nicht beide Datenquellen pflegen wollen.
sr: Омогућава поље са функцијом претраживања која учитава податке са удаљеног система. Ово може бити корисно ако имате податке изван Zammad-а и не желите да уређујете оба извора података.

source: The feature works as follows:
de: Das funktioniert wie folgt:
sr: Функција ради на следећи начин:

source: Zammad sends a query with a search string (free text from agent or based on a variable) in a pre-defined format ("Search URL") to an external system.
de: Zammad sendet eine Anfrage mit einem Suchstring (freier Text vom Agent oder basierend auf einer Variable) in einem vordefinierten Format ("Such URL") an ein externes System.
sr: Zammad шаље упит са кључним речима а претрагу (слободан унос текста од стране оператера или на основу променљиве) у предефинисаном формату („URL за претрагу”) удаљеном систему.

source: This external system searches for matches and provides a response as a JSON structure to Zammad.
de: Dieses externe System sucht nach Übereinstimmungen und gibt eine Antwort in Form einer JSON-Struktur an Zammad.
sr: Удаљени систем претражује податке и обезбељује одговор као JSON структуру за Zammad.

source: Zammad just looks for the defined list and value keys, reads the content and displays the value to the user. There is no search on Zammad side.
de: Zammad sucht nur nach den definierten Suchergebnis-Schlüsseln und -Werten, liest den Inhalt und zeigt dem Benutzer den Wert an. Es gibt keine Suche auf der Seite von Zammad.
sr: Zammad онда обрађује податке на основу дефинисаних кључева листе и вредности, и приказује садржај кориснику. Претрага се не врши на страни Zammad-а.

source: The usage of a PostgreSQL database for Zammad is required. In any other case, Zammad will hide the external data source type and you are not able to use it. If you want to use this feature, consider to :docs:`migrate your database </appendix/migrate-to-postgresql.html>`.
de: Die Verwendung einer PostgreSQL-Datenbank für Zammad ist erforderlich. In jedem anderen Fall wird Zammad den externen Datenquellentyp ausblenden und Sie können ihn nicht verwenden. Wenn Sie diese Funktion nutzen möchten, ziehen Sie bitte eine :docs:`Migration Ihrer Datenbank </appendix/migrate-to-postgresql.html>` in Erwägung.
sr: Коришћење PostgreSQL базе података је захтевано за ову функцију. У сваком другом случају, Zammad ће сакрити избор овог поља и нећете моћи да га користите. Ако желите да користите ову функцију, размотрите и :docs:`миграцију ваше базе података </appendix/migrate-to-postgresql.html>`.

source: Currently, only ``GET`` is supported as request method.
de: Derzeit wird nur ``GET`` als Anfragemethode unterstützt.
sr: Тренутно, подржани су само захтеви путем ``GET`` методе.

source: The data structure must be in JSON format and provide the objects in an array.
de: Die Datenstruktur muss im JSON-Format sein und die Objekte in einem Array bereitgestellt werden.
sr: Структура података мора бити у JSON формату и враћени објекти морају бити ускладиштени као низ.

source: The endpoint for the external data source has to support search. On Zammad side, there is no search/logic implemented; however, you can define the output key and value based on the result(s) from the response (which provides already filtered content based on the search).
de: Der Endpunkt für die externe Datenquelle muss die Suche unterstützen. Auf Zammad-Seite ist keine Suche/Logik implementiert; Sie können jedoch den Suchergebnis-Schlüssel und -Wert auf der Grundlage des Ergebnisses der Antwort definieren (die bereits gefilterte Inhalte auf der Grundlage der Suche bereitstellt).
sr: Путања за удаљени извор података мора да подржава претрагу. Са Zammad стране није имплементирана било каква логика претраге; међутим можете дефинисати изворни кључ и вредност на основу резултата одговора (који обезбеђује већ изфилтриран садржај на основу кључних речи).

source: If you receive more results as expected, your external data source search may not work properly or the structure of the URL is not correct. You should get in touch with a responsible person from the external system.
de: Wenn Sie mehr Ergebnisse als erwartet erhalten, funktioniert die Suche in Ihrer externen Datenquelle möglicherweise nicht richtig oder die Struktur der URL ist nicht korrekt. Sie sollten sich mit einer zuständigen Person des externen Systems in Verbindung setzen.
sr: Уколико примите више резултата од очекиваних, претрага вашег удаљеног извора података можда не ради како треба или структура URL путање није исправна. Ступите у контакт са одговорном особом удаљеног система.

source: Please have a look :doc:`at our example </system/objects/external-data-source-example>`, where you can find a possible configuration for a public dummy endpoint.
de: Werfen Sie einen Blick :doc:`auf unsere Beispielkonfiguration </system/objects/external-data-source-example>`, wo Sie eine mögliche Konfiguration mit einen öffentlichen Dummy-Endpunkt finden.
sr: Погледајте :doc:`наш пример </system/objects/external-data-source-example>` са описом могућих подешавања за јавно доступну путању са лажним подацима.

source: Available settings for external data source fields
de: Verfügbare Einstellungen für externe Datenquelle Felder
sr: Доступна подешавања за поља удаљеног извора података

source: Search URL
de: Such-URL
sr: URL за претрагу

source: Set your endpoint where Zammad fetches the data. Please make sure to include a valid search :doc:`variable </misc/variables>` as an URL parameter. Example for a free text search at user input: ``#{search.term}``
de: Legen Sie den Endpunkt fest, an dem Zammad die Daten abruft. Bitte stellen Sie sicher, dass Sie eine gültige :doc:`Variable </misc/variables>` als URL-Parameter angeben. Beispiel für eine Freitextsuche bei Benutzereingabe: ``#{suche.begriff}``
sr: Одређује путању одакле Zammad преузима податке. Молимо обезбедите исправну :doc:`променљиву </misc/variables>` претраге као URL параметар. Пример за текстуалну претрагу на основу корисничког уноса: ``#{search.term}``

source: If in doubt, ask the responsible person for the external data source how they expect the structure of the URL.
de: Fragen Sie im Zweifelsfall die für die externe Datenquelle verantwortliche Person, wie die Struktur der URL aufgebaut sein muss.
sr: Уколико нисте сигурни, приупитајте особу одговорну за удаљени извор података какву структуру URL адресе очекују.

source: Depending on your search variable, the preview might work or not. The reason is that the context might not be available and it is no bug.
de: Je nach Suchvariable kann die Vorschau ggf. nicht funktionieren. Der Grund dafür ist, dass der Objektkontext in der Konfiguration möglicherweise nicht verfügbar ist. Dies ist kein Fehler.
sr: У зависности од ваше променљиве претраге, приказ може али и не мора функционисати. Разлог је да контекст претраге можда није доступан и ово технички није грешка.

source: Please also make sure to use a variable which is available in your object context. For example you won't be able to search for a ticket in a user object context.
de: Achten Sie bitte auch darauf, dass Sie eine Variable verwenden, die in Ihrem Objektkontext verfügbar ist. Zum Beispiel können Sie in einem Benutzerobjektkontext nicht nach einem Ticket suchen.
sr: Такође морате обезбедити да користите променљиве које су доступне у контексту вашег објекта. На пример нећете моћи да претражујете за тикете у контексту објекта корисника.

source: SSL Verification
de: SSL-Verizifierung
sr: SSL провера

source: Here you can switch the SSL verification to no.
de: Hier können Sie die SSL-Verifizierung auf nein stellen.
sr: Овде можете поставити SSL проверу на не.

source: If your external data source system is using self signed certificates, please have a look :doc:`here </settings/security/ssl-certificates>` for further information about how to handle them in Zammad, so you can keep the SSL verification activated.
de: Wenn Ihr externes Datenquellensystem selbstsignierte Zertifikate verwendet, sehen Sie sich bitte :doc:`SSL Zertifikate </settings/security/ssl-certificates>` an. Dort finden Sie weitere Informationen darüber, wie diese in Zammad hinterlegt werden können, damit Sie die SSL-Verifizierung aktiviert lassen können.
sr: Уколико ваш удаљени извор података користи прилагођени сертификат, молимо погледајте :doc:`овде </settings/security/ssl-certificates>` за више детаља како да их увезете у Zammad, тако да можете да оставите укључену SSL проверу.

source: HTTP Authentication
de: HTTP-Authentifizierung
sr: HTTP аутентификација

source: If your external data source requires an authentication, you can set it here. You can leave it empty or choose between *Basic Authentication* or *Authentication Token* (selecting one of the two methods leads to additional fields where you can enter your credentials/token).
de: Wenn Ihre externe Datenquelle eine Authentifizierung erfordert, können Sie diese hier hinterlegen. Sie können es leer lassen oder zwischen *Basis Authentifizierung* oder *Token Authentifizierung* wählen (die Auswahl einer der beiden Methoden führt zu zusätzlichen Feldern, in die Sie Ihre Anmeldedaten/Token eingeben können).
sr: Уколико ваш удаљени извор података захтева аутентификацију, можете је подесити овде. Можете је оставити празном или изабрати између *Basic Authentication* или *Аутентификациони кључ* (одабиром једног од два метода биће приказана додатна поља где можете унети ваше креденцијале/кључ).

source: Search result list key
de: Schlüssel der Suchergebnisliste
sr: Кључ листе резулата претраге

source: Defines the level in the JSON structure which provides the list with search results. You can leave it empty, if the data is already provided as an array. If you have to go deeper in the structure, you can provide a path with ``.`` as separators, e.g. ``key.subkey.sub-sub-key``.
de: Definiert die Ebene in der JSON-Struktur, die die Liste mit den Suchergebnissen liefert. Sie können es leer lassen, wenn die Daten bereits als Array bereitgestellt werden. Wenn Sie tiefer in die Struktur gehen müssen, können Sie einen Pfad mit ``.`` als Trennzeichen angeben, z.B. ``key.subkey.sub-sub-key``.
sr: Одређује ниво у JSON структури који обезбеђује листу резултата претраге. Можете га оставити празним, уколико су подаци већ доступни као низ. Ако желите да идете дубље по структури, можете обезбедити путању са ``.`` као сепаратором, нпр. ``key.subkey.sub-sub-key``.

source: Search result value key
de: Schlüssel Suchergebnis-Wert
sr: Кључ вредности резулата претраге

source: Defines the attribute in the structure in which your external data source provides the *value* for your data. An example would be a product *number*. If you have to go deeper in the structure, you can provide a path with ``.`` as separators, e.g. ``key.subkey.sub-sub-key``.
de: Definiert das Attribut in der Struktur, in der Ihre externe Datenquelle den *Wert* für Ihre Daten liefert. Ein Beispiel wäre eine Produkt *Nummer*. Wenn Sie tiefer in die Struktur eindringen müssen, können Sie einen Pfad mit ``.`` als Trennzeichen angeben, z.B. ``key.subkey.sub-sub-key``.
sr: Одређује атрибут у структури у ком ваш удаљени извор података обезбеђује *вредност*. Пример би представљао *број* производа. Уколико желите да идете дубље по структури, можете обезбедити путању са ``.`` као сепаратором, нпр. ``key.subkey.sub-sub-key``.

source: Search result label key
de: Schlüssel der Suchergebnisbezeichnung
sr: Кључ ознаке резулата претраге

source: Defines the attribute in the structure in which your external data source provides the *label* for your data. An example would be a product *name*. If you have to go deeper in the structure, you can provide a path with ``.`` as separators, e.g. ``key.subkey.sub-sub-key``.
de: Definiert das Attribut in der Struktur, in der Ihre externe Datenquelle die *Bezeichnung* für Ihre Daten bereitstellt. Ein Beispiel wäre ein Produkt *Name*. Wenn Sie tiefer in die Struktur eindringen müssen, können Sie einen Pfad mit ``.`` als Trennzeichen angeben, z.B. ``key.subkey.sub-sub-key``.
sr: Одређује атрибут у структури у ком ваш удаљени извор података обезбеђује *ознакз*. Пример би представљао *назив* производа. Уколико желите да идете дубље по структури, можете обезбедити путању са ``.`` као сепаратором, нпр. ``key.subkey.sub-sub-key``.

source: In the preview area, you can find the following items (depending on your configuration above):
de: Im Vorschaubereich finden Sie die folgenden Elemente (abhängig von bisheriger Konfiguration):
sr: У одељку приказа, можете наћи следеће ставке (у зависности од ваших подешавања изнад):

source: **Error/hint message** (only if configuration is not complete): Zammad tells you, if there is a problem and what you should change in your configuration.
de: **Fehler-/Hinweismeldung** (nur wenn die Konfiguration nicht vollständig ist): Zammad sagt Ihnen, ob es ein Problem gibt und was Sie an Ihrer Konfiguration ändern sollten.
sr: **Порука са грешком/упутством** (само ако подешавање није комплетно): Zammad ће вас упутити на то ако постоји проблем и шта треба да промените у вашим подешавањима.

source: **Search field**: search for an existing attribute in the data source to get a preview. This is required for the fields below to show up.
de: **Suchfeld**: Suchen Sie nach einem vorhandenen Attribut in der Datenquelle, um eine Vorschau zu erhalten. Dies ist erforderlich, damit die nachstehenden Felder angezeigt werden können.
sr: **Поље претраге**: претрага за постојећи унос у удаљеном извору у сврху приказа. Ово поље је обавезно да би се поља испод приказала.

source: **Search result response** (only if configuration is not complete): here you can find a syntax highlighted JSON preview of the response, based on the search term you entered.
de: **Antwort Suchergebnis** (nur wenn die Konfiguration nicht vollständig ist): Hier finden Sie eine syntaktisch hervorgehobene JSON-Vorschau der Antwort, die auf dem eingegebenen Suchbegriff basiert.
sr: **Одговор резултата претраге** (само ако подешавање није комплетно): овде можете пронаћи JSON приказ одговора у боји, на основу унетих кључних речи за претрагу.
