Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: If you already use this webhook and *didn't customize* the payload, the new webhook is used automatically after updating Zammad. In this case, you just need to create the workflow for your channel in Microsoft Teams. Otherwise you have to manually adjust the payload in Zammad, too. See :doc:`Microsoft Teams Payload </manage/webhook/examples/microsoft-teams-payload>` where you can find the old and new defaults in case you need it.
de: Wenn Sie diesen Webhook bereits verwenden und den Payload nicht angepasst haben, wird der neue Webhook nach der Aktualisierung von Zammad automatisch verwendet. In diesem Fall müssen Sie nur den Workflow für Ihren Kanal in Microsoft Teams erstellen. Andernfalls müssen Sie den Payload auch in Zammad manuell anpassen. Siehe :doc:`Microsoft Teams Payload </manage/webhook/examples/microsoft-teams-payload>`, wo Sie den alten und den neuen Payload finden können, falls Sie sie benötigen.
sr: Уколико већ користите овај повратни позив и *нисте прилагодили* садржај, нова верзија повратног позива ће се користити по ажурирању Zammad-а. У овом случају, неопходно је само да направите Workflow за ваш Microsoft Teams канал. У супротном, мораћете и да ручно подесите садржај у Zammad-у. Погледајте doc:`одељак о Microsoft Teams садржају </manage/webhook/examples/microsoft-teams-payload>` где можете пронаћи старе и нове подразумеване вредности уколико су вам неопходне.

source: To manage the connection in Zammad, you can go on with **step 2** on this page.
de: Um die Verbindung in Zammad zu verwalten, fahren Sie mit **Schritt 2** auf dieser Seite fort.
sr: Да бисте подесили везу у Zammad-у, можете да наставите са **кораком 2** на овој страни.

source: Follow the steps below to configure a webhook for receiving Zammad notifications in a Microsoft Teams channel.
de: Führen Sie die folgenden Schritte aus, um einen Webhook für den Empfang von Zammad-Benachrichtigungen in einem Microsoft Teams-Kanal zu konfigurieren.
sr: Пратите доле наведене кораке да бисте подесили повратни позив за примање Zammad обавештења у Microsoft Teams каналу.

source: Step 1 - Setup Incoming Webhook Connector in your Teams Channel
de: Schritt 1 - Einrichten des eingehenden Webhook-Connectors in Ihrem Teams-Kanal
sr: Корак 1 - Подесите Incoming Webhook Connector у вашем Teams каналу

source: In your target Teams Channel, click on the overflow menu in the upper right corner and choose **Connectors**.
de: Klicken Sie in Ihrem Ziel-Teams-Channel auf das Menü in der oberen rechten Ecke und wählen Sie **Connectors**.
sr: У вашем циљном Teams каналу кликните на контекстни мени у горњем десном углу и изаберите **Connectors**.

source: Connectors menu item in a Teams Channel
de: Menüpunkt "Connectors" in einem Teams Channel
sr: Ставка менија Connectors у Teams каналу

source: Find a connector named **Incoming Webhook** in the list and click on **Configure** button next to it.
de: Suchen Sie in der Liste einen Connector mit dem Namen **Eingehender Webhook** und klicken Sie auf die Schaltfläche **Konfigurieren** daneben.
sr: Пронађите конектор под називом **Incoming Webhook** у листи и кликните на дугме **Configure** поред њега.

source: Incoming Webhook in the Connectors list
de: Eingehender Webhook in der Liste der Konnektoren
sr: Incoming Webhook у листи конектора

source: Provide an appropriate name for the incoming webhook connector, keeping in mind this will be used as the name for all of the notification messages in the channel.
de: Geben Sie einen geeigneten Namen für den Webhook-Connector an. Dieser wird als Name für alle Benachrichtigungen im Kanal verwendet.
sr: Наведите одговарајући назив за Incoming Webhook Connector, имајући на уму да ће се ово користити као назив свих порука са обавештењима у каналу.

source: Optionally, provide a custom image which will be used as the avatar.
de: Optional können Sie ein benutzerdefiniertes Bild angeben, das als Avatar verwendet werden soll.
sr: Опционо, приложите прилагођену сличицу која ће се користити као аватар.

source: Creating Incoming Webhook Connector
de: Eingehenden Webhook-Konnektor erstellen
sr: Додавање Incoming Webhook конектора

source: Click on **Create** and be patient.
de: Klicken Sie auf **Erstellen** und haben Sie etwas Geduld.
sr: Кликните на **Create** и будите стрпљиви.

source: Copying Incoming Webhook Connector URL
de: Eingehende Webhook Connector URL kopieren
sr: Копирање URL адресе Incoming Webhook Connector

source: Finally, close the connector configuration by clicking **Done**.
de: Beenden Sie die Konfiguration des Connectors, indem Sie auf **Fertig** klicken.
sr: На крају, затворите подешавање конектора кликом на **Done**.

source: In the subsequent modal dialog, select **Microsoft Teams Notifications** as the pre-defined webhook.
de: Wählen Sie im folgenden Dialogfeld **Microsoft Teams Notifications** als vordefinierten Webhook aus.
sr: У следећем модалном дијалогу изаберите **Microsoft Teams обавештења** као шаблон повратног позива.

source: New Microsoft Teams Notifications Pre-defined Webhook modal
de: Dialog "Neuer Webhook" für vordefinierte Microsoft Teams-Benachrichtigungen
sr: Дијалог новог повратног позива по шаблону Microsoft Teams обавештења

source: In the new dialog, paste *the webhook endpoint URL* from Microsoft Teams into **Endpoint** field.
de: Fügen Sie im neuen Dialog die *webhook endpoint URL* von Microsoft Teams in das Feld **Endpunkt** ein.
sr: У новом дијалогу налепите *Webhook endpoint URL* из Microsoft Teams-а у поље **Путања**.

source: Configuring Microsoft Teams Webhook endpoint
de: Konfigurieren des Microsoft Teams Webhook-Endpunkts
sr: Подешавање путање Microsoft Teams повратног позива

source: As a last step, you need to create a :doc:`Trigger <generic-notifications-trigger>` for posting a notification to the Microsoft Teams channel under certain conditions.
de: Als letzten Schritt müssen Sie einen :doc:`Trigger <generic-notifications-trigger>` erstellen, um unter bestimmten Bedingungen eine Benachrichtigung an den Microsoft Teams-Kanal zu senden.
sr: Као последњи корак, потребно је да направите :doc:`окидач <generic-notifications-trigger>` за постављање обавештења у Microsoft Teams канал под одређеним условима.

source: From now on, whenever a ticket is created or updated in your Zammad system, a suitable notification will be posted in the configured Teams Channel. The notification will contain the link to the ticket, updated data and :ref:`content of the last article <teams-removing-article-body>`. It will also also be :user-docs:`color coded </basics/service-ticket/settings/state.html#state-colors>` according to its latest state.
de: Von nun an wird jedes Mal, wenn ein Ticket in Ihrem Zammad-System erstellt oder aktualisiert wird, eine entsprechende Benachrichtigung in dem konfigurierten Teams-Kanal gepostet. Die Benachrichtigung enthält den Link zum Ticket, die aktualisierten Daten und den :ref:`Inhalt des letzten Artikels <teams-removing-article-body>`. Außerdem wird sie entsprechend ihrem letzten Status :user-docs:`farblich gekennzeichnet</basics/service-ticket/settings/state.html#state-colors>`.
sr: Од сада, кад год се тикет дода или освежи у вашем Zammad систему, одговарајуће обавештење ће бити објављено у подешеном Teams каналу. Обавештење ће садржати линк до тикета, освежене податке и :ref:`садржај последњег чланка <teams-removing-article-body>`. Такође ће бити означен :user-docs:`бојом </basics/service-ticket/settings/state.html#state-colors>` према најновијем стању.

source: Removing Article Content from the Teams Notification
de: Entfernen des Artikelinhalts aus der Teams-Benachrichtigung
sr: Уклањање садржаја чланка из Teams обавештења

source: Next, identify ``{ "text": "#{notification.body}" }`` block in the JSON structure and select it. Be sure to include the comma (``,``) in the preceding line, since the new payload must remain a valid JSON value.
de: Identifizieren Sie dann den Block ``{"text": "#{notification.body}" }`` in der JSON-Struktur und wählen Sie ihn aus. Achten Sie darauf, dass das Komma (``,``) in der vorangehenden Zeile enthalten ist, da der Payload weiterhin gültig sein muss.
sr: Затим идентификујте ``{ "text": "#{notification.body}" }`` блок у JSON структури и обележите га. Обавезно укључите зарез (``,``) у претходни ред, пошто нова структура мора да остане исправна JSON вредност.

source: Custom Payload with Article Content
de: Benutzerdefinierter Payload mit Inhalt des Artikels
sr: Прилагођени подаци са садржајем чланка

source: Then, simply delete the selected code block.
de: Löschen Sie dann einfach den ausgewählten Codeblock.
sr: Затим једноставно избришите обележени блок кода.

source: Custom Payload w/o Article Content
de: Benutzerdefinierter Payload ohne Inhalt des Artikels
sr: Прилагођени подаци без садржаја чланка

source: Microsoft is retiring their Office 365 connectors in favor of connecting third-party tools via their Workflows. Because of that, the pre-defined webhook in Zammad has changed. In case you need the old or new default payload, you can find them below.
de: Für die Anbindung von Drittanbieter-Tools stellt Microsoft seine Office 365-Konnektoren zugunsten der Workflows-Variante ein. Aus diesem Grund hat sich der vordefinierte Webhook in Zammad geändert. Falls Sie den alten oder neuen Standard-Payload benötigen, finden Sie diese unten.
sr: Microsoft повлачи своје Office 365 конекторе у корист повезивања алата треће стране преко своји Workflows. Услед овога, предефинисани повратни позив у Zammad-у је измењен. У случају да су вам потребне вредности старог и новог подразумеваног садржаја, можете их пронаћи испод.

source: Payload for Office Connectors (old)
de: Payload für Office Konnektoren (alt)
sr: Садржај за Office конекторе (стари)

source: Payload for Workflows (new)
de: Payload für Workflows (neu)
sr: Садржај за Worfklows (нови)

source: Ntfy Notifications
de: Ntfy-Benachrichtigungen
sr: Ntfy обавештења

source: Follow the steps below to configure a webhook for sending notification via `ntfy <https://ntfy.sh>`_. Have a look at their `documentation <https://docs.ntfy.sh/>`_ for more information and custom configuration.
de: Führen Sie die folgenden Schritte aus, um einen Webhook für das Senden von Benachrichtigungen über `ntfy <https://ntfy.sh>`_ zu konfigurieren. Weitere Informationen und eine individuelle Konfiguration finden Sie in deren Dokumentation <https://docs.ntfy.sh/>`_.
sr: Пратите кораке испод за постављање повратног позива за слање обавештења преко `ntfy <https://ntfy.sh>`_. Погледајте њихову `званичну документацију <https://docs.ntfy.sh/>`_ за детаље и прилагођену конфигурацију.

source: This example guides you through a basic setup. Depending on your setup and use case, steps and available options may differ.
de: Dieses Beispiel führt Sie durch eine Grundeinrichtung. Je nach Ihrer Umgebung und Ihrem Anwendungsfall können die Schritte und verfügbaren Optionen abweichen.
sr: Овај пример вас води кроз основнз поставку. У зависности од ваше ситуације, кораци и доступне опције се могу разликовати.

source: Step 1 - Setup Ntfy Topic
de: Schritt 1 - Ntfy-Thema einrichten
sr: Корак 1 - Подешавање ntfy теме

source: Go to ntfy and create a new topic by using the **Subscribe to topic** button. Either configure access to this topic (in case you are a ntfy Pro user) or choose a random topic.
de: Gehen Sie zu ntfy und erstellen Sie ein neues Thema, indem Sie die Schaltfläche **Thema abonnieren** verwenden. Konfigurieren Sie entweder den Zugang zu diesem Thema (falls Sie ein ntfy Pro Benutzer sind) oder wählen Sie einen zufälligen Namen.
sr: Идите на ntfy и додајте нову тему коришћењем дугмета **Subscribe to topic**. Или подесите приступ овог теми (у случају да сте корисник ntfy Pro) или одаберите случајну тему.

source: Subscribe to topic dialog from ntfy
de: Dialog Thema abonnieren von ntfy
sr: Ntfy дијалог „Subscribe to topic”

source: Once created, make sure to copy your topic name to clipboard and save it for later.
de: Kopieren Sie den Namen Ihres Themas in die Zwischenablage und speichern Sie ihn für später.
sr: Након додавања, обавезно ископирајте наслов теме у привремену меморију и сачувајте је за касније.

source: If you want to password protect your channel, you have to use basic auth in your webhook with username and password. See `ntfy documentation <https://docs.ntfy.sh/publish/#username-password>`_ for more information.
de: Wenn Sie Ihren Kanal mit einem Passwort schützen wollen, müssen Sie in Ihrem Webhook die Basisauthentifizierung mit Benutzernamen und Passwort verwenden. Siehe `ntfy Dokumentation <https://docs.ntfy.sh/publish/#username-password>`_ für weitere Informationen.
sr: Уколико желите да заштитите свој канал лозинком, морате користити basic auth у вашем повратном позиву путем корисничког имена и лозинке. Погледајте `ntfy документацију <https://docs.ntfy.sh/publish/#username-password>`_ за детаље.

source: Step 2 - Add a New Webhook with Custom Payload
de: Schritt 2 - Hinzufügen eines neuen Webhooks mit benutzerdefinierten Nutzdaten
sr: Корак 2 - Додајте нови повратни позив са прилагођеним подацима

source: Go to :doc:`Webhook </manage/webhook/add>` management screen in your Zammad instance and click on the **New Webhook** button. Activate the "Custom Payload" toggle and add your information like in the example.
de: Gehen Sie in Ihrer Zammad-Instanz zur Verwaltung von :doc:`Webhooks </manage/webhook/add>` und klicken Sie auf die Schaltfläche **Neuer Webhook**. Aktivieren Sie den Schalter "Eigene Nutzlast" und fügen Sie Ihre Informationen wie im Beispiel hinzu.
sr: Идите на екран управљања :doc:`повратним позивима </manage/webhook/add>` у вашој Zammad инстанци и кликните на дугме **Нови повратни позив**. Укључите прекидач „Прилагођени подаци” и унесите ваше податке по примеру испод.

source: Depending on the features you want to use and your ntfy plan, it might be required to provide ``HTTP Basic Authentication Username`` as well as the appropriate password.
de: Abhängig von den Funktionen, die Sie nutzen möchten, und von Ihrem ntfy-Plan kann es erforderlich sein, sowohl den ``HTTP Basic Authentication Benutzername`` als auch das entsprechende Passwort anzugeben.
sr: У зависности од функција које желите да користите и вашег ntfy плана, можда ћете морати да унесете ``HTTP basic auth корисник`` као и одговарајућу лозинку.

source: Webhook creation / edit dialog in Zammad with ntfy example
de: Webhook Erstellungs-/Bearbeitungsdialog in Zammad mit ntfy-Beispiel
sr: Дијалог додавања / уређивања повратног позива у Zammad-у са ntfy примером

source: You can find the example payload below. Important attributes are:
de: Sie finden die Beispiel-Nutzlast unten. Wichtige Attribute sind:
sr: Пример података можете пронаћи испод. Важни параметри су:

source: ``topic``: name of your topic. You might have copied it in Step 1.
de: ``topic``: Name des Themas. Ggf. haben Sie es in Schritt 1 kopiert.
sr: ``topic``: назив ваше теме. Вероватно сте га ископирали у кораку 1.

source: ``title``: the title/heading of the notification.
de: ``title``: der Titel der Meldung.
sr: ``title``: наслов/заглавље обавештења.

source: ``message``: the message of your notification. You can use Zammad variables as you can see in the example.
de: ``message``: die Nachricht bzw. der Text Ihrer Benachrichtigung. Sie können Zammad-Variablen verwenden, wie Sie im Beispiel sehen können.
sr: ``message``: порука вашег обавештења. Можете користити Zammad променљиве као у примеру.

source: Additional attributes can be:
de: Zusätzliche mögliche Attribute:
sr: Додатни параметри могу бити:

source: ``priority``: priority of the notification from ``1`` - ``5``. This option defines how the notification is categorized on client devices.
de: ``priority``: Priorität der Benachrichtigung von ``1`` - ``5``. Diese Option legt fest, wie die Benachrichtigung auf Client-Geräten kategorisiert wird.
sr: ``priority``: приоритет обавештења од ``1`` – ``5``. Овај параметар одређује како ће обавештење бити категоризовано на клијент уређајима.

source: ``click``: URL to open if the notification is clicked.
de: ``click``: URL, die geöffnet wird, wenn die Benachrichtigung angeklickt wird.
sr: ``click``: URL адреса која ће бити отворена по клику на обавештење.

source: ``icon``: icon of your notification. Can be a a link to a .png or .jpg file.
de: ``icon``: Symbol für Ihre Benachrichtigung. Kann ein Link zu einer .png oder .jpg Datei sein.
sr: ``icon``: иконица вашег обавештења. Можете бити линк на .png или .jpg датотеку.

source: ``actions``: define quick actions which can be executed directly from the notification.
de: ``actions``: Definieren Sie schnelle Aktionen, die direkt aus der Meldung heraus ausgeführt werden können.
sr: ``actions``: одређује брзе радње које се могу извршити директно из обавештења.

source: For detailed information about the possible actions, have a look at the ntfy `action button documentation <https://docs.ntfy.sh/publish/#action-buttons>`_.
de: Ausführliche Informationen über die möglichen Aktionen finden Sie in der Dokumentation zu ntfy `Action Buttons <https://docs.ntfy.sh/publish/#action-buttons>`_.
sr: За детаљне инфомрације о могућим радњама, погледајте ntfy `документацију о дугмићима радњи <https://docs.ntfy.sh/publish/#action-buttons>`_.

source: For actions to work, you need to self host ntfy and adjust your CORS value in NGINX.
de: Damit die Aktionen funktionieren, müssen Sie ntfy selbst hosten und Ihre CORS-Einstellung in NGINX anpassen.
sr: Да би радње функционисале, мораћете да сами хостујете ntfy и да подесите CORS вредности у вашем nginx проксију.

source: Step 3 - Configuring a Trigger for Firing the Webhook
de: Schritt 3 - Konfigurieren eines Triggers zum Auslösen des Webhooks
sr: Корак 3 – Подешавање окидача за покретање повратног позива

source: As a last step, you need to create a :doc:`Trigger <generic-notifications-trigger>` for triggering a notification. Define a condition, in which cases a notification should be generated and select your webhook as action.
de: Als letzten Schritt müssen Sie einen :doc:`Trigger <generic-notifications-trigger>` zum Auslösen einer Benachrichtigung erstellen. Definieren Sie eine Bedingung, in welchen Fällen eine Benachrichtigung generiert werden soll und wählen Sie Ihren Webhook als Aktion.
sr: Као последњи корак, потребно је да направите :doc:`окидач <generic-notifications-trigger>` за покретање обавештења. Одредите услове, у ком случају обавештење треба да буде послато и одаберите ваш повратни позив као радњу.

source: Sample NTFY Channel Notification
de: Beispiel einer NTFY-Benachrichtigung
sr: Пример ntfy обавештења

source: From now on, a notification will be pushed to ntfy and all subscribed devices. The notification contains the link to the ticket, an image and action buttons, depending on what you configured.
de: Von nun an wird eine Benachrichtigung an ntfy und alle abonnierten Geräte gesendet. Die Benachrichtigung enthält den Link zum Ticket, ein Bild und Aktionsschaltflächen, abhängig davon, was Sie konfiguriert haben.
sr: Од сада, обавештење ће бити послато на ntfy и све претплаћене уређаје. Обавештење садржи линк на тикет, сличицу и дугмиће радње, у зависности од ваше конфигурације.

source: Sample notification in the ntfy web dashboard
de: Beispiel einer Benachrichtigung im ntfy-Web-Dashboard
sr: Пример обавештења на ntfy веб контролној табли

source: Rocket Chat Notifications
de: Benachrichtigungen für Rocket Chat
sr: Rocket Chat обавештења

source: Follow the steps below to configure a webhook for receiving Zammad notifications in a Rocket Chat channel.
de: Führen Sie die folgenden Schritte aus, um einen Webhook für den Empfang von Zammad-Benachrichtigungen in einem Rocket Chat-Kanal zu konfigurieren.
sr: Пратите доле наведене кораке да бисте подесили повратни позив за примање обавештења Zammad-а у Rocket Chat каналу.

source: Step 1 - Setup Incoming Webhooks Integration for your Rocket Chat Channel
de: Schritt 1 - Einrichten der Integration eingehender Webhooks für Ihren Rocket Chat-Kanal
sr: Корак 1 - Подесите Incoming Webhooks интеграцију за ваш Rocket Chat канал

source: In your Rocket Chat overflow administration menu, choose **Workspace**.
de: Wählen Sie in Ihrem Rocket Chat Administrationsmenü **Workspace**.
sr: У менију администрације Rocket Chat-а изаберите **Workspace**.

source: Workspace menu item in Rocket Chat
de: Workspace Menü in Rocket Chat
sr: Ставка менија Workspace у Rocket Chat-у

source: In the left sidebar choose **Integrations** and then click on the **New** button in the upper right corner.
de: Wählen Sie in der linken Seitenleiste **Integrationen** und klicken Sie dann auf die Schaltfläche **Neu** in der oberen rechten Ecke.
sr: На левој страни изаберите **Integrations**, а затим кликните на дугме **New** у горњем десном углу.

source: New Integration button in Rocket Chat
de: Schaltfläche "Neue Integration" in Rocket Chat
sr: Дугме New Integration у Rocket Chat-у

source: First, turn on the **Enabled** switch on top.
de: Schalten Sie zunächst die Funktion mit dem Schalter oben ein (**Aktiviert**).
sr: Прво укључите прекидач **Enabled** при врху.

source: Provide an appropriate **Name** for the incoming integration and enter the target channel into **Post to Channel** field, in ``#channel-name`` format.
de: Geben Sie einen geeigneten **Name** für die eingehende Integration an und geben Sie den Zielkanal im Feld **Post to Channel** im Format ``#channel-name`` ein.
sr: Наведите одговарајући **Name** за долазну интеграцију и унесите циљни канал у поље **Post to Channel**, у формату ``#channel-name``.

source: Enter the Rocket Chat username into **Post as** field, without the ``@`` prefix. Note that the username must already exist.
de: Geben Sie den Rocket Chat-Benutzernamen in das Feld **Post as** ein, ohne den Präfix ``@``. Beachten Sie, dass der Benutzername bereits existieren muss.
sr: Унесите корисничко име за Rocket Chat у поље **Post as**, без префикса ``@``. Имајте на уму да корисничко име мора већ постојати.

source: Incoming Integration Setup
de: Einrichtung der eingehenden Integration
sr: Подешавање долазне интеграције

source: Scroll to the end of the form and click on **Save** button.
de: Scrollen Sie bis zum Ende des Formulars und klicken Sie auf die Schaltfläche **Speichern**.
sr: Дођите до краја форме и кликните на дугме **Save**.

source: Once successfully saved, make sure to copy *the webhook endpoint URL* to clipboard and save it for later. You can do this in one click via the button shown inside the field.
de: Kopieren Sie nach erfolgreicher Speicherung die Webhook-Endpunkt-URL in die Zwischenablage und speichern Sie sie für später. Sie können dies mit einem Klick über den Button im Feld tun.
sr: Када се успешно сачува, обавезно копирајте *Webhook endpoint URL* у привремену меморију и сачувајте га за касније. То можете учинити једним кликом преко дугмета приказаног унутар поља.

source: Copying Incoming Integration URL
de: Integrations-URL (eingehend) kopieren
sr: Копирање долазне URL адресе интеграције

source: Finally, close the Administration panel by clicking on ``X`` on the left side.
de: Schließen Sie dann das Administrationsfenster, indem Sie auf der linken Seite auf ``X`` klicken.
sr: Коначно, затворите административни панел кликом на ``X`` са леве стране.

source: In the subsequent modal dialog, select **Rocket Chat Notifications** as the pre-defined webhook.
de: Wählen Sie im folgenden Dialogfeld **Rocket Chat Notifications** als vordefinierten Webhook aus.
sr: У следећем модалном дијалогу изаберите **Rocket Chat обавештења** као шаблон повратног позива.

source: New Rocket Chat Notifications Pre-defined Webhook modal
de: Dialog "Neuer Webhook" für vordefinierte Rocket Chat-Benachrichtigungen
sr: Дијалог новог повратног позива по шаблону Rocket Chat обавештења
