Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: If you want to use a custom reminder message before the 24-hour customer service window closes, you can insert it here. Leave it empty to stay with the default message.
de: Wenn Sie eine benutzerdefinierte Erinnerungs-Nachricht vor dem Schließen des 24-Stunden-Kundenservice-Fensters verwenden möchten, können Sie sie hier einfügen. Lassen Sie das Feld leer, um die Standardnachricht beizubehalten.
sr: Уколико желите да користите прилагођену поруку подсетника пре него што се 24-часовном временски оквир за комуникацију са клијентом затвори, можете га унети овде. Оставите поље празним да бисте користили подразумевану поруку.

source: Target Group
de: Gruppe
sr: Циљна група

source: Here you can define the :doc:`group </manage/groups/index>` in which the ticket should be created.
de: Hier können Sie die :doc:`Gruppe </manage/groups/index>` definieren, in der das Ticket erstellt werden soll.
sr: Овде можете одредити :doc:`групу </manage/groups/index>` у којој ће бити отворани тикети.

source: After entering your data, click on **Submit**. After this step, the WhatsApp channel is technically created. However, there is another important step to take.
de: Nachdem Sie Ihre Daten eingegeben haben, klicken Sie auf **Übermitteln**. Nach diesem Schritt ist der WhatsApp-Kanal technisch erstellt. Es gibt jedoch noch einen weiteren wichtigen Schritt zu erledigen.
sr: По уносу ваших информација, кликните на **Пошаљи**. Након овог корака, WhatsApp канал ће бити додат. Међутим, неопходно је одрадити још један корак.

source: Step 3
de: Schritt 3
sr: Корак 3

source: This third step is about telling WhatsApp where they should send their data:
de: In diesem dritten Schritt geht es darum, WhatsApp mitzuteilen, wohin die Daten gesendet werden sollen:
sr: Трећи корак се бави подешавањем WhatsApp како да шаље своје податке:

source: If you don't follow the instructions properly, your account shows up but you aren't able to receive messages (because Meta/WhatsApp doesn't know where to send them)!
de: Wenn Sie die Anweisungen nicht befolgen wird Ihr Konto zwar angezeigt, aber Sie können keine Nachrichten empfangen (weil Meta/WhatsApp nicht weiß, wohin es sie senden soll)!
sr: Уколико не испратите упутства на правилан начин, ваш налог ће бити приказан али нећете бити у могућности да примате поруке (зато што Meta/WhatsApp не знају где да их пошаљу)!

source: Step 3 of adding a WhatsApp account
de: Schritt 3 des Hinzufügens eines WhatsApp Kontos
sr: Корак 3 приликом додавања WhatsApp налога

source: Click on the copy icon on the right side and head over to your WhatsApp business app. Enter the copied URL in the corresponding field in your app. You can find it in your `"App Dashboard" <https://developers.facebook.com/apps/>`_ under "WhatsApp > Configuration > Webhook > Callback URL" (see screenshot below). Paste it there.
de: Klicken Sie auf das Kopiersymbol auf der rechten Seite und gehen Sie zu Ihrer WhatsApp-Business-App. Geben Sie die kopierte URL in das entsprechende Feld in Ihrer App ein. Sie finden sie in Ihrem `"App Dashboard" <https://developers.facebook.com/apps/>`_ unter "WhatsApp > Konfiguration > Webhook > Callback URL" (siehe Screenshot unten). Fügen Sie sie dort ein.
sr: Кликните на иконицу копирања са десне стране и идите у вашу WhatsApp апликацију. Налепите ископирану адресу у одговарајуће поље ваше апликације. Можете га пронаћи у вашем `„App Dashboard” <https://developers.facebook.com/apps/>`_ под „WhatsApp > Configuration > Webhook > Callback URL” (погледајте снимак екрана испод). Налепите га ту.

source: Verify Token
de: Token verifizieren
sr: Верификациони кључ

source: Copy this string too. Enter it directly below the pasted Callback URL.
de: Kopieren Sie auch diese Zeichenfolge. Fügen Sie sie direkt unter der eingefügten Callback URL ein.
sr: Ископирајте овај низ такође. Унесите га одмах испод налепљене адресе повратног позива.

source: Configuration section in WhatsApp app dashboard
de: Konfigurationsbereich im Dashboard der WhatsApp-App
sr: Одељак подешавања у контролној табли WhatsApp апликације

source: After entering your data, click on **Verify and save** which triggers a check if your system is accessible and configured correctly.
de: Nachdem Sie Ihre Daten eingegeben haben, klicken Sie auf **Prüfen und speichern**, was eine Prüfung auslöst, ob Ihr System zugänglich und korrekt konfiguriert ist.
sr: По уносу ваших информација, кликните на **Verify and save** за проверу доступности вашег система и снимање подешавања.

source: Define webhook fields
de: Webhook-Felder definieren
sr: Подешавање поља повратног позива

source: Finally, go to the field below in the app dashboard and select "Manage" in the "Webhook fields" section. This is needed that you'll get the message as content:
de: Gehen Sie schließlich im Dashboard der App auf das Feld darunter und wählen Sie im Abschnitt "Webhook-Felder" die Option "Verwalten". Dies ist erforderlich, damit Sie die Nachricht als Inhalt übermittelt bekommen:
sr: Коначно, идите на поље испод у контролној табли апликације и кликните на „Manage” у одељку „Webhook fields”. Ово је непходно ради добијања садржаја поруке:

source: Select webhook fields in app dashboard
de: Webhook-Felder im App-Dashboard auswählen
sr: Одабир поља повратног позива у контролној табли апликације

source: Subscribe to "messages" by clicking in the checkbox:
de: Wählen Sie "Nachrichten", indem Sie das Kontrollkästchen anklicken:
sr: Претплатите се на „messages” кликом на поље потврде:

source: Select "message" as webhook field
de: Wählen Sie "Nachricht" als Webhook-Feld
sr: Изаберите „messages” као поље повратног позива

source: You should now see the selected "messages" under the "Webhook fields" caption as in the first screenshot.
de: Sie sollten nun die ausgewählte "Nachrichte" unter der Beschriftung "Webhook-Felder" sehen, wie auf dem ersten Screenshot zu sehen.
sr: Требало би да сада видите одабрано поље „messages” под насловом „Webhook fields” као на првом снимку екрана.

source: After finishing this step, you can click on the **Finish** button in Zammad and you should now be ready to receive tickets from your WhatsApp channel!
de: Nachdem Sie diesen Schritt abgeschlossen haben, können Sie in Zammad auf die Schaltfläche **Fertigstellen** klicken und Sie sollten nun Tickets über Ihren WhatsApp-Kanal empfangen können!
sr: По завршетку овог корака, можете кликнути на дугме **Заврши** у Zammad-у и бићете у могућности да примате тикете са вашег WhatsApp канала!

source: Manage
de: Verwalten
sr: Управљање

source: Channels
de: Kanäle
sr: Канали

source: AI
de: KI

source: API (System-Documentation)
de: API (System-Dokumentation)
sr: API (системска документација)

source: Misc
de: Verschiedenes
sr: Остало

source: Zammad Admin Documentation
de: Zammad Admin Dokumentation
sr: Zammad администраторска документација

source: You are currently reading the Zammad administration documentation. There are also :docs:`system </index.html>` and :user-docs:`user manuals </index.html>` available.
de: Sie lesen gerade die Zammad Admin Dokumentation. Es gibt außerdem :docs:`System- </index.html>` und :user-docs:`Benutzer-Dokumentationen</index.html>`.
sr: Тренутно читате документацију о администрацији Zammad-а. Доступни су и :docs:`системски </index.html>` и :user-docs:`кориснички </index.html>` приручници.

source: Calendars
de: Kalender
sr: Календари

source: A calendar is required to:
de: Ein Kalender ist notwendig für:
sr: Календар је неопходан за:

source: automate ticket escalations,
de: automatisierte Ticket-Eskalationen,
sr: аутоматизацију ескалације тикета,

source: generate reports that only capture activity during business hours, or
de: das Generieren von Berichten, die Aktivitäten nur innerhalb der Geschäftszeiten anzeigen oder
sr: генерисање извештаја који бележе активност само током радног времена, или

source: set up time-sensitive triggers.
de: die Konfiguration von zeitgesteuerten Triggern.
sr: подешавање временски осетљивих окидача.

source: Define a "standard"-calendar which system-wide is valid. Only in the specified business hours, escalation notifications are sent to agents.
de: Definieren Sie einen "Standard“-Kalender, der systemweit gültig ist. Nur während der angegebenen Geschäftszeiten werden Eskalationsbenachrichtigungen an Agenten gesendet.
sr: Одређује "стандардни" календар који је важећи за цео систем. Оператерима се шаљу обавештења о ескалацији само у наведеном радном времену.

source: If you have customers for which you have to comply with different customer business hours, you can create several calendars. The allocation to the customer tickets can be adjusted via the SLAs.
de: Wenn Sie für Kunden unterschiedliche Öffnungszeiten einhalten müssen, können Sie mehrere Kalender erstellen. Die Zuordnung zu den Kundentickets kann über die SLAs angepasst werden.
sr: Ако имате клијенте за које морате да се придржавате различитих радних сати, можете додати неколико календара. Додељивање за тикете клијената може се прилагодити путем SLA.

source: And this is what it looks like:
de: Und so sieht es aus:
sr: А овако то изгледа:

source: All created calendars are displayed in the overview.
de: Alle erstellten Kalender werden in der Übersicht angezeigt.
sr: Сви додати календари су приказани у прегледу.

source: New Calendar
de: Neuer Kalender
sr: Нови календар

source: Here you can create a new calendar if agents or customers belong to another time zone.
de: Hier können Sie einen neuen Kalender erstellen, wenn Agenten oder Kunden einer anderen Zeitzone angehören.
sr: Овде можете додати нови календар ако оператери или клијенти припадају другој временској зони.

source: Just push the delete-button to delete this specific calendar - all SLAs assigned to this calendar are automatically assigned to the default calendar.
de: Klicken Sie einfach auf die Schaltfläche "Löschen“, um diesen bestimmten Kalender zu löschen. Alle diesem Kalender zugewiesenen SLAs werden automatisch dem Standardkalender zugewiesen.
sr: Само притисните дугме за брисање да бисте избрисали одређени календар - сви SLA додељени овом календару се аутоматски додељују подразумеваном календару.

source: Set as Default
de: Als Standard setzen
sr: Подеси као подразумевано

source: Pressing this button sets this calendar as the default calendar for the entire system.
de: Dieser Button legt den Kalender als Standardkalender für das gesamte System fest.
sr: Притиском на ово дугме овај календар се поставља као подразумевани календар за цео систем.

source: Edit
de: Editieren
sr: Измени

source: Via this button you get to the edit-mask (same mask as in "New Calendar"):
de: Über diesen Button gelangen Sie zur Bearbeitungsmaske (gleiche Maske wie in "Neuer Kalender“):
sr: Преко овог дугмета долазите до дијалога за уређивање (иста форма као за „Нови календар“):

source: Determine a name, a time-zone, the business hours to be used for this calendar and special holidays. In addition, you can subscribe to the iCalendar, which will automatically load all holidays from Google (updated once a day) ... and you can add a note.
de: Legen Sie einen Namen, eine Zeitzone, die für diesen Kalender zu verwendenden Geschäftszeiten und besondere Feiertage fest. Darüber hinaus können Sie einen iCalendar abonnieren, der automatisch alle Feiertage von Google lädt (einmal täglich aktualisiert) ... und Sie können eine Notiz hinzufügen.
sr: Одредите назив, временску зону и радно време које ће се користити за овај календар и посебне празнике. Поред тога, можете се претплатити на iCalendar, који ће аутоматски учитавати све празнике са Google-а (ажурира се једном дневно) ... и можете додати напомену.

source: Checklist
de: Checkliste
sr: Списак задатака

source: The checklist feature allows agents to keep track of the tasks to be completed. It is activated by default and shows up in another tab in the right sidebar in the ticket view (see :user-docs:`here </extras/checklist.html>` what it looks like from agent's perspective).
de: Die Checkliste ermöglicht es Agenten, den Überblick über die zu erledigenden Aufgaben zu behalten. Das Feature ist standardmäßig aktiviert und wird in einem weiteren Tab in der rechten Seitenleiste der Ticket-Ansicht angezeigt (siehe :user-docs:`hier </extras/checklist.html>`, wie es aus der Sicht von Agenten aussieht).
sr: Функција списка задатака омогућује оператерима да прате ток решавања тикета. Подразумеваноје укључена и приказана је под посебним језичком у траци са десне стране приказа тикета (погледајте :user-docs:`овде </extras/checklist.html>` за изглед из перспективе оператера).

source: Screenshot showing checklist feature in admin area.
de: Screenshot zeigt Checklistenfunktion im Adminbereich.
sr: Снимак екрана који приказује функцију списка задатака у административном делу.

source: To activate/deactivate the feature, simply switch the toggle labeled with "Enable Checklists" at the top of the page.
de: Um die Funktion zu aktivieren/deaktivieren, klicken Sie einfach auf den Schalter mit der Aufschrift "Checklisten aktivieren" oben auf der Seite.
sr: За укључивање/искључивање функције, једноставно пребаците прекидач под називом „Укључи спискове задатака” при врху стране.

source: You can optionally create one or more templates with predefined checklist items. For this, just click on the "New Checklist Template" button and define the checklist name and items. After submitting the form, the template can be used in tickets.
de: Optional können Sie eine oder mehrere Vorlagen mit vordefinierten Checklistenelementen erstellen. Klicken Sie dazu einfach auf die Schaltfläche "Neue Checklistenvorlage" und legen Sie den Namen und die Elemente der Checkliste fest. Nach dem Absenden des Formulars kann die Vorlage in Tickets verwendet werden.
sr: Можете опционо додати један или више шаблона са предефинисаним задацима. Да наставите, једноставно кликните на дугме „Нови шаблон списка задатака” и одредите наслов списка и задатке. По слању форме, шаблон се можете користити у тикетима.

source: You can clone or delete a template by clicking on the ︙ button and selecting the corresponding action.
de: Sie können eine Vorlage klonen oder löschen, indem Sie auf die Schaltfläche ︙ klicken und die entsprechende Aktion auswählen.
sr: Можете клонирати или избрисати шаблон кликом на дугме ︙ и одабиром одговарајуће радње.

source: To edit the template, simply click on the name of the template. This opens a dialog where you can edit the checklist and the items (add, rename, reorder, delete them) and set the entire template to active/inactive.
de: Um die Vorlage zu bearbeiten, klicken Sie einfach auf den Namen der Vorlage. Daraufhin öffnet sich ein Dialog, in dem Sie die Checkliste und die Elemente bearbeiten (hinzufügen, umbenennen, neu anordnen, löschen) und die gesamte Vorlage auf aktiv/inaktiv setzen können.
sr: За уређивање шаблона, једноставно кликните на назив шаблона. Ово ће отворити дијалог где можете уредити списак и његове задатке (додати, променити назив, редослед, уклонити их) и поставити комплетан шаблон на укључено/искључено.

source: Screenshot showing the checklist template edit dialog.
de: Screenshot zeigt Bearbeitungsdialog für Checklistenvorlagen.
sr: Снимак екрана који приказује дијалог уређивања шаблона списка задатака.

source: Remarks
de: Anmerkungen
sr: Напомене

source: It is only possible to add one checklist per ticket.
de: Es kann nur eine Checkliste pro Ticket hinzuzugefügt werden.
sr: Могуће је додати само један списак задатака по тикету.

source: There is no specific permission for the checklist feature. You can turn it off or on and provide optionally usable checklist templates.
de: Es gibt keine eigene Berechtigung für die Checklistenfunktion. Sie können sie aus- oder einschalten und optional verwendbare Checklistenvorlagen bereitstellen.
sr: Не постоји посебна дозвола за функцију списка задатака. Можете опционо искључити ли укључити доступне шаблоне списка задатака.

source: If the agent has access to the ticket, they will also have access to its checklist.
de: Wenn ein Agent Zugriff auf das Ticket hat, hat er auch Zugriff auf dessen Checkliste.
sr: Уколико оператер има приступ тикету, имаће приступ и списку задатака.

source: If an agent only has reading permissions for this ticket, the checklist will be displayed in read-only mode.
de: Wenn ein Agent nur Leserechte für dieses Ticket hat, wird die Checkliste nur lesbar angezeigt.
sr: Уколико оператер има само дозволу прегледа тикета, списак задатака ће бити приказан у режиму читања.

source: Customers have no access to the checklists at all and do not see them.
de: Kunden haben keinen Zugriff auf die Checklisten und können sie nicht sehen.
sr: Клијенти немају приступ списковима задатака и неће их видети.

source: An agent can always overwrite and adjust the checklist, it can even be deleted from the ticket. This applies also to checklists which are added in a ticket based on a checklist template.
de: Ein Agent kann die Checkliste jederzeit überschreiben und anpassen, sie kann sogar aus dem Ticket gelöscht werden. Dies gilt auch für Checklisten, die auf Basis einer Checklistenvorlage in ein Ticket eingefügt werden.
sr: Уколико оператер може да пребрише и измени списак задатака, може га и уклонити из тикета. Ово се такође односи на спискове задатака који су додати у тикет на основу шаблона.

source: The checklist feature is currently a standalone feature. That means you can't access the items or state of the checkboxes from other places in Zammad like triggers or workflows.
de: Die Checklistenfunktion ist derzeit eine eigenständige Funktion. Das heißt, Sie können nicht von anderen Stellen in Zammad wie Triggern oder Workflows auf die Elemente oder den Status der Checkboxen zugreifen.
sr: Спискови задатака су тренутно одвојена функција. То значи да не можете приступити задацима или њиховом стању са других места у Zammad-у као што су окидачи или радни токови.

source: Group Permissions
de: Gruppenberechtigungen
sr: Групне дозволе

source: When assigning an agent to a :doc:`group </manage/groups/index>`, Zammad gives you fine-grained control over what actions that agent can perform within it:
de: Wenn Sie einen Agenten einer :doc:`Gruppe </manage/groups/index>` zuweisen, gibt Ihnen Zammad die Möglichkeit detailliert festzulegen, welche Aktionen dieser Agent ausführen kann:
sr: Када додељујете :doc:`групу </manage/groups/index>` оператеру, Zammad вам даје детаљну контролу над радњама које тај оператер може да изврши у њој:

source: The group permission setting in the Edit User dialog
de: Gruppenberechtigung im Dialog "Benutzer bearbeiten“
sr: Подешавање групних дозвола у дијалогу уређивања корисника

source: Use the group permission table to grant per-group privileges.
de: Verwenden Sie die Gruppenberechtigungstabelle, um Berechtigungen auf Gruppenbasis zu erteilen.
sr: Користите табелу групних дозвола да бисте дали дозволе на осноу група.

source: Within each group, the different permissions allow an agent to...
de: Innerhalb der einzelnen Gruppe ermöglichen die unterschiedlichen Berechtigungen einem Agenten...
sr: За сваку групу, различите дозволе омогућавају оператеру да…

source: READ
de: LESEN
sr: ЧИТАЊЕ

source: ...view tickets
de: ... Tickets einzusehen
sr: …погледа тикете

source: CREATE
de: ERSTELLEN
sr: ДОДАВАЊЕ

source: ...create new tickets
de: ... neue Tickets zu erstellen
sr: …отвара нове карте

source: CHANGE
de: ÄNDERN
sr: ИЗМЕНА

source: ...modify existing tickets
de: ... bestehende Tickets zu aktualisieren
sr: …освежи постојеће тикете

source: OVERVIEW
de: ÜBERSICHT
sr: ПРЕГЛЕД

source: ...see ticket overviews (but not ticket details)
de: ... Tickets in Übersichten zu sehen (aber nicht deren Details)
sr: ...погледа прегледе тикета (али не и њихове детаље)

source: FULL
de: VOLL
sr: СВЕ

source: ...all of the above **and be assigned / receive notifications for tickets**
de: ... alles oben genannte **und der Möglichkeit, zugewiesen zu werden / Ticket-Benachrichtigungen zu erhalten**
sr: ...све горе наведено **и буде додељен / примати обавештења за тикете**

source: 🔔 **Full group access also enables notifications for that group's tickets.**
de: 🔔 **Vollständige Gruppenberechtigung ermöglicht auch Benachrichtigungen für die Tickets dieser Gruppe.**
sr: 🔔 **Пун приступ групи такође омогућава обавештења за тикете те групе.**

source: Setting Permissions
de: Berechtigungen vergeben
sr: Подешавање дозвола

source: There are two ways to define an agent's per-group permission levels:
de: Es gibt zwei Möglichkeiten, die Berechtigungen eines Agenten pro Gruppe zu definieren:
sr: Постоје два начина да се дефинишу дозволе оператера по групама:

source: Directly, in the :ref:`Edit User dialog <user-details-group-access>` in the table of group permissions:
de: Direkt im :ref:`Bearbeitungsdialog des Users <user-details-group-access>`:
sr: Директно, у дијалогу :ref:`уређивања корисника <user-details-group-access>` у оквиру табеле групних дозвола:

source: Screenshot showing the group assignment to a user in the user edit dialog.
de: Screenshot, der die Gruppenzuordnung zu einem Benutzer im Benutzerbearbeitungsdialog zeigt.
sr: Снимак екрана који приказује доделу група кориснику у дијалогу уређивања корисника.

source: Simply set your permission levels right on the target user.
de: Legen Sie für den gewünschten Benutzer einfach direkt Ihre Zugriffsberechtigung fest.
sr: Једноставно доделите дозволу приступа циљном кориснику.

source: Implicitly, by :ref:`editing a user role <role-settings-group-access>`
de: Implizit durch :ref:`Bearbeiten der Rollen eines Benutzers <role-settings-group-access>`
sr: Имплицитно, :ref:`уређивањем улога корисника <role-settings-group-access>`

source: First, head over to :doc:`Roles </manage/roles/index>` to set up the permissions you want to assign. Example:
de: Gehen Sie zunächst zu :doc:`Rollen </manage/roles/index>`, um die Berechtigungen einzurichten, die Sie zuweisen möchten. Beispiel:
sr: Прво, идите на :doc:`улоге </manage/roles/index>` да бисте подесили дозволе које желите да доделите. Пример:

source: Group permissions table in edit role dialog
de: Tabelle mit Gruppenberechtigungen im Rollenbearbeitungsdialog
sr: Табела групних дозвола у дијалогу уређивања улоге

source: Then you are good to go to assign the role to a user in the user edit dialog. Example:
de: Dann können Sie die Rolle einem Benutzer im Dialogfeld "Neu/Bearbeiten: Benutzer" zuweisen. Beispiel:
sr: Затим доделите ту улогу циљном кориснику преко дијалога за уређивање корисника. Пример:

source: Screenshot shows the role assignment in the user edit dialog
de: Der Screenshot zeigt die Rollenzuweisung im Benutzerbearbeitungsdialog
sr: Снимак екрана који приказује доделу улоге у дијалогу уређивања корисника

source: Make sure to click on the ➕ *Add* button after assigning the last group. Otherwise, your last selection *will not* be saved.
de: Achten Sie darauf, dass Sie auf die Schaltfläche ➕ *Hinzufügen* klicken, nachdem Sie die letzte Gruppe zugewiesen haben. Andernfalls wird Ihre letzte Auswahl *nicht* gespeichert.
sr: Обратите пажњу да кликнете на дугме ➕*Додај* након доделе последње групе. У супроном, ваш последњи избор *неће* бити сачуван.

source: ⚖️ **We recommend choosing one or the other**; things can get confusing if you use both at the same time.
de: ⚖️ **Wir empfehlen, sich für die eine oder andere Variante zu entscheiden**; Wenn Sie beide gleichzeitig verwenden, kann Ihnen der Überblick verloren gehen.
sr: ⚖️ **Препоручујемо да изаберете једно или друго**; ствари могу постати збуњујуће ако користите истовремено оба приступа.
