Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: Please ensure to take a look at :doc:`/channels/email/settings` within the email channel to ensure you have at least one reference that helps Zammad to assign follow-ups correctly.
de: Bitte werfen Sie vorab einen Blick auf :doc:`/channels/email/settings` innerhalb des E-Mail-Kanals und stellen sicher, dass Sie mindestens eine Referenz für die Zuordnung von Tickets bei Rückfragen eingerichtet haben.
sr: Обавезно погледајте :doc:`подешавања </channels/email/settings>` у оквиру имејл канала да бисте били сигурни да имате бар једну референцу која помаже Zammad-у да правилно додели наставке.

source: Disabling this and not setting up any further follow up search will lead to unexpected results!
de: Wenn Sie diese Funktion deaktivieren und keine andere Zuordnung eingerichtet haben, wird dies zu unerwarteten Ergebnissen führen!
sr: Онемогућавање овога и неподешавање даље претраге наставака ће довести до неочекиваних резултата!

source: Default: ``right``
de: Standard: ``rechts``

source: Ticket Last Contact Behaviour
de: Verhalten der Aktualisierung des letzter Kundenkontakts

source: This setting changes the way Zammad updates the ``Last Contact`` value of a ticket. This is fairly important for overviews and what you expect upon ticket updates of a customer.
de: Diese Einstellung ändert die Art und Weise, wie Zammad den ``Letzten Kontakt`` eines Tickets aktualisiert. Dies ist wichtig für Übersichten und für das Verhalten bei Ticketaktualisierungen.
sr: Ово подешавање мења начин на који Zammad освежава атрибут тикета „Последњи одговор“. Ово је прилично важно за прегледе и оно што очекујете након освежавања тикета од стране корисника.

source: Use the start time of the last customer thread (which may consist of multiple articles).
de: Verwenden Sie die Startzeit des letzten Kunden-Threads (der aus mehreren Artikeln bestehen kann).
sr: Користи време почетка последње конверзације клијента (која се може састојати од више чланака).

source: If this option is chosen, Zammad will update the last updated value just once if a customer replies. After that, Zammad will wait for an agent to react.
de: Wenn diese Option gewählt wird, wird Zammad den zuletzt aktualisierten Wert nur einmal aktualisieren, wenn ein Kunde antwortet. Danach wartet Zammad auf die Reaktion eines Agenten.
sr: Ако се изабере ова опција, Zammad ће освежити вредност атрибута само једном приликом одговора клијента. Након тога, Zammad ће сачекати да оператер реагује.

source: This comes in handy if you want to work tickets in the order of their first update. This will not change ticket orders if customers decide to "bump" the ticket affected.
de: Dies ist praktisch, wenn Sie Tickets in der Reihenfolge ihrer ersten Aktualisierung bearbeiten möchten. Die Reihenfolge der Tickets ändert sich nicht, wenn die Kunden beschließen, das Ticket mit einer erneuten Rückfrage zu aktualisieren.
sr: Ово је згодно ако желите да радите на тикетима према редоследу њиховог првог освежавања. Ово неће променити редослед тикета ако клијенти одлуче да само „чукну” своје тикете.

source: Use the time of the very last customer article.
de: Verwenden Sie den Zeitpunkt des allerletzten Kundenartikels.
sr: Користи време последњег чланка клијента.

source: When setting this option, Zammad will always update the last updated value. This means that if ordering by ``Last Update``, ticket orders will change if customers "bump" the ticket.
de: Wenn diese Option gesetzt ist, wird Zammad immer den Wert der letzten Aktualisierung verwenden. Die Reihenfolge der Tickets ändert sich, wenn die Kunden beschließen, das Ticket mit einer erneuten Rückfrage zu aktualisieren.
sr: Када одаберете ову опцију, Zammad ће увек освежити вредност атрибута. То значи да ако сортирате према ``последњем одговору``, редослед тикета ће се променити ако клијенти само „чукну” тикет.

source: Last contact value used on :doc:`/manage/overviews`
de: Letzter Kontakt für :doc:`/manage/overviews` verwendet
sr: Вредност последњег одговора коришћена у :doc:`прегледима </manage/overviews>`

source: Last contact value used on :doc:`/manage/trigger`
de: Letzter Kontakt für :doc:`/manage/trigger` verwendet
sr: Вредност последњег одговора коришћена у :doc:`окидачима </manage/trigger>`

source: Default: ``Use the start time of the last customer thread (which may consist of multiple articles).``
de: Standard: ``Verwenden Sie die Startzeit des letzten Kunden-Threads (der aus mehreren Artikeln bestehen kann).``
sr: Подразумевано: ``Користи време почетка последње конверзације клијента (која се може састојати од више чланака).``

source: Ticket Organization Reassignment
de: Neuzuweisung der Ticket-Organisation

source: This setting changes the way Zammad updates the organization field of the tickets whenever the primary organization of a user is changed.
de: Diese Einstellung definiert, ob Zammad die Organisation der Tickets aktualisiert, wenn die primäre Organisation eines Benutzers geändert wird.
sr: Ово подешавање мења начин на који Zammad освежава поље организације тикета кад год се промени примарна организација корисника.

source: Update the most recent tickets.
de: Die neuesten Tickets aktualisieren.
sr: Освежи недавне тикете.

source: If this option is chosen, Zammad will update the 100 most recent tickets where the user is the ticket customer. The ticket organization field will be automatically set to the new primary organization of the user.
de: Wenn diese Option gewählt wird, aktualisiert Zammad die letzten 100 Tickets, bei denen der Benutzer der Kunde ist. Das Feld Ticketorganisation wird automatisch auf die neue Primärorganisation des Benutzers gesetzt.
sr: Ако се изабере ова опција, Zammad ће освежити 100 најновијих тикета где је корисник клијент тикета. Поље организације тикета ће аутоматски бити постављено на нову примарну организацију корисника.

source: Do not update any tickets.
de: Keine Tickets aktualisieren.
sr: Без освежавања тикета.

source: When choosing this option, Zammad will not update any tickets when the user's primary organization is changed.
de: Wenn Sie diese Option wählen, wird Zammad keine Tickets aktualisieren, wenn die primäre Organisation des Benutzers geändert wird.
sr: Када изаберете ову опцију, Zammad неће освежити ниједан тикет када се промени примарна организација корисника.

source: **Use with care!**
de: **Mit Vorsicht verwenden!**
sr: **Користите пажљиво!**

source: Using this option may lead to inconsistencies in the system as the ticket organization may become decoupled from the ticket customer.
de: Die Verwendung dieser Option kann zu Inkonsistenzen im System führen, da dadurch die Ticketorganisation vom Ticketkunden entkoppelt werden kann.
sr: Коришћење ове опције може довести до недоследности у систему јер се организација тикета може одвојити од клијента тикета.

source: However, you may use this option if you wish to maintain :ref:`the shared access <organization-details-reference>` to the ticket for all organization members of the original organization of the customer.
de: Sie können diese Option jedoch verwenden, wenn Sie :ref:`den gemeinsamen Zugriff <organization-details-reference>` auf das Ticket für alle Organisationsmitglieder der ursprünglichen Organisation des Kunden beibehalten möchten.
sr: Међутим, можете користити ову опцију ако желите да задржите :ref:`дељени приступ <organization-details-reference>` на тикету за све чланове организације првобитне организације корисника.

source: Default: ``Update the most recent tickets.``
de: Standard: ``Die neuesten Tickets aktualisieren.``
sr: Подразумевано: ``Освежи недавне тикете.``

source: Ticket Number Format
de: Ticket-Nummer-Format

source: This setting defines the way Zammad's ticket number will look. Changing this setting in production will cause follow up detection to fail.
de: Diese Einstellung legt fest, wie die Ticketnummer durch Zammad vergeben werden soll. Wird diese Einstellung im Produktivbetrieb geändert, schlägt die Zuordnung bei Rückfragen von Kunden fehl.
sr: Ово подешавање одређује изглед Zammad-овог броја тикета. Промена овог подешавања на системима у продукцији ће довести до неуспешног откривања наставака.

source: Increment (SystemID.Counter)
de: Inkrement (SystemID.Zähler)
sr: Увећање (SystemID.бројач)

source: The increment value contains the SystemID (automatically generated during installation) and a increment which counts up with every new Ticket. The increment will automatically get another digit if needed.
de: Der Wert enthält die SystemID (die bei der Installation automatisch generiert wird) und ein Inkrement, das bei jedem neuen Ticket hochgezählt wird. Das Inkrement erhält bei Bedarf automatisch eine weitere Stelle, wenn der maximal mögliche Wert erreicht ist.
sr: Вредност бројача садржи SystemID (аутоматски генерисан током инсталације) и бројач који се рачуна са сваким новом тикетом. Увећање ће аутоматски вратити другу вредност ако је потребно.

source: Examples: ``1010138``, ``1010139``
de: Beispiele: ``1010138``, ``1010139``
sr: Примери: ``1010138``, ``1010139``

source: Date (Year.Month.Day.SystemID.Counter)
de: Datum (Jahr.Monat.Tag.SystemID.Zähler)
sr: Датум (година.месец.дан.системID.бројач)

source: This version of the ticket number is fairly long. However, because it contains the date of ticket creation, it also allows you to see when the ticket has been created. You may feel familiar with this number format if you've worked with OTRS already.
de: Diese Version der Ticketnummer ist ziemlich lang. Da sie jedoch das Datum der Ticket-Erstellung enthält, können Sie damit erkennen, wann das Ticket erstellt wurde. Wenn Sie bereits mit OTRS gearbeitet haben, werden Sie mit diesem Nummernformat vertraut sein.
sr: Овај облик броја тикета је прилично дугачак. Међутим, пошто садржи датум отварања тикета, такође вам омогућава да видите када је тикет отворен. Можда вам је познат овај формат броја ако сте већ радили са OTRS-ом.

source: Examples: ``201206231010138``, ``201206231010139``
de: Beispiele: ``201206231010138``, ``201206231010139``
sr: Примери: ``201206231010138``, ``201206231010139``

source: Default: ``Increment (SystemID.Counter)``
de: Standard: ``Inkrement (SystemID.Zähler)``

source: OPTIONS
de: Optionen
sr: Опције

source: The below options allow you to further customize your ticket number. The availability of options differ depending of the chosen ticket number format above.
de: Mit den folgenden Optionen können Sie Ihre Ticketnummer weiter anpassen. Die Verfügbarkeit der Optionen hängt von dem oben gewählten Ticketnummernformat ab.
sr: Опције у наставку вам омогућавају да додатно прилагодите број својих тикета. Доступност опција се разликује у зависности од изабраног формата броја тикета изнад.

source: Checksum
de: Prüfsumme

source: If set to yes, we'll built a checksum to further "unique" the ticket number of your system. If you're dealing with many other ticket systems this might help to prevent false positive follow up detection on tickets.
de: Wenn Sie diese Option auf "Ja" setzen wird eine Prüfsumme gebildet, um die Ticketnummer Ihres Systems weiter "eindeutig" zu machen. Wenn Sie mit vielen anderen Ticketsystemen zu tun haben, kann dies eine falsche Zuordnung von Tickets zu verhindern.
sr: Ако је постављено на да, биће израчунат контролни збир да би број тикета вашег система остао „јединствен”. Ако се повезујете са другим системима тикета, ово би могло помоћи да спречите откривање лажних наставака тикета.

source: This will also add another digit to the ticket number.
de: Dadurch wird der Ticketnummer eine weitere Ziffer hinzugefügt.
sr: Ово ће такође додати још једну цифру броју тикета.

source: Min. size of Number
de: Min. Länge der Zahl

source: This setting defines the minimum length of your ticket number. If your counter is not yet high enough, Zammad will fill the number with zeros to ensure the wanted length.
de: Diese Einstellung legt die Mindestlänge Ihrer Ticketnummer fest. Wenn Ihr Zähler noch nicht hoch genug ist, wird Zammad die Nummer mit Nullen auffüllen, um die gewünschte Länge zu erreichen.
sr: Ово подешавање одређује минималну дужину броја ваших тикета. Ако ваш бројач још увек није довољно висок, Zammad ће попунити број нулама да би обезбедио жељену дужину.

source: Please note that the minimum length is ``3`` (SystemID + at least one digit if below 10). Also, if the length is no longer long enough, the number will automatically get one digit longer. Ticket-Numbers **do not overflow**, thus it's save to keep it at 5 or set it lower if wanted.
de: Bitte beachten Sie, dass die Mindestlänge ``3`` beträgt (SystemID + mindestens eine Stelle, falls unter 10). Wenn die Länge nicht mehr ausreicht, wird die Nummer automatisch um eine Stelle länger. Ticket-Nummern wiederholen sich nicht, daher ist es sicher, die Länge auf 5 oder niedriger zu setzen.
sr: Имајте на уму да је минимална дужина ``3`` (ID система + најмање једна цифра ако је испод 10). Такође, ако дужина више није довољна, број ће аутоматски добити додатну цифру. Бројеви тикета се **не обрћу**, тако да је безбедно да дужину задржите на 5 или је смањите ако желите.

source: This option is only available if ticket number format is set to ``Increment``!
de: Diese Option ist nur verfügbar, wenn das Ticket-Nummer-Format auf ``InKrement`` gesetzt ist!
sr: Ова опција је доступна само ако је формат броја тикета подешен на ``Увећање``!

source: Default: ``5``
de: Standard: ``5``

source: Auto-Assignment
de: Automatische Zuweisung
sr: Аутоматска додела

source: In a larger Zammad environment, it happens that several agents open the same ticket at the same time. Although collision detection is then effective, the efficiency of processing can be increased by means of the automatic assignment of tickets when a ticket is opened.
de: In einer größeren Zammad-Umgebung kommt es vor, dass mehrere Agenten ein Ticket gleichzeitig öffnen. Obwohl das in Zammad entsprechend angezeigt wird, kann die Effizienz der Bearbeitung durch die automatische Zuweisung von Tickets erhöht werden.
sr: У већем Zammad окружењу дешава се да неколико оператера отвори исти тикет у исто време. Иако је детекција колизије тада у игри, ефикасност обраде се може повећати аутоматском доделом тикета по отварању тикета.

source: The automatic assignment of tickets can be activated and configured in the admin area under *Settings > Ticket > Auto Assignment*.
de: Die automatische Zuweisung von Tickets kann im Admin-Bereich unter *Einstellungen > Ticket > Automatische Zuweisung* aktiviert und konfiguriert werden.

source: The auto assignment only works if the ticket has no owner yet. By default, the agent can always reset the ticket owner to ``-`` if needed.
de: Die automatische Zuweisung wird nur ausgeführt, wenn das Ticket noch keinen Besitzer hat. Standardmäßig kann der Agent den Besitzer des Tickets bei Bedarf jederzeit auf ``-`` zurücksetzen.
sr: Аутоматска додела се извршава само ако тикет још увек нема власника. Подразумевано, оператер увек може да врати власника тикета на ``-`` ако је потребно.

source: If you want to use this function for only specific tickets, you can configure the conditions accordingly to meet your requirement. By default, the condition affects all tickets with the state ``open``.
de: Wenn Sie diese Funktion nur für bestimmte Anfragen verwenden möchten, können Sie eine Bedingungen dafür konfigurieren. Standardmäßig wirkt sich Funktion auf alle Tickets mit dem Status ``offen`` aus.

source: If you need to exclude users (e.g. a team leader), you can search and select the desired agents in the **Excepted Users** list. The search function in this area is only effective if you have too many agents to display at once to help you with the configuration.
de: Wenn Sie Benutzer ausschließen wollen (z.B. einen Gruppenleiter), können Sie die gewünschten Agenten in der Liste **Ausgenommene Benutzer** suchen und auswählen. Die Suchfunktion in diesem Bereich ist nur dann aktiv, wenn es mehr Agenten gibt als angezeigt werden können.

source: Language Detection
de: Sprachen-Erkennung
sr: Откривање језика

source: Zammad offers a built in language detection for articles. By default, it is turned off. Turn it on by selecting a backend service and confirm by clicking **Submit**.
de: Zammad bietet eine eingebaute Sprachen-Erkennung für Artikel. Standardmäßig ist sie ausgeschaltet. Schalten Sie sie ein, indem Sie einen Backend-Dienst auswählen und durch Klicken auf **Übermitteln** bestätigen.
sr: Zammad пружа уграђено откривање језика чланака. Подразумевано, овај сервис је искључен. Укључите га постављањем подешавања позадинског модула и потврдите кликом на **Submit**.

source: After enabling it, Zammad tries to detect the language of each **new** article. The language is not detected for existing articles.
de: Nach der Aktivierung versucht Zammad, die Sprache jedes **neuen** Artikels zu erkennen. Bei bestehenden Artikeln wird die Sprache nicht erkannt.
sr: По укључивању, Zаmmad ће пробати да открије језик сваког **новог** чланка. Језик неће бити откривен за постојеће чланке.

source: Currently, there is only one backend service available: `Compact Language Detection <https://github.com/jtoy/cld>`_.
de: Derzeit ist nur ein Backend-Dienst verfügbar: `Compact Language Detection <https://github.com/jtoy/cld>`_.
sr: Тренутно, подржан је само један позадински модул: `Compact Language Detection <https://github.com/jtoy/cld>`_.

source: Be aware that this feature is in its early stages. Enhancements may come in very soon.
de: Bitte beachten Sie, dass sich diese Funktion noch in einer frühen Phase befindet. Verbesserungen könnten bald folgen.
sr: Будите свесни да је ова функција у свом раном развоју. Унапређења могу стићи убрзо.

source: While we noticed it works pretty well, it may fail for some edge cases.
de: Wir haben zwar festgestellt, dass es recht gut funktioniert, aber in manchen Fällen kann die Ermittlung fehlschlagen.
sr: Иако смо приметили да ради прилично поуздано, може бити неуспешна за неке ивичне случајеве.

source: The language selection in conditions and the output in the article detail view is always in English. The language names are not translated into user's current language.
de: Die Sprachauswahl in den Bedingungen und die Ausgabe in der Artikeldetailansicht ist immer in Englisch. Die Sprachnamen werden nicht in die gewählte Sprache des Benutzers übersetzt.
sr: Одабир језика у условима и приказ у детаљима чланка је увек на енглеском. Називи језика неће бити преведени у језик тренутног корисника.

source: You can see the name of the detected language in the detail view of an article. You can display additional information by clicking on an article, which expands more details:
de: Sie können den Namen der erkannten Sprache in der Detailansicht eines Artikels sehen. Sie können diese zusätzlichen Informationen anzeigen, indem Sie auf einen Artikel klicken:
sr: Можете видети назив откривеног језика у детаљима чланка. Додатне информације можете приказати кликом на чланак, који открива детаље:

source: Screenshot showing detected language in article detail view
de: Screenshot der erkannten Sprache in der Detailansicht eines Artikels
sr: Снимак екрана који откривени језик у детаљима чланка

source: If you are wondering what this feature is useful for, the answer is:
de: Wenn Sie sich fragen, wozu diese Funktion nützlich ist, lautet die Antwort:
sr: Уколико се питате чему служи ова функција, одговор је:

source: Use the detected language as a condition attribute in triggers and schedulers. Examples are: to send auto replies in different languages (see :ref:`trigger example <trigger-example-3>`) and to move tickets in a specific language into a specific group.
de: Verwenden Sie die erkannte Sprache als Bedingungsattribut in Triggern und der Automatisierung. Beispiele sind: automatische Antworten in verschiedenen Sprachen senden (siehe :ref:`Trigger-Beispiel <trigger-example-3>`) und Tickets in einer bestimmten Sprache in eine bestimmte Gruppe verschieben.
sr: Користите откривени језик као атрибут у условима окидача и планера. Примери су: слање аутоматских одговора на различитим језицима (погледајте :ref:`пример окидача <trigger-example-3>`) и премештање тикета у одговарајуће групе на основу језика.

source: Search by the new article attribute in the advanced search (both via language code and language name). Examples: ``article.detected_language:en``, ``article.detected_language_name:english``
de: Suche nach dem neuen Artikel-Attribut in der erweiterten Suche (sowohl über den Sprachcode als auch über den Sprachnamen). Beispiele: ``article.detected_language:en``, ``article.detected_language_name:english``
sr: Вршите напредну претрагу по новом атрибуту чланка (и по коду и по називу језика). Примери: ``article.detected_language:en``, ``article.detected_language_name:english``

source: Default Notifications
de: Standard-Benachrichtigungen
sr: Подразумевана обавештења

source: This setting allows you to configure the default ticket notifications that will be applied to all new agent users (incl. users who were just assigned agent role). Simply change the notification matrix to desired state and press **Save**.
de: Mit dieser Einstellung können Sie die Standard-Ticket-Benachrichtigungen konfigurieren, die auf alle neuen Agenten-Benutzer angewendet werden (einschließlich Benutzer, denen gerade eine Agentenrolle zugewiesen wurde). Ändern Sie einfach die Benachrichtigungsmatrix auf den gewünschten Status und drücken Sie **Speichern**.
sr: Ово подешавање вам омогућава да одредите подразумевана обавештења о тикету која ће бити примењена на све нове кориснике оператере (укључујући и кориснике којима је управо додељена улога оператера). Једноставно измените матрицу обавештења у жељено стање и притисните **Сачувај**.

source: In case an agent already exists, their ticket notification preferences will be preserved. Optionally, you can also **Apply current defaults to all agents**.
de: Falls ein Agent bereits existiert werden seine Benachrichtungungseinstellungen beibehalten. Optional können Sie auch **Standardwerte für alle Agenten setzen** verwenden, um bereits existierende Einstellungen für bestehende Agenten zu überschreiben.
sr: У случају да оператер већ постоји, њихова подешавања обавештења о тикетима ће бити сачувана. Опционо, такође можете **Применити подешавања свим оператерима** и тада ће нова подразумевана подешавања бити примењена на све оператере.

source: **Potential time-consuming action:** Applying default ticket notifications to all agent users may take some time to complete, be patient! The exact time will depend on the size of your system and the number of agents.
de: **Potenziell langandauernde Aktion:** Die Anwendung von Standard-Ticket-Benachrichtigungen auf alle Agenten-Benutzer kann einige Zeit in Anspruch nehmen, haben Sie Geduld! Die genaue Zeit hängt von der Größe Ihres Systems und der Anzahl der Agenten ab.
sr: **Потенцијално дугачка радња:** примена подразумеваних обавештења о тикетима на све кориснике оператере може потрајати, будите стрпљиви! Тачно време ће зависити од величине вашег система и броја оператера.

source: **Active agents only!** When current default ticket notifications are applied, only active agent users are considered. In case an agent is re-activated *after* this action, they will still have the old notification configuration.
de: **Nur aktive Agenten!** Wenn die aktuellen Standard-Ticket-Benachrichtigungen angewendet werden, werden nur aktive Agenten berücksichtigt. Falls ein Agent *nach* dieser Aktion reaktiviert wird, hat er noch die alte Benachrichtigungskonfiguration.
sr: **Само активни оператери!** Када се примењују тренутна подразумевана обавештења о тикетима, узимају се у обзир само активни корисници оператери. У случају да се оператер поново активира *после* ове акције, он ће и даље имати стара подешавања обавештења.
