Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: Paste it for the "A message comes in" event in the **URL** field and make sure to select ``HTTP POST`` as HTTP option as in the following screenshot:
de: Fügen Sie sie für das Ereignis "A message comes in" in das Feld **URL** ein und stellen Sie sicher, dass Sie als HTTP-Option ``HTTP POST`` wählen, wie im folgenden Screenshot zu sehen:
sr: Налепите адресу за „A message comes in” догађај у поље **URL** и обавезно одаберите ``HTTP POST`` за HTTP метод као на снимку екрана испод:

source: Twilio number configuration
de: Konfiguration der Twilio-Nummer
sr: Подешавања Тwilio броја

source: Make sure to save the changes and go on with the next step.
de: Stellen Sie sicher, dass Sie die Änderungen speichern und fahren Sie mit dem nächsten Schritt fort.
sr: Обавезно снимите измене и идите на следећи корак.

source: Configure SMS Account
de: SMS-Konto konfigurieren
sr: Подесите SMS налог

source: To set up the channel, your account ID and the authentication token are required. You can find them in Twilio's `welcome screen <https://console.twilio.com/?frameUrl=/console>`_ for example.
de: Um den Kanal einzurichten, benötigen Sie Ihre Account ID und das Authentifizierungs Token. Sie finden sie z.B. im `Willkommens-Bildschirm von Twilio <https://console.twilio.com/?frameUrl=/console>`_.
sr: За подешавање канала, неопходни су ваш ID налога и аутентификациони кључ. Можете их пронаћи нпр. у Twilio `екрану добродошлице <https://console.twilio.com/?frameUrl=/console>`_.

source: Twilio settings
de: Twilio-Einstellungen
sr: Twilio подешавања

source: Copy and paste them into the corresponding fields in the SMS config dialog:
de: Kopieren Sie sie und fügen Sie sie in die entsprechenden Felder im SMS-Konfigurationsdialog ein:
sr: Ископирајте и налепите их у одговарајућа поља у дијалогу SMS конфигурације:

source: Channel settings SMS
de: Einstellungen SMS-Kanal
sr: Подешавања SMS канала

source: Additionally, you have to enter a sender number and select a destination group which receives the tickets of this channel. The sender number is what is show as sender to the customer. You can even add a name here.
de: Zusätzlich müssen Sie eine Absendernummer eingeben und eine Gruppe auswählen, die die Tickets dieses Kanals empfängt. Die Absendernummer ist das, was dem Kunden als Absender angezeigt wird. Sie können hier auch einen Namen eintragen.
sr: Додатно, морате унети број за слање и одабрати циљну групу која ће примати тикете овог канала. Број за слање ће бити приказан као пошиљалац клијенту. Можете унети чак и назив.

source: You can now ``Test`` your configuration by clicking the button. After successfully testing your configuration, save it by clicking the ``Submit`` button.
de: Sie können nun Ihre Konfiguration testen, indem Sie auf die Schaltfläche ``Test`` klicken. Nachdem Sie Ihre Konfiguration erfolgreich getestet haben, speichern Sie sie, indem Sie auf die Schaltfläche ``Übermitteln`` klicken.
sr: Можете сада тестирати вашу конфигурацију кликом на дугме. По успешном тестирању, снимите је кликом на дугме ``Пошаљи``.

source: Communication via SMS is now available in Zammad.
de: Die Kommunikation per SMS ist jetzt in Zammad verfügbar.
sr: Комуникација путем SMS-а је сада доступна директно из Zammad-а.

source: Configure SMS Notifications
de: SMS-Benachrichtigungen konfigurieren
sr: Подешавање SMS обавештења

source: It's also possible to use the SMS channel to send notifications from the system (e.g. from trigger or automation). To set it up, click on the ``New`` button in the **SMS Notification** section.
de: Es ist auch möglich, den SMS-Kanal zu nutzen, um Systembenachrichtigungen zu senden (z.B. von Triggern oder Automatisierungen). Um dies einzurichten, klicken Sie auf die Schaltfläche ``Neu`` im Abschnitt **SMS-Benachrichtigung**.
sr: Такође је могуће користити SMS канал за слање обавештења система (нпр. из окидача или путем аутоматизације). За подешавање, кликните на дугме ``Ново`` у одељку **SMS обавештења**.

source: Supported providers: Massenversand, MessageBird and Twilio
de: Unterstützte Anbieter: Massenversand, MessageBird und Twilio
sr: Доступни провајдери: Massenversand, MessageBird и Twilio

source: Please note that users must have a mobile phone number to get notified by SMS. If there is no phone number assigned, no SMS will be sent.
de: Bitte beachten Sie, dass Benutzer eine Mobiltelefonnummer haben müssen, um per SMS benachrichtigt zu werden. Wenn keine Telefonnummer zugewiesen ist, wird keine SMS gesendet.
sr: Обратите пажњу да корисници морају имати број мобилног телефона за пријем SMS обавештења. Уколико немају додељен број телефона, SMS поруке неће бити послате.

source: The setup is the same as above: Select your provider, provide the details (Account SID, token) and enter a sender number or name. After that, you can test your configuration. If successful, save your changes by clicking the ``Submit`` button.
de: Die Einrichtung ist dieselbe wie oben: Wählen Sie Ihren Anbieter, geben Sie die Details an (Account SID, Token) und geben Sie eine Absendernummer oder einen Namen ein. Danach können Sie Ihre Konfiguration testen. Wenn erfolgreich, speichern Sie Ihre Änderungen, indem Sie auf die Schaltfläche ``Übermitteln`` klicken.
sr: Поставка је иста као изнад: одаберите вашег провајдера, унесите детаље (SID налога, кључ) и унесите број или назив за пошиљаоца. Након тога, можете тестирати вашу конфигурацију. Уколико је успешна, снимите ваше измене кликом на дугме ``Пошаљи``.

source: Notification settings
de: Benachrichtigungseinstellungen
sr: Подешавања обавештења

source: Now it's possible to send SMS notifications via trigger or automation. The setup is done the same way as setting up :doc:`email notifications </channels/email/accounts/email-notification>`.
de: Jetzt ist es möglich, SMS-Benachrichtigungen über Trigger oder Automatisierung zu versenden. Die Einrichtung erfolgt auf die gleiche Weise wie die Einrichtung von :doc:`E-Mail-Benachrichtigungen </channels/email/accounts/email-notification>`.
sr: Сада је могуће слати SMS обавештења путем окидача или аутоматизације. Подешавање је идентично подешавању :doc:`имејл обавештења </channels/email/accounts/email-notification>`.

source: It's possible to put your Telegram bot communication into Zammad. To do so, you need to follow the steps below.
de: Es ist möglich, Ihre Telegram-Kommunikation über Zammad abzuwickeln. Beachten Sie dazu bitte die folgenden Schritte.
sr: Могуће је интегрисату комуникацију са Telegram ботом са Zammad-ом. Да бисте то урадили, потребно је да следите кораке испод.

source: Your Zammad instance needs to be publicly available via HTTPS (usage of Telegram webhooks).
de: Ihre Zammad-Instanz muss über HTTPS öffentlich zugänglich sein (Verwendung von Telegram Webhooks).
sr: Ваша Zammad инстанца мора да буде јавно доступна преко HTTPS (коришћење Telegram повратних позива).

source: The attachment size is limited to 20MB by `Telegram's Bot API <https://core.telegram.org/bots/api#getfile>`_.
de: Die Größe von Anhängen ist durch `Telegram's Bot API <https://core.telegram.org/bots/api#getfile>`_ auf 20 MB begrenzt.
sr: Величина прилога је ограничена на 20MB од стране `Telegram Bot API <https://core.telegram.org/bots/api#getfile>`_.

source: Register a Telegram Bot App
de: Registrieren Sie eine Telegram Bot-App
sr: Региструјте Telegram бот апликацију

source: Register your Telegram bot via your Telegram client according to the steps below. You can find additional information in `Telegram's bot documentation <https://core.telegram.org/bots#3-how-do-i-create-a-bot>`_.
de: Registrieren Sie Ihren Telegram-Bot über Ihren Telegram-Client gemäß den folgenden Schritten. Weitere Informationen finden Sie in der `Telegram-Bot-Dokumentation <https://core.telegram.org/bots#3-how-do-i-create-a-bot>`_.
sr: Региструјте своj Telegram бот путем Telegram клијента према упутству испод. Додатне информације можете пронаћи у `документацији о Telegram боту <https://core.telegram.org/bots#3-how-do-i-create-a-bot>`_.

source: Go to BotFather
de: Gehen Sie zu BotFather
sr: Иди на BotFather

source: Screenshot shows initial BotFather chat in Telegram
de: Screenshot zeigt den initialen BotFather-Chat in Telegram
sr: Снимак екрана који приказује почетно ћаскање са BotFather у Telegram-у

source: Register a new bot
de: Einen neuen Bot registrieren
sr: Регистрација новог бота

source: Register a new bot by using ``/newbot`` and define its name and username.
de: Registrieren Sie einen neuen Bot mit ``/newbot`` und definieren Sie dessen Namen und Benutzernamen.
sr: Региструјте новог бота користећи ``/newbot`` и дефинишите његов назив и корисничко име.

source: Screenshot shows BotFather chat where a new bot is created
de: Screenshot zeigt den BotFather-Chat, in dem ein neuer Bot erstellt wird
sr: Снимак екрана који приказује ћаскање са BotFather приликом прављења бота

source: Get your API token
de: Holen Sie sich Ihr API-Token
sr: Преузмите ваш API кључ

source: When you're all done, you will get your Telegram bot API token
de: Wenn das gemacht haben erhalten Sie Ihr Telegram-Bot-API-Token
sr: Када све завршите, добићете свој Telegram бот API токен

source: Screenshot shows BotFather chat after creating the bot
de: Screenshot zeigt den BotFather-Chat nach der Erstellung des Bots
sr: Снимак екрана који приказује ћаскање са BotFather по прављењу бота

source: Configure Zammad as Telegram Bot
de: Zammad als Telegram Bot einrichten
sr: Подесите Zammad као Telegram бот

source: Go to *Channels > Telegram* in Zammad's settings and click ``Add Bot``. Enter your API token, a welcome message and a goodbye message and choose a group in which the tickets will be created.
de: Gehen Sie in den Einstellungen von Zammad auf *Kanäle > Telegram* und klicken Sie auf ``Bot hinzufügen``. Geben Sie Ihr API-Token, eine Willkommens- und eine Abschiedsnachricht ein und wählen Sie eine Gruppe aus, in der die Tickets erstellt werden sollen.
sr: Идите на *Канали > Telegram* у Zammad-овим подешавањима и кликните на ``Додај бота``. Унесите свој API кључ, поруку добродошлице и поздравну поруку и одаберите групу у којој ће тикети бити отворени.

source: Screenshot shows Zammad's Telegram configuration dialog
de: Screenshot zeigt Zammads Telegram-Konfigurationsdialog
sr: Снимак екрана који приказује Zammad дијалог Телеграм подешавања

source: After successfully creating the bot by clicking the ``Submit`` button, you can see your bot now in the channel detail section.
de: Nachdem Sie den Bot erfolgreich erstellt haben, indem Sie auf den Button ``Übermitteln`` klicken, können Sie Ihren Bot nun im Detailbereich des Kanals sehen.
sr: По успешном додавању бота кликом на дугме ``Пошаљи``, можете прегледати вашег бота у секцији детаља канала.

source: Screenshot shows existing Telegram bot in Zammad
de: Screenshot zeigt bestehenden Telegram-Bot in Zammad
sr: Снимак екрана који приказује постојећи Telegram бот у Zammad-у

source: That's it. Now you can start using the Telegram channel in Zammad. To add another bot or edit, deactivate or delete the created bot, use the respective buttons to do so.
de: Das war's. Jetzt können Sie den Telegram-Kanal in Zammad verwenden. Um einen weiteren Bot hinzuzufügen oder den erstellten Bot zu bearbeiten, zu deaktivieren oder zu löschen, verwenden Sie die entsprechenden Schaltflächen.
sr: То је све. Сада можете почети да користите Telegram канал у Zammad-у. За додавање још једног бота или уређивање, искључивање или брисање постојећег бота, користите одговарајуће дугмиће.

source: The web channel mainly affects your customers using the web interface. These settings allow you to restrict your customers ticket creation.
de: Der Webkanal betrifft hauptsächlich die Nutzung der Weboberfläche durch Ihre Kunden. Mit diesen Einstellungen können Sie die Ticketerstellung Ihrer Kunden einschränken.
sr: Веб канал углавном утиче на коришћење веб интерфејса од стране ваших клијената. Ова подешавања вам омогућавају да ограничите отварање улазница за клијенте.

source: If you even further want to configure what your customers can see and select, you should have a look in our :doc:`/system/core-workflows` documentation.
de: Wenn Sie noch weiter konfigurieren möchten was Ihre Kunden sehen und auswählen können, sollten Sie einen Blick in unsere Dokumentation zu :doc:`/system/core-workflows` werfen.
sr: Уколико желите да подесите шта ваши клијенти могу да виде и одаберу, погледајте документацију :doc:`радних токова </system/core-workflows>`.

source: The web channel settings page
de: Die Web-Kanal Einstellungs-Seite
sr: Страница подешавања веб канала

source: Settings Affecting Your Customer
de: Einstellungen betreffen Ihre Kunden
sr: Подешавања која утичу на вашег клијента

source: Enable Ticket creation
de: Aktivierung der Ticketerstellung
sr: Укључи отварање тикета

source: You can forbid customers to create tickets via the web interface. This will remove the "➕" button on the lower left. This does not forbid *updating* existing tickets via UI.
de: Sie können die Ticketerstellung über die Weboberfläche für Ihre Kunden einschränken. Dadurch wird die Schaltfläche "➕“ unten links entfernt. Dies verbietet nicht die *Aktualisierung* bestehender Tickets über die Benutzeroberfläche.
sr: Можете забранити клијентима да отварају тикете путем веб интерфејса. Ово ће уклонити дугме "➕" у доњем левом углу. Ово не онемогућава *освежавање* постојећих тикета путем корисничког интерфејса.

source: Default: ``yes``
de: Standard: ``ja``
sr: Подразумевано: ``да``

source: Group selection for Ticket creation
de: Gruppenauswahl für Ticket-Erstellung
sr: Избор групе приликом отварања тикета

source: By default, your customers can create tickets in all groups. As this may be unwanted, especially when having several support levels or internal groups, you can select a set of groups you want to be selectable by your customers.
de: Standardmäßig können Ihre Kunden Tickets in allen Gruppen erstellen. Da dies unerwünscht sein kann, insbesondere wenn Sie mehrere Supportstufen oder interne Gruppen haben, können Sie eine Reihe von Gruppen auswählen, die von Ihren Kunden ausgewählt werden können.
sr: Ваши клијенти подразумевано могу да отварају тикете у свим групама. Пошто ово може бити нежељено, посебно када имате неколико нивоа подршке или интерних група, можете изабрати скуп група које желите да буду доступне.

source: This does not affect your agents. Agents are affected by :doc:`/manage/groups/access-levels`.
de: Dies hat keine Auswirkungen auf Ihre Agenten. Die Einstellung für Agenten finden Sie unter :doc:`/manage/groups/access-levels`.
sr: Ово не утиче на ваше оператере. Оператери су под утицајем :doc:`нивоа приступа </manage/groups/access-levels>`.

source: Default: (empty selection)
de: Standard: (leere Auswahl)
sr: Подразумевано: (без избора)

source: Global Settings Affecting *All* Users
de: Globale Einstellungen, die *alle* Benutzer betreffen
sr: Глобална подешавања која утичу на *све* кориснике

source: Tab behavior after ticket creation
de: Tab-Verhalten nach Ticket-Erstellung
sr: Понашање прозора након отварања тикета

source: This setting allows administrators to provide a default behavior of Zammad's tab *after* ticket update.
de: Mit dieser Einstellung können Administratoren ein Standardverhalten *nach* der Ticketaktualisierung festlegen.
sr: Ово подешавање омогућава администраторима да обезбеде подразумевано понашање Zammad прозора *након* освежавања тикета.

source: Users can always overrule this behavior. If your user decides to select a different tab behavior on any ticket, this action will be the new default behavior for that user.
de: Benutzer können dieses Verhalten jederzeit übersteuern. Wenn Ihr Benutzer ein anderes Tab-Verhalten für ein Ticket auswählt, wird diese Aktion das neue Standardverhalten für diesen Benutzer sein.
sr: Корисници увек могу да преиначити ово понашање. Ако ваш корисник одлучи да изабере другачије понашање прозора на било ком тикету, ова радња ће бити ново подразумевано понашање за тог корисника.

source: Zammad remembers the decision of the user.
de: Zammad speichert die Einstellungen des Benutzers.
sr: Zammad памти одлуке корисника.

source: Default: ``Stay on tab``
de: Standard: ``Tab beibehalten``
sr: Подразумевано: ``Остани у прозору``

source: Ticket zoom with tab behavior to choose for the user
de: Ticket-Ansicht mit Option zur Einstellung des Verhaltens von Zammad
sr: Преглед тикета са понашањем прозора по избору корисника

source: With the release of Zammad 6.3, you can now connect your Zammad with a WhatsApp Business account, allowing your customers to reach out to you through WhatsApp. 🎉
de: Mit der Veröffentlichung von Zammad 6.3 können Sie jetzt Ihr Zammad mit einem WhatsApp Business Konto verbinden, so dass Ihre Kunden Sie über WhatsApp erreichen können. 🎉
sr: Са изласком Zammad 6.3, можете повезати ваш Zammad са WhatsApp Business налогом, омогућавајући вашим клијентима да вас контактирају преко WhatsApp. 🎉

source: If you already dived deep into this topic, you can head to the setup guide. If not, we strongly encourage you to read the prerequisites and limitations of this channel carefully and to follow our tutorial for preparing your setup.
de: Wenn Sie sich bereits eingehend mit diesem Thema befasst haben, können Sie zur Einrichtungsanleitung übergehen. Falls nicht, empfehlen wir Ihnen dringend, die Voraussetzungen und Einschränkungen dieses Kanals sorgfältig zu lesen und unsere Anleitung zur Vorbereitung der Einrichtung zu befolgen.
sr: Уколико сте већ упознати са овом тематиком, можете наставити директно на поставку. Уколико нисте, топло препоручујемо да пажљиво прочитате све у вези захтева и ограничења овог канала и да испратите наш водич за припрему поставке.

source: We tried to keep it clear and created a separate sub-page for the necessary steps on Meta/WhatsApp side.
de: Wir haben versucht, es übersichtlich zu halten und eine separate Unterseite für die notwendigen Schritte auf Meta-/WhatsApp-Seite erstellt.
sr: Покушали смо да будемо јасни и саставили смо посебну страницу са свим неопходним корацима за подешавања на Meta/WhatsApp страни.

source: Please be aware that the usage of **WhatsApp Cloud API** is mandatory to connect WhatsApp to Zammad. You won't be able to connect to WhatsApp in Zammad if you just use the WhatsApp Business *App*. Have a look `here <https://developers.facebook.com/docs/whatsapp/cloud-api>`_ for further information about the Cloud API.
de: Bitte beachten Sie, dass die Nutzung der **WhatsApp Cloud API** zwingend erforderlich ist, um WhatsApp mit Zammad zu verbinden. Sie werden nicht in der Lage sein, sich WhatsApp mit Zammad zu verbinden, wenn Sie nur die WhatsApp Business *App* verwenden. Weitere Informationen über die Cloud API finden Sie `hier <https://developers.facebook.com/docs/whatsapp/cloud-api>`_.
sr: Обратите пажњу да је коришћење **WhatsApp Cloud API** сервиса обавезно ради повезивања WhatsApp са Zammad–ом. Нећете бити у могућности да повежете WhatsApp уколико користите само WhatsApp Business *апликацију*. Погледајте `овде <https://developers.facebook.com/docs/whatsapp/cloud-api>`_ за више информација о Cloud API.

source: There may be additional costs for you from Meta/WhatsApp side. Have a look at their `pricing page <https://developers.facebook.com/docs/whatsapp/pricing>`_ to be safe from surprises.
de: Es können zusätzliche Kosten für Sie auf Meta-/WhatsApp-Seite anfallen. Sie sollten einen Blick auf `deren Preise <https://developers.facebook.com/docs/whatsapp/pricing>`_ werfen, um vor Überraschungen sicher zu sein.
sr: Може доћи до додатних трошкова на страни Meta/WhatsApp. Погледајте њихову `страницу о наплаћивању <https://developers.facebook.com/docs/whatsapp/pricing>`_ да бисте избегли непријатна изненађења.

source: Be aware that if you go through the whole process, it is very time consuming. You should have some time to follow our preparation guide.
de: Seien Sie sich darüber im Klaren, dass es sehr zeitaufwendig ist, wenn Sie den gesamten Prozess durchlaufen. Sie sollten etwas Zeit haben, um unsere Anleitung zur Vorbereitung zu befolgen.
sr: Обратите пажњу да је цео процес поприлично дугачак. Одвојите времена за праћење нашег водича за припрему.

source: There are a number of limitations for this channel. Read them carefully.
de: Für diesen Kanal gibt es eine Reihe von Einschränkungen. Lesen Sie diese sorgfältig durch.
sr: Постоји неколико ограничења у вези коришћења овог канала. Упознајте се са њима.

source: 24-hour customer service window
de: 24-Stunden-Zeitfenster für den Kundenservice
sr: 24-часовни временски оквир за разговор

source: If a customer gets in touch with you via WhatsApp, a 24 hour window is opened. Within this time window you can freely answer the question of the customer. If the customer isn't replying, the service window will be automatically closed after 24 hours. You will not be able to communicate with this customer via WhatsApp due to their privacy policy and until a fresh reply is received from your customer after the service window expires.
de: Wenn sich ein Kunde über WhatsApp bei Ihnen meldet, wird ein 24-Stunden-Fenster geöffnet. Innerhalb dieses Zeitfensters können Sie die Anfrage des Kunden frei beantworten. Wenn der Kunde nicht antwortet, wird das Servicefenster nach 24 Stunden automatisch geschlossen. Sie können mit diesem Kunden aufgrund der Datenschutzbestimmungen nicht über WhatsApp kommunizieren, bis Sie eine neue Antwort von Ihrem Kunden erhalten, nachdem das Zeitfenster abgelaufen ist.
sr: Уколико вас клијент контактира преко WhatsApp, отвара се 24-часовни оквир. У оквиру њега можете слободно одговорити на питање клијента. Уколико клијент не одговара, оквир ће бити аутоматски затворен после 24 часа. Нећете бити у могућнисти да комуницирате са овим клијентом преко WhatsApp услед њихове политике приватности све док не примите свеж одговор од вашег клијента по затварању временског оквира.

source: In case the ticket cannot be closed yet and in order to facilitate an ongoing conversation, automatic reminders will be sent to the customer asking them to reply and keep the service window open. They are sent 23 hours after a message is received, and can be optionally deactivated in the channel configuration.
de: Falls das Ticket noch nicht geschlossen werden kann und um die Konversation aufrecht zu erhalten, werden automatische Erinnerungen an die Kunden gesendet, die sie auffordern, zu antworten und das Servicefenster offen zu halten. Sie werden 23 Stunden nach Eingang einer Nachricht versendet und können optional in der Kanalkonfiguration deaktiviert werden.
sr: У случају да тикет не може да буде затворен и да би олакшали текућу комуникацију, аутоматски подсетници ће бити послати клијенту са молбом да одговоре и продуже временски оквир. Шаљу се 23 часа након пријема поруке, и опционо могу бити искључени у конфигурацији канала.

source: Customer-initiated communication only
de: Nur vom Kunden initiierte Kommunikation
sr: Само комуникација започета од стране клијента

source: The WhatsApp channel only supports customer initiated communication. For business-initiated communication, it would be necessary to create a message template which has to be verified by Meta first which is currently not supported by Zammad.
de: Der WhatsApp-Kanal unterstützt nur vom Kunden initiierte Kommunikation. Für unternehmensinitiierte Kommunikation wäre es notwendig, eine Nachrichtenvorlage zu erstellen, die zuerst von Meta verifiziert werden muss, was derzeit von Zammad nicht unterstützt wird.
sr: WhatsApp канал подрђава само комуникацију коју започну клијенти. За комуникацију који започињете ви било би неопходно да дефинишете шаблон поруке коју Meta мора прво да одобри и који није тренутно подржан од стране Zammad-а.

source: Supported media types
de: Unterstützte Medientypen
sr: Подржани типови медија
