Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: Having both roles also changes what you see in the ticket view, depending on whether you're the "customer" or not.
de: Wenn Sie beide Rollen haben, ändert sich auch die Darstellung in der Ticketansicht, je nachdem, ob Sie der "Kunde" sind oder nicht.
sr: Обе улоге такође мењају оно што видите у приказу тикета, у зависности од тога да ли сте „клијент” тикета или не.

source: Reference Guide: Permissions
de: Anleitung: Berechtigungen
sr: Референтни водич: Дозволе

source: Broadly speaking, there are four types of permission groups. Click on each to go to the detailed list of granular permissions. You can either select the whole permission group (e.g. ``admin``) or a subset of it (e.g. ``admin.text_module``).
de: Grob gesagt gibt es vier Arten von Berechtigungsgruppen. Klicken Sie auf jede Gruppe, um die detaillierte Liste der einzelnen Berechtigungen aufzurufen. Sie können entweder die gesamte Gruppe (z.B. ``admin``) oder eine Teilmenge davon (z.B. ``admin.text_module``) auswählen.
sr: Уопштено говорећи, постоји четири врсте група дозвола. Кликом на сваку можете прегледати списак грануларних дозвола. Можете одабрати или комплетну групу дозвола (нпр. ``admin``) или њен подскуп (нпр. ``admin.text_module``).

source: For access to each page of the admin panel
de: Für den Zugang zu den einzelnen Einstellungsbereichen
sr: За приступ свакој страни администраторског панела

source: For access to customer communications
de: Für den Zugriff auf die Kundenkommunikation
sr: За приступ комуникацији са клијентима

source: 👤 Customer
de: 👤 Kunde
sr: 👤 Клијент

source: Without the ``ticket.customer`` permission, customers can't see the **My Ticket** overview—but they can still log in and open new tickets!
de: Ohne die Berechtigung ``ticket.customer`` können Kunden die Übersicht **Mein Ticket** nicht sehen - sie können sich aber trotzdem anmelden und neue Tickets eröffnen!
sr: Без дозволе ``ticket.customer``, клијенти не могу да виде преглед **Моји тикети**—али и даље могу да се пријаве и отворе нове тикете!

source: :doc:`🎛️ User Preferences <user-preferences-permissions>`
de: :doc:`🎛️ Benutzereinstellungen <user-preferences-permissions>`
sr: :doc:`🎛 Корисничка подешавања <user-preferences-permissions>`

source: For access to your own :user-docs:`user profile </extras/profile-and-settings.html>`
de: Für den Zugriff auf Ihr eigenes :user-docs:`Benutzerprofil </extras/profile-and-settings.html>`
sr: За приступ сопственом :user-docs:`корисничком профилу </extras/profile-and-settings.html>`

source: Role Details
de: Details zur Rolle
sr: Детаљи улоге

source: Default at Signup
de: Aktiv bei Neuanmeldung
sr: Подразумевано приликом регистрације

source: Every new user must be assigned at least one role upon creation. This attribute decides which role to give new users by default (which usually happens when creating a new ticket for a new customer).
de: Jedem neuen Benutzer muss bei der Erstellung mindestens eine Rolle zugewiesen werden. Dieses Attribut entscheidet darüber, welche Rolle neuen Benutzern standardmäßig zugewiesen wird (was normalerweise bei der Erstellung eines neuen Tickets für einen neuen Kunden geschieht).
sr: Сваком новом клијенту мора бити додељена бар једна улога приликом креирања. Овај атрибут одлучује коју улогу ће подразумевано дати новим корисницима (што се обично дешава када се отвори нов тикет за новог клијента).

source: Role overview in the admin panel, showing default role
de: Rollenübersicht in den Einstellungen mit Anzeige der Standardrolle
sr: Преглед улога у административном панелу, са приказом подразумеване улоге

source: The default role is identified in the overview of the **Manage > Roles** admin panel.
de: Die Standardrolle wird in der Übersicht des Einstellungsbereichs **Verwalten > Rollen** angezeigt.
sr: Подразумевана улога је идентификована у прегледу **Управљање > Улоге** административног панела.

source: 🙅 **Default roles should never provide admin/agent permissions.**
de: 🙅 **Standard-Rollen sollten niemals Admin- oder Agenten-Berechtigen beinhalten.**
sr: 🙅 **Подразумеване улоге никада не би требало да дају дозволе администратора/оператера.**

source: Roles can't be deleted but set to inactive. If you do so, all users loose the permissions of this role. If this inactive role is the only one of a user, this account isn't able to do anything in Zammad. The login is still possible.
de: Rollen können nicht gelöscht, sondern auf inaktiv gesetzt werden. Wenn Sie dies tun, verlieren alle Benutzer die Berechtigungen dieser Rolle. Wenn diese inaktive Rolle die einzige eines Benutzers ist, kann dieser Benutzer nichts in Zammad tun. Die Anmeldung ist aber weiterhin möglich.
sr: Улоге није могуће избрисати али се могу искључити. Уколико то учините, сви корисници ће изгубити дозволе на основу ове улоге. Уколико је искључена улога једина коју корисник поседује, тај налог неће моћи да ишта уради у Zammad-у. Пријава ће и даље бити могућа.

source: User Preferences Permissions
de: Benutzereinstellungen Berechtigungen
sr: Дозволе за корисничка подешавања

source: The permissions listed on this page all belong to the ``user_preferences`` namespace. You can select them individually, or you can just select ``user_preferences`` to enable the whole bunch.
de: Die auf dieser Seite aufgeführten Berechtigungen gehören alle zur Berechtigungsgruppe ``user_preferences``. Sie können sie einzeln auswählen oder Sie können einfach ``user_preferences`` auswählen, um alle Rechte der Gruppe zu aktivieren.
sr: Све дозволе наведене на овој страници почињу са називом ``user_preferences``. Можете их одабрати појединачно или једноставно одабрати ``user_preferences`` да бисте омогућили читав низ.

source: User preferences permissions in the New Role dialog
de: Berechtigungen für Benutzereinstellungen im Dialogfeld "Neue Rolle"
sr: Дозволе за корисничка подешавања у дијалогу нове улоге

source: User preferences permissions are shown at the bottom of the New Role dialog...
de: Benutzer-Berechtigungen werden unten im Dialogfeld "Neue Rolle“ angezeigt ...
sr: Дозволе за корисничка подешавања су приказане при дну дијалога нове улоге…

source: User profile page
de: Benutzerprofil-Seite
sr: Страница корисничког профила

source: ...and give users access to the pages of their :user-docs:`User Profile </extras/profile-and-settings.html>`.
de: ...und geben Benutzern Zugriff auf deren :user-docs:`Benutzerprofile </extras/profile-and-settings.html>`.
sr: ...и омогућује корисницима приступ страницама њиховог :user-docs:`корисничког профила </extras/profile-and-settings.html>`.

source: Generate API tokens to control
de: Generieren von API-Tokens zur Kontrolle
sr: Генерисање API кључева за контролу

source: Zammad via :docs:`REST API </api/intro.html>`
de: von Zammad über die :docs:`REST API </api/intro.html>`
sr: Zammad-а преко :docs:`REST API-ја </api/intro.html>`

source: Generated tokens will never have more permissions
de: Erstellte Token haben nie mehr Berechtigungen
sr: Генерисани кључеви никада неће имати више дозвола

source: than the user that generated them.
de: als der Benutzer, der sie erstellt hat.
sr: од корисника који их је генерисао.

source: Appearance configuration
de: Konfiguration Aussehen
sr: Подешавање изгледа

source: Users can switch between dark, light and
de: Benutzer können zwischen Dunkel-, Hell- und
sr: Корисници могу да изаберу између тамног, светлог и

source: automatic mode.
de: Automatik-Modus wechseln.
sr: аутоматског мода.

source: Avatar settings
de: Avatar-Einstellungen
sr: Подешавања аватара

source: Override the default Gravatar with a custom avatar
de: Überschreiben Sie den Standard-Gravatar mit einem eigenen Avatar
sr: Замена подразумеваног Gravatar-а са прилагођеним аватаром

source: Configure the calendar feed
de: Konfigurieren Sie den Kalender-Feed
sr: Подешавање извора календара

source: Manage device login sessions
de: Verwalten von Login Sitzungen
sr: Управљање сесијама пријаве преко уређаја

source: Revoking this permission disables
de: Der Entzug dieser Berechtigung deaktiviert
sr: Опозив ове дозволе искључује

source: “Login detected from a new location” emails.
de: Benachrichtigungs-E-Mails "Anmeldung von einem neuen Standort erkannt".
sr: имејл обавештења „логовање из нове земље”.

source: To learn more, see :doc:`/manage/trigger/system-notifications`.
de: Mehr erfahren Sie unter :doc:`/manage/trigger/system-notifications`.
sr: Да бисте сазнали више, погледајте :doc:`/manage/trigger/system-notifications`.

source: Configure the UI locale/language
de: Konfigurieren Sie die Sprache der Benutzeroberfläche
sr: Подешавање језика корисничког интерфејса

source: Account linking
de: Verknüpfte Konten
sr: Повезивање налога

source: Manually link accounts after signing in
de: Konten nach der Anmeldung manuell verknüpfen
sr: Ручно повезивање налога након пријављивања

source: with :doc:`third-party authentication </settings/security/third-party>`.
de: mit :doc:`Drittanbieter-Authentifizierung </settings/security/third-party>`.
sr: помоћу :doc:`аутентификације преко трећег лица </settings/security/third-party>`.

source: Note: If :ref:`automatic account linking <automatic-account-linking>` fails, this
de: Hinweis: Wenn die :ref:`automatische Verknüpfung von Konten <automatic-account-linking>` fehlschlägt,
sr: Напомена: ако :ref:`аутоматско повезивање налога <automatic-account-linking>` не успе, ово

source: is the only way users can utilize third-party logins.
de: ist dies die einzige Möglichkeit für Benutzer, Logins von Drittanbietern zu verwenden.
sr: је једини начин на који ваши корисници могу да се пријаве преко трећег лица.

source: Configuration of ticket
de: Konfiguration von Ticket
sr: Подешавање тикета

source: notifications
de: Benachrichtigungen
sr: обавештења

source: Agents only receive ticket notifications for
de: Agenten erhalten nur Ticket-Benachrichtigungen für
sr: Само оператери могу да примају обавештења о тикетима

source: :doc:`groups they have “full” access to </manage/groups/access-levels>`.
de: :doc:`Gruppen, auf die sie "vollen" Zugriff haben </manage/groups/access-levels>`.
sr: за :doc:`групе у којима имају „пун” приступ </manage/groups/access-levels>`.

source: Customers can't receive ticket notifications at all.
de: Kunden können überhaupt keine Ticket-Benachrichtigungen erhalten.
sr: Клијенти уопште не могу да примају обавештења о тикетима.

source: Designate a substitute for
de: Bestimmen Sie einen Vertreter für
sr: Одређивање заменe за

source: out-of-office hours
de: Abwesenheitszeiten
sr: функцију ван канцеларије

source: This does **not** grant that person the permissions /
de: Dies verleiht dieser Person **nicht** die Berechtigung /
sr: Ово *не омогућава** доделу

source: :doc:`group access levels </manage/groups/access-levels>` of the agent
de: :doc:`Gruppen-Berechtigungen </manage/groups/access-levels>` des Agenten
sr: :doc:`ниова групних дозвола </manage/groups/access-levels>` особи

source: they're replacing.
de: den sie ersetzen.
sr: која замењује оператера.

source: Allow users to define their own
de: Ermöglicht Benutzern das Festlegen ihrer eigenen
sr: Дозвољава корисницима да одреде сопствени

source: overview order.
de: Reihenfolge ihrer Übersichten.
sr: редослед сортирања прегледа.

source: Optional permission; disabled by default.
de: Optionale Berechtigung; standardmäßig deaktiviert.
sr: Опциона дозвола; подразумевано искључена.

source: The order your user chooses here cannot be
de: Die Reihenfolge, die Ihr Benutzer hier wählt, kann nicht
sr: Редослед који корисник одабере овде не може бити

source: overwritten by admins. Renaming or resorting
de: von Admins überschrieben werden. Umbenennen oder Umsortieren
sr: преписан од стране администратора. Промена назива или редоследа

source: overviews has no effect on custom orders.
de: von Übersichten hat keine Auswirkungen auf benutzerdefinierte Anpassungen.
sr: прегледа нема утицаја на прилагођене редоследе.

source: Change account password
de: Account Kennwort ändern
sr: Промена лозинке налога

source: Make sure to **revoke this permission** for all your users
de: Stellen Sie sicher, dass Sie diese Berechtigung für alle Ihre Benutzer **widerrufen**
sr: Обавезно **опозовите ову дозволу** за све своје кориснике

source: when using a third-party identity server (like LDAP) as
de: falls Sie einen Identitätsserver eines Drittanbieters (wie LDAP)
sr: када користите сервис идентификације преко трећег лица (нпр. LDAP) као

source: your only allowed authentication method.
de: als Ihre einzige zulässige Authentifizierungsmethode verwenden.
sr: ваш једини метод аутентификације.

source: Allow users to setup and configure
de: Ermöglicht Benutzern das Festlegen ihrer eigenen
sr: Дозвољава корисницима подесе и конфигуришу

source: their two factor authentication
de: Zwei-Faktor-Authentifizierung
sr: своју двофакторску аутентификацију

source: :doc:`Two factor authentication </settings/security/two-factor>` has to be enabled
de: Die doc:`Zwei-Faktor-Authentifizierung </settings/security/two-factor>` muss dazu aktiviert sein
sr: :doc:`Двофакторска аутентификација </settings/security/two-factor>` мора бити укључена

source: that users can setup and configure it.
de: damit die Benutzer es einrichten und konfigurieren können.
sr: да би корисници могли да је подесе и конфигуришу.

source: Scheduler
de: Automatisierung
sr: Планер

source: Zammad's scheduler performs time-based automated actions. The most important difference to :doc:`trigger` is that no action is required for the execution. You can set up your own scheduler jobs and configure:
de: Der Scheduler von Zammad führt zeitbasierte automatisierte Aktionen durch. Der wichtigste Unterschied zu :doc:`trigger` ist, dass für die Ausführung keine Aktion erforderlich ist. Sie können Ihre eigenen Aufgaben für die Automatisierung einrichten und konfigurieren:
sr: Zammad-ов планер извршава временски аутоматизоване радње. Најважнија разлика у односу на :doc:`окидаче <trigger>` је да није неопходан догађај за покретање. Можете направити своје сопствене планере и подесити:

source: At which time they should run
de: Zu welchem Zeitpunkt sie ausgeführt werden sollen
sr: Када би требало да се извршавају

source: Which objects should be modified based on conditions
de: Welche Objekte aufgrund von Bedingungen geändert werden sollen
sr: Који објекти ће бити узети у обзир у односу на услове

source: What changes or actions should be executed for matching objects
de: Welche Änderungen oder Aktionen für übereinstimmende Objekte ausgeführt werden sollen
sr: Које измене или радње би требало да буду извршене над објектима који се подударају

source: As an example, scheduler jobs can be used to send periodic reminder emails. If this is what you want to do, have a look at :doc:`/misc/variables` to build customized email templates.
de: Zum Beispiel können Automatisierungen dazu verwendet werden, regelmäßige Erinnerungs-E-Mails zu versenden. Wenn Sie dies tun möchten, werfen Sie einen Blick auf :doc:`/misc/variables`, um angepasste E-Mail-Vorlagen zu erstellen.
sr: Као пример, планери се могу користити за слање периодичних имејл порука са подсетницима. Уколико је то оно што желите да постигнете, погледајте :doc:`/misc/variables` за прављење прилагођених имејл шаблона.

source: Scheduler jobs can process a maximum of ``2000`` objects per run. This is a security function in case you accidentally misconfigured the scheduler.
de: Automatisierungsaufgaben können maximal ``2000`` Objekte pro Lauf verarbeiten. Dies ist eine Sicherheitsfunktion für den Fall, dass Sie eine Automatisierungsaufgabe versehentlich falsch konfiguriert haben.
sr: Планери могу да обраде највише ``2000`` објеката по сваком извршавању. Ово је безбедносна функција у случају да случајно пропустите да подесите планер.

source: Basics
de: Grundlagen
sr: Основе

source: Manage Scheduler Jobs
de: Automatisierungsaufgaben verwalten
sr: Управљање планерима

source: You can find the scheduler configuration in the admin settings under *Manage > Scheduler*. Create a new scheduler job by clicking the **New Scheduler** button in the top right corner. This opens a dialog where you can define your scheduler job. To edit an existing scheduler, simply click on the row and the dialog gets opened again. The ︙ action menu holds the options to clone or delete the scheduler job.
de: Sie finden die Konfiguration der Automatisierung in den Verwaltungseinstellungen unter *Verwalten > Automatisierung*. Erstellen Sie eine neue Aufgabe, indem Sie auf die Schaltfläche **Neue Automatisierung** in der oberen rechten Ecke klicken. Daraufhin öffnet sich ein Dialog, in dem Sie Ihre Aufgabe definieren können. Wenn Sie eine bestehende Automatisierungsaufgabe bearbeiten möchten, klicken Sie einfach auf die Zeile und der Dialog wird erneut geöffnet. Das Aktionsmenü ︙ enthält die Optionen zum Klonen oder Löschen der Aufgabe.
sr: Подешавање планера можете пронаћи у панелу администратора под *Управљање > Планер*. Додајте нови планер кликом на дугме **Нови планер** у горњем десном углу. Ово ће отворити дијалог где можете дефинисати ваш планер. За уређивање постојећих планера, једноставно кликните на ред у табели и дијалог ће се отворити. Падајући мени ︙ садржи радње за клонирање или брисање планера.

source: After creating at least one scheduler job, you can find a table in the main area. There you can see additional information like how many objects were processed at the last run and how many will be processed at the next run.
de: Nachdem Sie mindestens eine Aufgabe für die Automatisierung erstellt haben, finden Sie im Hauptbereich eine Tabelle. Dort sehen Sie zusätzliche Informationen, z.B. wie viele Objekte beim letzten Lauf verarbeitet wurden und wie viele beim nächsten Lauf verarbeitet werden.
sr: По додавању бар једног планера, појавиће се табела у главном делу. Можете приступити додатним информацијама као што су број обрађених објеката приликом претходног извршавања и колико ће бити обрађено при следећем.

source: Screenshot shows Zammad's scheduler management
de: Screenshot zeigt die Automatisierung von Zammad
sr: Снимак екрана који приказује уређивање планера у Zammad-у

source: Scheduler Job Structure
de: Struktur Automatisierungsaufgabe
sr: Структура планера

source: Read on for details about the main parts of a scheduler job. A description of all available fields follows in the :ref:`scheduler-job-details` section.
de: Lesen Sie weiter, um mehr über die Hauptbestandteile einer Automatisierungsaufgabe zu erfahren. Eine Beschreibung aller verfügbaren Felder folgt im Abschnitt :ref:`scheduler-job-details`.
sr: Читајте даље за основне појмове планера. Опис свих доступних поља се налази у одељку :ref:`scheduler-job-details`.

source: Execution Time
de: Ausführungszeit
sr: Време извршавања

source: Define time(s) and day(s), when the scheduler job is supposed to run. Simply click the day and time table entries to select and deselect items. You can see a textual preview of what you configured above the tables.
de: Definieren Sie Zeit(en) und Tag(e), an denen die Aufgabe ausgeführt werden soll. Klicken Sie einfach auf die Einträge in der Tages- und Zeittabelle, um Elemente aus- oder abzuwählen. Oberhalb der Tabellen sehen Sie eine Textvorschau davon, was Sie konfiguriert haben.
sr: Одређује времена и дане када се планер извршава. Једноставно одаберите дан и време кликом на ставке. Можете прегледати текстуалну репрезентацију подешавања изнад табеле.

source: Screenshot shows date and time selection in scheduler job configuration
de: Screenshot zeigt die Auswahl von Datum und Uhrzeit in der Konfiguration einer Automatisierungsaufgabe
sr: Снимак екрана који приказује селекцију датума и времена у подешавању планера

source: Define Object Condition
de: Objektbedingung definieren
sr: Одредите услове објекта

source: Define a condition to specify the affected objects you want to apply changes or perform an action. If you're not familiar with conditions in Zammad, you can find an explanation at the :doc:`/misc/object-conditions/index` page. The availability of attributes depends on the selected object context.
de: Definieren Sie eine Bedingung, um die betroffenen Objekte anzugeben, auf die Sie Änderungen anwenden oder eine Aktion durchführen möchten. Wenn Sie mit den Bedingungen in Zammad nicht vertraut sind, finden Sie eine Erklärung auf der Seite :doc:`/misc/object-conditions/index`. Die Verfügbarkeit von Attributen hängt vom gewählten Objektkontext ab.
sr: Одређује услове за одабир објеката на који желите да се изврше измене или радње. Уколико вам Zammad услови нису познати, можете пронаћи објашњење на страници :doc:`/misc/object-conditions/index`. Доступност атрибута зависти од одабраног контекста објекта.

source: Screenshot shows object condition definition in scheduler job configuration
de: Screenshot zeigt die Definition der Objektbedingungen in der Konfiguration einer Automatisierungsaufgabe
sr: Снимак екрана који приказује дефиницију услова у подешавању планера

source: Define Action
de: Aktion festlegen
sr: Одаберите радњу

source: In this area, you define which changes or actions should get applied to the affected objects. Depending on the selected object context, the available options differ.
de: In diesem Bereich legen Sie fest, welche Änderungen oder Aktionen auf die betroffenen Objekte angewendet werden sollen. Je nach ausgewähltem Objektkontext unterscheiden sich die verfügbaren Optionen.
sr: У овом одељку, можете дефинисати које измене или радње ће бити извршене на објекте који се подударају. У завистности од одабраног контекста објекта, доступне опције се могу разликовати.

source: Screenshot shows action selection in scheduler job configuration
de: Screenshot zeigt die Aktionsauswahl in der Konfiguration einer Automatisierungsaufgabe
sr: Снимак екрана који приказује одабир радње у подешавању планера

source: Scheduler Job Details
de: Details Automatisierungsaufgabe
sr: Детаљи планера

source: Choose a name for the scheduler.
de: Wählen Sie einen Namen für die Automatisierung.
sr: Изаберите назив планера.

source: When should the job run?
de: Wann soll die Aufgabe ausgeführt werden?
sr: Када ће се посао извршити?

source: Choose the points in time when the scheduler should run. It depends on the configured :doc:`timezone in Zammad </settings/branding>`.
de: Wählen Sie die Zeitpunkte, zu denen die Automatisierung laufen soll. Es basiert auf der konfigurierten :doc:`Zeitzone in Zammad </settings/branding>`.
sr: Изаберите време извршавања када би планер требало да се покрене. Зависи од подешене :doc:`Zammad-ове временске зоне </settings/branding>`.

source: Object
de: Objekt
sr: Објекат

source: Choose in which object context the scheduler should be executed. Possible objects are: **Organization**, **Ticket** and **User**.
de: Wählen Sie, in welchem Objektkontext die Automatisierung ausgeführt werden soll. Mögliche Objekte sind: **Organisation**, **Ticket** und **Benutzer**.
sr: Изаберите у ком објектном контексту планер треба да буде извршен. Могући објекти су: **организација**, **тикет** и **корисник**.

source: Conditions for affected objects
de: Bedingungen für zu verarbeitende Objekte
sr: Услови за захваћене објекте

source: Determine the object attributes to select the objects on which the actions will be applied.
de: Bestimmen Sie mit Objektattributen die Objekte, auf die die Aktionen angewendet werden sollen.
sr: Одредите атрибуте (услове) објекта да бисте одабрали објекте на којима ће се извршити радње.
