Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: Down- or upgrading during the trial period *is not* possible.
de: Ein Down- oder Upgrade während des Testzeitraums ist *nicht* möglich.
sr: Враћање на претходни пакет или унапређење пакета током пробном периода *није могуће*.

source: Screenshot showing payment options and a pricing summary
de: Screenshot mit Zahlungsoptionen und einer Preisübersicht
sr: Снимак екрана који приказује начине плаћања и преглед цена

source: Billing Information
de: Informationen zur Abrechnung
sr: Информације о наплати

source: You can control all billing relevant information like invoices and the billing address.
de: Sie können alle abrechnungsrelevanten Informationen wie Rechnungen und die Rechnungsadresse kontrollieren.
sr: Можете прегледати све релевантне податке као што су рачуни и адреса за наплату.

source: All adjusted billing information below only affect future invoices. If your invoice was issued wrong, please contact `our sales team <https://zammad.com/en/company/contact>`_.
de: Alle unten aufgeführten Rechnungsinformationen betreffen nur zukünftige Rechnungen. Sollte eine Rechnung falsch ausgestellt worden sein, wenden Sie sich bitte an `unser Sales-Team <https://zammad.com/de/company/contact>`_.
sr: Све измене података наплате испод ће утицати само на будуће рачуне. Ако је издати рачун погрешан, молимо контактирајте `наш тим продаје <https://zammad.com/en/company/contact>`_.

source: Billing address
de: Rechnungsadresse
sr: Адреса за наплату

source: Provide your company address here, make sure to include the name of the company in case required. This address will be referenced on your invoice.
de: Geben Sie hier die Adresse und den Namen Ihres Unternehmens an. Diese angaben werden auf Ihrer Rechnung aufgeführt.
sr: Овде унесите адресу ваше фирме, али водите рачуна да укључите и назив фирме у случају да је потребно. Ова адреса ће бити укључена у ваш рачун.

source: VAT ID
de: Mehrwertsteuernummer
sr: ПДВ број

source: Provide your VAT ID here. If applicable your invoice will not contain German VAT. Please make sure to pay the VAT in your country as required.
de: Geben Sie hier Ihre Umsatzsteuer-ID an. Falls zutreffend, wird Ihre Rechnung keine deutsche Mehrwertsteuer enthalten. Bitte vergewissern Sie sich, dass Sie die Mehrwertsteuer in Ihrem Land wie erforderlich abführen.
sr: Овде унесите ваш ПДВ број (ПИБ). Ако се не односи на вас, рачун неће обрачунати немачки ПДВ. Водите рачуна да платите ПДВ у вашој земљи ако је потребно.

source: Billing Email Address
de: Rechnungs-E-Mail-Adresse
sr: Имејл адреса за наплату

source: Usually the instance owner (the person that registered the instance) will receive all emails including the invoices. In case you have your own billing department, you can provide their email address here.
de: Normalerweise erhält der Instanzinhaber (die Person, die die Instanz registriert hat) alle E-Mails einschließlich der Rechnungen. Falls Sie eine eigene Rechnungsabteilung haben, können Sie deren E-Mail-Adresse hier angeben.
sr: Обично ће власник инстанце (особа која је регистровала инстанцу) примити све имејл поруке укључујући и рачуне. У случају да имате посебно одељење за наплату, овде можете унети њихову имејл адресу.

source: All billing relevant information will then be sent to this email address.
de: Alle rechnungsrelevanten Informationen werden dann an diese E-Mail-Adresse gesendet.
sr: Све информације у вези наплате ће убудуће бити послате на ову имејл адресу.

source: Invoices are sent as attachment (PDF) to this email address.
de: Die Rechnungen werden als Anhang (PDF) an diese E-Mail-Adresse gesendet.
sr: Рачун се шаљу као прилози (PDF) на ову имејл адресу.

source: Don't forget to press the *Update billing information* button after you changed above settings.
de: Vergessen Sie nicht, auf die Schaltfläche *Update billing information* zu klicken, nachdem Sie die obigen Einstellungen geändert haben.
sr: Не заборавите да кликнете на дугме *Освежи* по изменама подешавања изнад.

source: Screenshot showing options for billing information within the subscription menu
de: Screenshot mit Optionen für Rechnungsinformationen im Menü "Abonnement"
sr: Снимак екрана који приказује опције наплате у оквиру менија претплате

source: Payment Method
de: Zahlungsart
sr: Начин плаћања

source: You can pay via credit card or SEPA mandate.
de: Sie können per Kreditkarte oder SEPA-Mandat bezahlen.
sr: Моћете платити уз помоћ кредитне картице или SEPA налога.

source: Credit card
de: Kreditkarte
sr: Кредитна картица

source: Simply follow the dialogue by clicking *authorize credit card* and confirm -if required by your bank- your consent to Zammad using your card for the payments.
de: Folgen Sie einfach dem Dialog, indem Sie auf *Kreditkarte autorisieren* klicken und bestätigen Sie - falls von Ihrer Bank verlangt - Ihr Einverständnis, dass Zammad Ihre Karte für die Zahlungen verwendet.
sr: Једноставно пратите упутства кликом на *ауторизуј кредитну картицу* и потврдите – уколико је неопходно преко ваше банке – вашу сагласност са тим да Zammad користи вашу картицу за наплату.

source: SEPA Direct Debit
de: SEPA Lastschriftmandat
sr: SEPA трајни налог

source: Provide the requested information of the bank account holder and update if you're ready. You'll then receive an email with the SEPA mandate.
de: Geben Sie die angeforderten Informationen des Kontoinhabers an und aktualisieren Sie sie, wenn Sie bereit sind. Sie erhalten dann eine E-Mail mit dem SEPA-Mandat.
sr: Обезбедите захтеване податке о држаоцу рачуна и освежите их ако сте спремни. Након тога примићете имејл са SEPA налогом.

source: Technically there's also the possibility to pay via invoice, however - this method only applies to a fairly low number of instances. Please contact `our sales team <https://zammad.com/en/company/contact>`_ for more information.
de: Technisch gesehen gibt es auch die Möglichkeit, per Rechnung zu bezahlen, allerdings gilt diese Methode nur für eine relativ geringe Anzahl von Fällen. Bitte kontaktieren Sie `unser Sales Team <https://zammad.com/de/company/contact>`_ für weitere Informationen.
sr: Технички гледано постоји и могућност наплате путем фактуре, међутим – овај начин се односи само на мали број инстанци. Молимо контактирајте `наш тим продаје <https://zammad.com/en/company/contact>`_ за више информација.

source: Cancel Subscription
de: Abonnement kündigen
sr: Откажи претплату

source: Do you want to cancel your subscription? In case you no longer want to use Zammad's SaaS, you can cancel your subscription by using the red *Yes, please cancel my subscription* button.
de: Möchten Sie Ihr Abonnement kündigen? Falls Sie Zammads SaaS nicht mehr nutzen möchten, können Sie Ihr Abonnement über die rote Schaltfläche *Ja, ich möchte mein Abonnement kündigen* beenden.
sr: Да ли желите да откажете вашу претплату? У случају да не желите више да користите Zammad SaaS, можете отказати своју претплату коришћењем црвеног дугмета *Да, откажите моју претплату*.

source: To cancel the subscription, enter the FQDN of your Zammad instance and provide a reason for your cancellation.
de: Um das Abonnement zu kündigen, geben Sie den FQDN Ihrer Zammad-Instanz ein und geben Sie einen Grund für Ihre Kündigung an.
sr: Да бисте отказали претплату, унесите FQDN ваше Zammad инстанце и одаберите разлог вашег отказа.

source: Your subscription will end the day after your trial or billing period ends.
de: Ihr Abonnement endet am Tag nach Ablauf Ihres Test- oder Abrechnungszeitraums.
sr: Ваша претплата ће истећи дан након што се заврше ваш пробни или период наплате.

source: Screenshot showing subscription cancellation dialog
de: Screenshot zeigt Dialog zur Kündigung des Abonnements
sr: Снимак екрана који приказује дијалог за отказивање претплате

source: We will remind you about your cancelled subscription several times up front. After the subscription ended all instance data will be removed. A restore *is not* possible after that point!
de: Wir werden Sie mehrmals im Voraus an Ihr gekündigtes Abonnement erinnern. Nach Beendigung des Abonnements werden alle Instanzdaten gelöscht. Eine Wiederherstellung ist danach *nicht* möglich!
sr: Обавестићемо вас о отказаној претплати неколико пута. Након престанка претплате сви подаци ваше инстанце ће бити уклоњени. Након овог тренутка *није могуће* вратити податке!

source: **😖 Cancelled by accident?**
de: **😖 Aus Versehen gekündigt?**
sr: **😖 Отказали сте грешком?**

source: You can always undo the cancellation via the *Yes, undo the cancellation of my subscription* button up to the last subscription day!
de: Sie können die Kündigung jederzeit über die Schaltfläche *Ja, meine Abonnement-Kündigung soll widerrufen werden* bis zum letzten Abonnementtag rückgängig machen!
sr: Увек можете одустати од отказивања путем дугмета *Да, одустани од отказивања моје претплате* све до последњег дана пре истека претплате!

source: Screenshot showing a red button to cancel the subscription cancellation
de: Screenshot mit roter Schaltfläche zur Kündigung des Abonnements
sr: Снимак екрана који приказује црвено дугме за одустајање од отказивања претплате

source: Payment History
de: Zahlungshistorie
sr: Историјат плаћања

source: The payment history will display a history of all paid invoices. At this point you can also download these in case you need them again.
de: Der Zahlungsverlauf zeigt eine Übersicht aller bezahlten Rechnungen an. An dieser Stelle können Sie diese auch herunterladen, falls Sie dieser nochmal benötigen.
sr: Историјат плаћања приказује евиденцију свих плаћених рачуна. Овде можете преузети рачуне у случају да су вам поново потребни.

source: You will only find *paid* invoices here. Invoices that are to be billed are not available before the payment is completed.
de: Sie werden hier nur *bezahlte* Rechnungen finden. Ausgestellte Rechnungen sind nicht verfügbar, bevor die Zahlung eingegangen ist.
sr: Овде ћете наћи само *плаћене* рачуне. Рачуни који још нису плаћени нису доступни.

source: Date
de: Datum
sr: Датум

source: Date of the invoice creation.
de: Datum der Rechnungserstellung.
sr: Датум издавања рачуна.

source: Amount
de: Betrag
sr: Износ

source: Invoice total including VAT if applicable.
de: Rechnungsbetrag einschließlich Mehrwertsteuer, falls zutreffend.
sr: Износ рачуна укључујући и ПДВ ако се обрачунава.

source: Contains contract period (monthly or yearly) and hosted plan for the subscription period in question.
de: Enthält die Vertragslaufzeit (monatlich oder jährlich) und den Hosting Plan für die betreffende Abonnementdauer.
sr: Садржи уговорни период (месечни или годишњи) и хостинг план за дотични период претплате.

source: Payment method / Service period
de: Bezahlmethode / Service-Zeitraum
sr: Начин плаћања / Уговорни период

source: Used bank account or credit card as well as the subscription period the invoice is about.
de: Verwendete Bankverbindung oder Kreditkarte sowie der Abonnementzeitraum, auf den sich die Rechnung bezieht.
sr: Коришћен рачун банке или кредитна картица као и уговорни период рачуна.

source: It might happen that the invoice date and subscription period differ. This is nothing to worry about, the subscription periods will be accounted later on.
de: Es kann vorkommen, dass das Rechnungsdatum und der Abonnementzeitraum voneinander abweichen. Das ist kein Grund zur Sorge, die Abonnementzeiträume werden später verrechnet.
sr: Може се догодити да се датум издавања рачуна и уговорни период разликују. Не брините око овога, уговорни период ће бити обрачунат накнадно.

source: Receipt
de: Quittung
sr: Признаница

source: Use the arrow to download the invoice in question. You can download all available invoices any time you need to here!
de: Verwenden Sie den Pfeil, um die betreffende Rechnung herunterzuladen. Sie können alle verfügbaren Rechnungen jederzeit hier herunterladen!
sr: Користите иконицу стрелице за преузимање рачуна. Овде можете преузети све доступне рачуне у било ком тренутку!

source: Screenshot showing payment history of a hosted instance
de: Screenshot der Zahlungshistorie einer Hosting-Instanz
sr: Снимак екрана који приказује историјат плаћања хостоване инстанце

source: I set up a trial account but am missing functions to test
de: Ich habe ein Testkonto eingerichtet, aber mir fehlen Funktionen zum Testen
sr: Регистровао сам пробни налог али немам приступ неким функцијама за тестирање

source: The trial instance is running within the professional package allowing up to three agents.
de: Die Testinstanz läuft im Rahmen des Professional-Pakets und erlaubt bis zu drei Agenten.
sr: Пробна инстанца ради у оквиру Professional пакета и дозвољава до три оператера.

source: Can I change package within the trial?
de: Kann ich innerhalb der Testphase das Paket wechseln?
sr: Да ли могу да променим пакет у оквиру пробног периода?

source: No. As soon as the package is changed the subscription begins.
de: Nein. Sobald das Paket gewechselt wird, beginnt das Abonnement.
sr: Не. По промени пакета започеће претплата.

source: What happens to my trial instance after the trial period ended?
de: Was passiert mit meiner Testinstanz nach Ablauf des Testzeitraums?
sr: Шта се дешава са мојом пробном инстанцом након пробног периода?

source: Your instance will automatically be canceled for you. Please see *What happens to my instance after it has been canceled?* for more.
de: Ihre Instanz wird automatisch für Sie gekündigt. Weitere Informationen finden Sie unter *Was passiert mit meiner Instanz, nachdem sie gekündigt wurde?*.
sr: Ваша инстанца ће бити аутоматски отказана. Молимо погледајте *Шта се дешава са мојом инстанцом по отказивању?* за више детаља.

source: What happens to my instance after it has been canceled?
de: Was passiert mit meiner Instanz, nachdem sie gekündigt wurde?
sr: Шта се дешава са мојом инстанцом по отказивању?

source: That depends slightly on your instance state:
de: Das hängt ein wenig vom Status Ihrer Instanz ab:
sr: Ово зависи од стања ваше инстанце:

source: Trial instance
de: Test-Instanz
sr: Пробна инстанца

source: If you're still on trial, we will ice your instance and remind you once again about your instance. We then will wait some days and remove your instance from our system. This is the last time we will inform you by Email.
de: Wenn Sie sich noch im Testzeitraum befinden, werden wir Ihre Instanz einfrieren und Sie noch einmal an Ihre Instanz erinnern. Wir werden dann einige Tage warten und Ihre Instanz aus unserem System entfernen. Dies ist das letzte Mal, dass wir Sie per E-Mail informieren.
sr: Ако сте још увек у пробном периоду, замрзнућемо вашу инстанцу и подсетити вас још једанпут. Онда ћемо сачекати пар дана и уклонити вашу инстанцу из нашег система. Након овога ћемо вас обавестити путем имејла последњи пут.

source: Paid instance
de: Bezahl-Instanz
sr: Плаћена инстанца

source: If you're a paying customer and canceled your subscription, the instance removal will take place the day after your last subscription day.
de: Wenn Sie ein zahlender Kunde sind und Ihr Abonnement gekündigt haben, erfolgt die Entfernung der Instanz am Tag nach Ihrem letzten Abonnementtag.
sr: Ако сте плаћали и откажете вашу претплату, уклањање инстанце ће започети један дан након истека ваше претплате.

source: Can removed instances be restored?
de: Können entfernte Instanzen wiederhergestellt werden?
sr: Да ли се уклоњене инстанце могу вратити?

source: No. Once your instance has been removed, a restoration is not possible.
de: Nein. Sobald Ihre Instanz entfernt wurde, ist eine Wiederherstellung nicht mehr möglich.
sr: Не. По уклањању ваше инстанце, враћање података више није могуће.

source: System Report
de: System-Bericht
sr: Системски извештај

source: In this place you can't configure Zammad. Instead you can obtain a system report about Zammad and its configuration.
de: An dieser Stelle können Sie Zammad nicht konfigurieren. Stattdessen können Sie einen Bericht über Zammad und seine Konfiguration abrufen.
sr: Овде не можете подесити ваш Zammad. Уместо тога можете преузети системски извештај о Zammad-у и његовој конфигурацији.

source: See the description in Zammad for an explanation. You can even find a preview of the included data below the **Download** button.
de: Lesen Sie die Beschreibung in Zammad für eine Erklärung der Funktion. Sie können außerdem eine Vorschau der enthaltenen Daten unter der Schaltfläche **Herunterladen** finden.
sr: Погледајте опис у Zammad-у за објашњење. Можете чак видети и приказ укључених података испод дугмета **Преузми**.

source: Zammad never sends this automatically to anyone. It is a manual process only to provide better support based on your configuration.
de: Zammad sendet diese Daten niemals automatisch an irgendjemanden. Es handelt sich um einen manuellen Prozess, der nur dazu dient, eine bessere Unterstützung in Supportfällen auf der Grundlage Ihrer Konfiguration zu bieten.
sr: Zammad никада неће аутоматски послати овај извештај икоме. У питању је мануелни процес само у сврху унапређења подршке на основу ваше конфигурације.

source: Translations
de: Übersetzungen
sr: Преводи

source: Translations of Zammad are processed centrally in our `Weblate instance <https://translations.zammad.org/>`_. This allows non-developers to review and update translation texts of the language they actually speak.
de: Die Übersetzungen von Zammad werden zentral in unserer `Weblate-Instanz <https://translations.zammad.org/>`_ bearbeitet. So können auch Nicht-Entwickler die Übersetzungstexte in der Sprache, die sie tatsächlich sprechen, überprüfen und aktualisieren.
sr: Преводи за Zammad се прикупљају централно путем наше `Weblate инстанце <https://translations.zammad.org/>`_. Ово омогућава и особама које нису вичне програмирању да прегледају и освеже текстове превода за језик којим говоре.

source: Your language is in an incomplete translation state or has typos? Please consider helping us in sorting this out! All you need is either a GitHub account or to register directly in our instance.
de: Ihre Sprache ist unvollständig oder weist Tippfehler auf? Bitte helfen Sie uns dabei, dies zu beheben! Alles, was Sie brauchen, ist entweder ein GitHub Konto oder eine direkte Registrierung in unserer Instanz.
sr: Ваш језик има некомплетан превод или има грешке? Молимо узмите у обзир да нам помогнете са овим! Све што вам је неопходно је или GitHub налог или директна регистрација на нашој инстанци.

source: Did you know? This is also where the documentation translations are handled. 🤓
de: Wussten Sie das? Hier werden auch die Übersetzungen der Dokumentation vorgenommen. 🤓
sr: Да ли сте знали? Ово је место где се прикупљају и преводи за документацију. 🤓

source: Have a look in our :docs:`contribution section </contributing/start.html#translation>` in the system documentation to get started!
de: Werfen Sie einen Blick in unseren :docs:`Contribution Bereich </contributing/start.html#translation>` in der Systemdokumentation, um loszulegen!
sr: Погледајте наш :docs:`одељак о преводима </contributing/start.html#translation>` у системској документацији за прве кораке!

source: Local Translations
de: Lokale Übersetzungen
sr: Локални преводи

source: Apart from these system translations, there's still local translations you can manage. This is relevant if you added custom objects that require translations or even custom states and priorities.
de: Abgesehen von diesen Systemübersetzungen können Sie auch noch lokale Übersetzungen verwalten. Dies ist wichtig, wenn Sie benutzerdefinierte Objekte hinzugefügt haben, die Übersetzungen erfordern, oder sogar benutzerdefinierte Status und Prioritäten.
sr: Осим ових системских превода, постоје и локални преводи којима можете управљати. Ово се односи и ако сте додали прилагођене објекте који захтевају преводе па чак и прилагођена стања и приоритети.

source: Translation management screen within the admin menu
de: Ansicht der Übersetzungsverwaltung im Admin Menü
sr: Страна управљања преводима у оквиру администраторског панела

source: Updating Translations
de: Aktualisierung von Übersetzungen
sr: Освежавање превода

source: Because of how Zammad ships translations, the only way to update the system translations is to update your Zammad installation. The benefit of this is that you no longer need internet access during a Zammad upgrade as the package has everything it requires already.
de: Aufgrund der Art und Weise wie Zammad Übersetzungen ausliefert, ist die Aktualisierung Ihrer Zammad-Installation die einzige Möglichkeit, die Systemübersetzungen zu aktualisieren. Der Vorteil dabei ist, dass Sie während eines Zammad-Upgrades keinen Internetzugang mehr benötigen, da das Paket bereits alles enthält, was es benötigt.
sr: С обзиром на начин на који Zammad обезбеђује преводе, једини начин да освежите системске преводе је да ажурирате вашу Zammad инсталацију. Једна од користи овог приступа да вам више није неопходан приступ интернету током ажурирању Zammad-а јер пакет садржи све што је потребно.

source: Translation of Custom Objects
de: Übersetzung von benutzerdefinierten Objekten
sr: Превод прилагођених објеката

source: No problem at all! You can customize any translation locally, even if it is not initially provided by the system.
de: Überhaupt kein Problem! Sie können jede Übersetzung lokal anpassen, auch wenn sie ursprünglich nicht vom System bereitgestellt wurde.
sr: Нема проблема! Можете прилагодити било који локални превод, чак иако иницијално није дошао са системом.

source: Translation is supported for a broad number of features, including but not limited to custom:
de: Die Übersetzung wird für eine große Anzahl von Funktionen unterstützt, einschließlich, aber nicht beschränkt auf benutzerdefinierte:
sr: Преводи су подржани у већем броју функција, укључујући и:

source: Object Attributes
de: Objekt-Attribute
sr: Атрибути објеката

source: Ticket Macros
de: Ticket-Makros
sr: Макрои тикета

source: Ticket Overviews
de: Ticket-Übersichten
sr: Прегледи тикета

source: Ticket Priorities
de: Ticket-Prioritäten
sr: Приоритети тикета

source: Ticket States
de: Ticket-Status
sr: Стања тикета

source: Customizing Translations
de: Übersetzungen anpassen
sr: Прилагођавање превода

source: Within the translation screen, simply click on the **New Translation** button.
de: Klicken Sie in der Ansicht "Übersetzung" einfach auf die Schaltfläche **Neue Übersetzung**.
sr: На страници за управљање превода, једноставно кликните на зелено дугме **Нови превод**.

source: New translation dialog
de: Dialog neue Übersetzung
sr: Дијалог новог превода

source: In the dialog you can immediately enter the exact translation source (if you know it) and your custom translation text for it and click **Submit**.
de: In dem Dialog können Sie sofort die genaue Übersetzungsquelle (sofern Sie diese kennen) und Ihren individuellen Übersetzungstext eingeben und auf **Übermitteln** klicken.
sr: У дијалогу можете директно унети тачан изворни превод (ако га знате) и ваш прилагођени текст превода за њега а потом кликните на **Пошаљи**.

source: Alternatively, try to search for translation suggestions in the list below. Selecting an item from the list will pre-fill the translation source for you and then you can just enter your custom translation.
de: Alternativ können Sie auch in der Liste unten nach Übersetzungsvorschlägen suchen. Wenn Sie ein Element aus der Liste auswählen, wird die Übersetzungsquelle für Sie vorausgefüllt und Sie können dann einfach Ihre eigene Übersetzung eingeben.
sr: Алтернативно, покушајте да претражујете листу предлога за превод испод. Одабир ставке са листе ће попунити изворни превод за вас и онда можете унети само ваш прилагођени превод.
