Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: Zammad creates a user for everyone who communicates with the system. That means even customers get their own accounts, even if they don't use it to log in to Zammad.
de: Zammad legt für jeden, der mit dem System kommuniziert, einen Benutzer an. Das bedeutet, dass sogar Kunden ihre eigenen Konten bekommen, auch wenn sie sich damit nicht bei Zammad einloggen.
sr: Zammad додаје корисника за свакога ко комуницира са системом. То значи да чак и клијенти добијају сопствене налоге, чал иако их не користе да се пријаве у Zammad.

source: The simplest way to manage users is directly in the Admin Panel.
de: Der einfachste Weg, Benutzer zu verwalten, ist direkt im Admin-Panel.
sr: Најједноставнији начин управљања корисницима је директно у панелу администратора.

source: Learn more about managing users...
de: Erfahren Sie mehr über die Verwaltung von Benutzern...
sr: Сазнајте више о управљању корисницима...

source: :doc:`via the Admin Panel <via-the-admin-panel>`
de: :doc:`über das Admin-Panel <via-the-admin-panel>`
sr: :doc:`преко панела администратора <via-the-admin-panel>`

source: :doc:`via CSV import <via-csv-import>`
de: :doc: "über einen CSV-Import <via-csv-import>
sr: :doc:`преко CSV увоза <via-csv-import>`

source: :doc:`via LDAP/Active Directory integration </system/integrations/ldap/index>`
de: :doc:`über LDAP/Active Directory Integration </system/integrations/ldap/index>`
sr: :doc:`преко LDAP/Active Directory интеграције </system/integrations/ldap/index>`

source: :doc:`via Exchange integration </system/integrations/exchange>`
de: :doc:`über die Exchange-Integration </system/integrations/exchange>`
sr: :doc:`преко Exchange интеграције </system/integrations/exchange>`

source: :docs:`via REST API </api/intro.html>`
de: :docs:`über die REST API </api/intro.html>`
sr: :docs:`преко REST API-ја </api/intro.html>`

source: :ref:`via invitation email <invite-agents>`
de: ref:`<Einladung per E-Mail <invite-agents>`
sr: :ref:`путем имејл позивнице <invite-agents>`

source: Reference Guide: User Details
de: Anleitung: Benutzerdetails
sr: Референтни водич: Кориснички детаљи

source: Most of the attributes you can set on user accounts are self-explanatory. The ones that aren't are described below.
de: Die meisten Attribute, die Sie für Benutzer festlegen können, sind selbsterklärend. Diejenigen, bei denen dies nicht der Fall ist, werden unten beschrieben.
sr: Већина атрибута које можете подесити на корисничким налозима је разумљива сама по себи. Они који нису описани су у наставку.

source: The edit user dialog, showing the various user detail fields
de: Der Dialog "Benutzer bearbeiten", der die verschiedenen Felder für Benutzerdetails anzeigt
sr: Дијалог за уређивање корисника, који приказује различита поља са детаљима о кориснику

source: User details can be set in the **New/Edit User** dialog.
de: Details können im Dialogfeld **Neu/Bearbeiten Benutzer** festgelegt werden.
sr: Детаљи о кориснику се могу подесити у дијалогу **Ново/Измена: Корисник**.

source: 🕵️ **Admins aren't the only ones who can change these settings.**
de: 🕵️ **Administratoren sind nicht die einzigen, die diese Einstellungen ändern können.**
sr: 🕵 **Администратори нису једини који могу да промене ова подешавања.**

source: In most cases, agents can, too (using the :user-docs:`new ticket dialog </basics/service-ticket/create.html>`, :user-docs:`search bar </basics/find-ticket/search.html>` or the :user-docs:`ticket pane </extras/customers.html>`).
de: In den meisten Fällen können das auch die Agenten (mit Hilfe des Dialogs :user-docs:`Neues Ticket </basics/service-ticket/create.html>`, der :user-docs:`Suchleiste </basics/find-ticket/search.html>` oder der :user-docs:`Ticketansicht </extras/customers.html>`).
sr: У већини случајева могу и оператери (користећи :user-docs:`дијалог новог тикета </basics/service-ticket/create.html>`, :user-docs:`поље за претрагу </basics/find-ticket/search.html>` или :user-docs:`панел тикета </extras/customers.html>`).

source: 👤 Login
de: 👤 Anmeldung
sr: 👤 Пријава

source: A user's email and login may differ, but **either one can be used to sign in.**
de: Die E-Mail-Adresse und der Login-Name eines Benutzers können unterschiedlich sein, aber **beide können zur Anmeldung verwendet werden.**
sr: Корисничка имејл адреса и пријава могу да се разликују, али **било који од њих може да се користи за пријављивање.**

source: Screenshot shows the user overview with highlighted "Login" column
de: Screenshot zeigt Benutzerübersicht mit hervorgehobener "Login" Spalte
sr: Снимак екрана који приказује кориснички преглед са наглашеном колоним „Пријава”

source: User logins are **not** shown in the New/Edit User dialog, but they are visible from the user overview.
de: Logins werden **nicht** im Dialogfeld "Neu/Bearbeiten Benutzer" angezeigt, aber sie sind in der Benutzerübersicht sichtbar.
sr: Корисничке пријаве **нису** приказане у дијалогу Ново/Измена: Корисник, али су видљиве из прегледа корисника.

source: This attribute **cannot** be set via the Admin Panel. Instead, use the :docs:`Zammad console </admin/console.html>`, the :docs:`REST API </api/intro.html>`, or :doc:`CSV import <via-csv-import>`.
de: Dieses Attribut **kann nicht** über das Admin Panel gesetzt werden. Verwenden Sie stattdessen die :docs:`Zammad Konsole </admin/console.html>`, die :docs:`REST API </api/intro.html>`, oder den :doc:`CSV Import <via-csv-import>`.
sr: Овај атрибут **не може** да се подеси преко панела администратора. Уместо тога, користите :docs:`Zammad конзолу </admin/console.html>`, :docs:`REST API </api/intro.html>`, или :doc:`CSV увоз <via-csv-import>`.

source: 🔑 Password
de: 🔑 Passwort
sr: 🔑 Лозинка

source: Yes, administrators really do have the power to change other users' passwords.
de: Ja, Administratoren haben tatsächlich die Möglichkeit, die Kennwörter anderer Benutzer zu ändern.
sr: Да, администратори заиста имају моћ да мењају лозинке других корисника.

source: (Agents do not, though.)
de: (Die Agenten allerdings nicht.)
sr: (Оператери, међутим, немају.)

source: 🏢 Organization
de: 🏢 Organisation
sr: 🏢 Организација

source: :doc:`/manage/organizations/index` are a way to group customers together (usually, members of the same company). This allows you to do things like view all tickets for that company or set up special :doc:`/manage/trigger` that fire only for those customers.
de: Mit :doc:`/manage/organizations/index` können Sie Kunden gruppieren (in der Regel Mitglieder desselben Unternehmens). Damit können Sie z.B. alle Tickets für dieses Unternehmen anzeigen oder spezielle :doc:`/manage/trigger` einrichten, die nur für diese Kunden ausgelöst werden.
sr: :doc:`/manage/organizations/index` су начин за груписање клијената (обично, чланова исте фирме). Ово вам омогућава да урадите ствари као што су да видите све тикете те фирме или да подесите посебне :doc:`окидаче </manage/trigger>` који се активирају само за те клијенте.

source: Please note that the organization has to exist before it can be assigned. To add one, go to **Manage > Organizations** in the Admin Panel.
de: Bitte beachten Sie, dass die Organisation erst existieren muss, bevor sie zugewiesen werden kann. Um eine Organisation hinzuzufügen, gehen Sie zu **Verwalten > Organisationen** in den Admin-Einstellungen.
sr: Обратите пажњу да организација мора да постоји пре него што може да буде додељена. Да бисте је додали, идите на **Управљање > Организације** у панелу администратора.

source: 🏤 Secondary Organizations
de: 🏤 Sekundäre Organisationen
sr: 🏤 Додатне организације

source: This option allows you to assign more organizations, in addition to the user's primary organization.
de: Mit dieser Option können Sie neben einer Hauptorganisation des Benutzers noch weitere Organisationen zuweisen.
sr: Ова опција вам омогућава да доделите више организација, поред примарне организације корисника.

source: Secondary organizations behave the same like the primary ones with one exception: Secondaries are not as highlighted like their primaries.
de: Die sekundären Organisationen verhalten sich genauso wie die primären mit der Ausnahme, dass die Sekundärorganisation nicht so hervorgehoben wird wie die Primärorganisation.
sr: Додатне организације се понашају исто као и примарне са једним изузетком: додатне организације нису толико истакнуте као примарне.

source: Listings for all organizational tickets are not affected by this. Zammad will mix primary and secondary organization tickets together.
de: Auflistungen für alle Organisationstickets sind davon nicht betroffen. Zammad mischt Tickets mit gleicher Primär- oder Sekundärorganisation zusammen.
sr: Ово не утиче на листе за све организационе тикете. Zammad ће комбиновати тикете примарне и додатне организације.

source: While the number of secondary organizations is not limited directly, you may want to keep this to a reasonable number of organizations.
de: Obwohl die Anzahl der sekundären Organisationen nicht begrenzt ist, sollten Sie die Anzahl der Organisationen auf ein vernünftiges Maß beschränken.
sr: Иако број додатних организација није директно ограничен, можда бисте желели да ово задржите на разумном броју.

source: 30-40 organizations at maximum *should* be good enough.
de: Maximal 30-40 Organisationen *sollten ausreichend* sein.
sr: 30-40 организација *требало би* бити сасвим довољно.

source: This flag is a way for your team to indicate high-status customers. Just as with organizations, you can set up special :doc:`/manage/trigger`, :doc:`/manage/scheduler` jobs, :doc:`/manage/slas/index`, and :doc:`/manage/overviews` just for VIPs.
de: Mit dieser Kennzeichnung kann Ihr Team auf hochrangige Kunden hingewiesen werden. Genau wie bei Organisationen können Sie spezielle :doc:`/manage/trigger`, :doc:`/manage/scheduler`-Jobs, :doc:`/manage/slas/index` und :doc:`/manage/overviews` für VIPs einrichten.
sr: Овај атрибут је начин да ваш тим укаже на клијенте високог статуса. Као и код организација, можете подесити посебне :doc:`окидаче </manage/trigger>`, :doc:`планере </manage/scheduler>` jobs, :doc:`SLA </manage/slas/index>` и :doc:`прегледе </manage/overviews>` само за VIP особе.

source: Ticket view showing a VIP user's avatar with a crown on it
de: Ticketansicht, die den Avatar eines VIP-Benutzers mit einer Krone zeigt
sr: Приказ тикета који приказује аватар VIP корисника са круном на њему

source: VIPs are displayed with a crown above their avatars.
de: VIPs werden mit einer Krone über ihren Avataren angezeigt.
sr: VIP особе су приказане са круном изнад њихових аватара.

source: 😵 **Are you using the Note field to keep track of your own "custom" user attributes?**
de: 😵 **Nutzen Sie das Notizfeld, um Ihre eigenen "benutzerdefinierten" Benutzerattribute zu erfassen?**
sr: 😵 **Да ли користите поље напомене да бисте пратили сопствене „прилагођене“ корисничке атрибуте?**

source: Wish you could add your own fields to the New/Edit User dialog?
de: Möchten Sie Ihre eigenen Felder zum Dialogfeld "Neu/Bearbeiten Benutzer" hinzufügen?
sr: Желите да додате сопствена поља у дијалог Ново/Измена: Корисник?

source: Inactive users aren't able to login anymore. However, they can still be used in different places in Zammad (e.g. as ticket customer, in conditions in triggers and schedulers).
de: Inaktive Benutzer können sich nicht mehr einloggen. Sie können aber weiterhin an verschiedenen Stellen in Zammad verwendet werden (z.B. als Kunden in Tickets, in Bedingungen in Triggern und Automatisierungen).
sr: Искључени корисници нису у могућности да се даље пријављују. Међутим, и даље могу бити искоришћени на различитим местима у Zammad-у (нпр. као клијенти тикета, у условима окидача и планера).

source: What's the difference between deactivating and deleting a user?
de: Was ist der Unterschied zwischen dem Deaktivieren und dem Löschen eines Benutzers?
sr: Која је разлика између искључивања и брисања корисника?

source: There is no way to restore a deleted user; inactive users can be reactivated at any time.
de: Es gibt keine Möglichkeit, einen gelöschten Benutzer wiederherzustellen. Inaktive Benutzer können jederzeit reaktiviert werden.
sr: Не постоји начин да вратите избрисаног корисника; искључени корисници се могу поново укључити у било ком тренутку.

source: When a user is deleted, all their associated tickets are lost, as well; deactivating a user keeps all associated tickets intact.
de: Wenn ein Benutzer gelöscht wird, gehen auch alle zugehörigen Tickets verloren; bei der Deaktivierung eines Benutzers bleiben alle zugehörigen Tickets erhalten.
sr: Када се корисник избрише, губе се и сви повезани тикети; искључивање корисника задржава све повезане тикете нетакнуте.

source: Inactive users still appear in search results and can be used as a ticket customer:
de: Inaktive Benutzer erscheinen weiterhin in den Suchergebnissen und können als Kunden in Tickets verwendet werden:
sr: Искључени корисници се и даље појављују у резултатима претраге и могу се користити као клијенти тикета:

source: An inactive user displayed in a customer search list
de: Ein inaktiver Benutzer wird in einer Suche nach Kunden angezeigt
sr: Искључен корисник приказан на листи резулата претраге клијената

source: A slashed-out 👤 icon indicates an inactive user. In other cases, inactive users are grayed out.
de: Ein durchgestrichenes 👤-Symbol weist auf einen inaktiven Benutzer hin. In anderen Fällen sind inaktive Benutzer ausgegraut.
sr: Пресечена иконица 👤 означава искљученог корисника. У другим случајевима, искључени корисници су засивљени.

source: The :doc:`/manage/roles/index` define what users can do in the system. If you need to grant someone privileges to edit the knowledge base or access part of the admin panel, roles are the answer.
de: :doc:`/manage/roles/index` legen fest, was Benutzer im System tun können. Wenn Sie jemandem das Recht einräumen wollen, die Knowledge Base zu bearbeiten oder auf einen Teil des Admin-Bereichs zuzugreifen, sind Rollen die Lösung.
sr: :doc:`/manage/roles/index` одређују шта корисници могу да раде у систему. Ако желите да некоме дате дозволе за уређивање базе знача или за приступ панелу администратора, улоге вам могу помоћи у томе.

source: The :doc:`/manage/groups/access-levels` define which tickets an agent can work with. If an agent is not receiving notifications for incoming tickets or can't be assigned to a ticket, you should have a look on the group permissions. Please note that the visibility of the group permission table depends on the role selection. It only shows up, if the selected role has the ``ticket.agent`` permission and when there is more than one active group in the system.
de: :doc:`/manage/groups/access-levels` bestimmen, mit welchen Tickets ein Agent arbeiten darf. Wenn jemand keine Benachrichtigungen für eingehende Tickets bekommt oder ihm kein Ticket zugewiesen werden kann, sind wahrscheinlich die Gruppen-Berechtigungen dafür verantwortlich. Bitte beachten Sie, dass die Sichtbarkeit der Gruppenberechtigungstabelle von der ausgewählten Rollen abhängt. Sie wird nur angezeigt, wenn die gewählte Rolle die Berechtigung ``ticket.agent`` hat und wenn es mehr als eine aktive Gruppe im System gibt.
sr: :doc:`/manage/groups/access-levels` одређују са којим тикетима оператери могу радити. Ако оператер не добија обавештење за долазне тиекте или не може бити додељен тиекту, проверите групне дозволе. Обратите пажњу да видљивост табеле групних дозвола зависи од избора улоге. Појавиће се само ако одабрана улога садржи дозволу ``ticket.agent``. и када постоји више од једне укључене групе у систему.

source: Permissions in the edit user dialog
de: Berechtigungen im Dialog "Bearbeiten: Benutzer"
sr: Дозволе у дијалогу за уређивање корисника

source: **Top:** User's roles decide what kind of actions they can perform and which :doc:`groups </manage/groups/index>` they belong to. **Bottom:** Group assignments can alternately be set on a per-user basis.
de: **Oben:** Die Rollen eines Benutzers entscheiden, welche Arten von Aktionen er durchführen kann und zu welchen :doc:`Gruppen </manage/groups/index>` er gehört. **Unten:** Die Gruppenzuordnung kann alternativ auch pro Benutzer festgelegt werden.
sr: **При врху:** Улоге корисника одлучују које врсте радњи могу да обављају и којим :doc:`групама </manage/groups/index>` припадају. **При дну:** Групне доделе се могу алтернативно подесити по кориснику.

source: Managing Users via CSV Import
de: Benutzerverwaltung über einen CSV-Import
sr: Управљање корисницима преко CSV увоза

source: For persistent, automated user synchronization, consider integration with a third-party directory system like :doc:`LDAP / Active Directory </system/integrations/ldap/index>` or :doc:`Exchange </system/integrations/exchange>`.
de: Für eine dauerhafte, automatische Synchronisierung von Benutzern sollten Sie die Anbindung an ein Verzeichnissystem eines Drittanbieters wie :doc:`LDAP / Active Directory </system/integrations/ldap/index>` oder :doc:`Exchange </system/integrations/exchange>` in Betracht ziehen.
sr: За сталну, аутоматизовану синхронизацију корисника, размислите о интеграцији са системом директоријума трећег лица као што је :doc:`LDAP / Active Directory </system/integrations/ldap/index>` или :doc:`Exchange </system/integrations/exchange>`.

source: Step 1: Inspect the Sample .csv
de: Schritt 1: Überprüfen Sie die Beispiel-CSV-Datei
sr: Корак 1: Прегледајте узорак .csv датотеке

source: Use the link at the bottom of the CSV import dialog (**“Example CSV file for download”**) to see how Zammad expects you to format your user data.
de: Verwenden Sie den Link unten im CSV-Importdialog (**"Beispiel-CSV-Datei zum Download“**), um zu sehen, in welchem Format Zammad die Daten für den Import erwartet.
sr: Користите везу при дну дијалога за увоз CSV-а (**„Пример ЦСВ датотеке за преузимање“**) да бисте видели како Zammad очекује да форматирате своје корисничке податке.

source: Step 2: Export Your User Data to .csv
de: Schritt 2: Exportieren Sie Ihre Benutzerdaten als .csv
sr: Корак 2: Извезите своје корисничке податке у .csv

source: the ``firstname`` and ``lastname`` attributes are **required**; and
de: die Attribute ``firstname`` (Vorname) und ``lastname`` (Nachname) sind **erforderlich**; und
sr: атрибути ``firstname`` и ``lastname`` су **обавезни**; и

source: If you have more than one value for a field, separate them with ``~~~`` as above.
de: Wenn Sie mehr als einen Wert für ein Feld haben, trennen Sie sie mit ``~~~`` wie oben angegeben.
sr: Уколико имате више од једне вредности за исто поље, одвојите их са ``~~~`` као на примеру изнад.

source: Once your raw user data has been submitted, Zammad will perform a test run to compute the number of affected records:
de: Sobald die Daten übermittelt wurden, führt Zammad einen Testlauf durch, um die Anzahl der betroffenen Datensätze zu berechnen:
sr: Када су ваши необрађени кориснички подаци послати, Zammad ће извршити пробни увоз да би израчунао број записа на које утиче:

source: Records are updated when the imported data contains an ``email`` or ``login`` that matches an existing user account.
de: Bestehende Daten werden aktualisiert, wenn die importierten Daten in den Feldern ``E-Mail`` oder ``Login`` Werte enthalten, die mit einem bestehenden Benutzerkonto übereinstimmen.
sr: Записи се ажурирају када увезени подаци садрже ``email`` или ``login`` који се подудара са постојећим корисничким налогом.

source: Click **Yes, start real import** to proceed. (If you're importing a lot of records, be patient - it may take a minute.)
de: Klicken Sie auf **Ja, den echten Import starten**, um fortzufahren. (Wenn Sie viele Datensätze importieren, haben Sie etwas Geduld - es kann durchaus eine Minute dauern.)
sr: Кликните на **Да, започни прави увоз** да бисте наставили. (Ако увозите много записа, будите стрпљиви – може потрајати који минут.)

source: Managing Users via the Admin Panel
de: Verwaltung von Benutzern über das Admin-Panel
sr: Управљање корисницима преко панела администратора

source: The “Users” panel provides tools to manually manage user accounts. See :ref:`user-details-reference` for help with the New/Edit User dialog.
de: Der Bereich "Benutzer" bietet Werkzeuge zur manuellen Verwaltung von Benutzerkonten. Siehe :ref:`user-details-reference` für Hilfe zum Dialog "Neu/Bearbeiten Benutzer".
sr: Панел „Корисници” пружа алатке за ручно уређивање корисничких налога. Погледајте :ref:`user-details-reference` за помоћ са дијалогом Ново/Измене: Корисник.

source: 👥 Creating and editing users
de: 👥 Benutzer erstellen und bearbeiten
sr: 👥 Додавање и уређивање корисника

source: Screenshot shows the user management overview.
de: Screenshot zeigt Übersicht der Benutzerverwaltung.
sr: Снимак екрана који приказује преглед управљања корисницима.

source: Click the **New User** button to open the New User dialog, or click on an existing user to edit.
de: Klicken Sie auf die Schaltfläche **Neuer Benutzer**, um das Dialogfeld "Neu: Benutzer" zu öffnen, oder klicken Sie auf einen vorhandenen Benutzer, um ihn zu bearbeiten.
sr: Кликните на дугме **Нови корисник** да бисте отворили дијалог новог корисника или кликните на постојећег корисника да бисте га изменили.

source: 🗑️ Deleting users
de: 🗑️ Löschen von Benutzern
sr: 🗑 Брисање корисника

source: Screenshot shows user deletion via action menu.
de: Screenshot zeigt Löschung eines Benutzers über das Aktionsmenü.
sr: Снимак екрана који приказује брисање корисника преко падајућег менија радњи.

source: Use the ⋮ **Actions** menu to open the **Delete User** dialog.
de: Verwenden Sie das Menü ⋮ **Aktion**, um den **Benutzer löschen** Dialog zu öffnen.
sr: Користите мени ⋮ **Радње** да бисте отворили дијалог **Избриши корисника**.

source: 🔎 Filtering the user list
de: 🔎 Filterung der Benutzerliste
sr: 🔎 Филтрирање листе корисника

source: Screenshot shows selected role and search term in user management.
de: Screenshot zeigt die ausgewählte Rolle und den Suchbegriff in der Benutzerverwaltung.
sr: Снимак екрана који приказује одабрану улогу и термин за претрагу у екрану управљања корисницима.

source: Use the 🔎 **Search for users** bar and the **Roles** buttons to filter the list. You may search by name, email, or any other user attribute.
de: Verwenden Sie die 🔎 **Benutzer suchen** Leiste und die **Rollen**-Schaltflächen, um die Liste zu filtern. Sie können nach Name, E-Mail oder einem anderen Benutzerattribut suchen.
sr: Користите поље 🔎 **Претражи кориснике** и дугмиће **Улоге** да бисте филтрирали листу. Можете претраживати по имену, имејл адреси или било ком другом корисничком атрибуту.

source: 🔒 Unlock locked user accounts
de: 🔒 Gesperrte Benutzerkonten entsperren
sr: 🔒 Откључајте закључане корисничке налоге

source: Screenshot shows locked user indicator and context menu to unlock the account.
de: Screenshot zeigt den Indikator für einen gesperrten Benutzer und das Kontextmenü zum Entsperren des Kontos.
sr: Снимак екрана који приказује индикатор закључаног корисника и контекстни мени за откључавање налога.

source: Use the ⋮ **Actions** menu to unlock accounts after too many failed logins. Locked accounts are indicated with a 🔒 lock icon on the left side.
de: Verwenden Sie das Menü ⋮ **Aktionen**, um Konten nach zu vielen fehlgeschlagenen Anmeldeversuchen wieder zu entsperren. Gesperrte Konten werden mit einem 🔒 Schloss-Symbol auf der linken Seite angezeigt.
sr: Користите мени ⋮ **Радње** да бисте откључали налоге након превише неуспешних пријављивања. Закључани налози су означени 🔒 иконицом закључавања на левој страни.

source: 🏴‍☠️ Taking over a user's session
de: 🏴‍☠️ Übernahme einer Benutzersitzung
sr: 🏴‍☠ Преузимање сесије корисника
