Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: Screenshot showing the calculated escalation stages
de: Screenshot mit den berechneten Eskalationsstufen
sr: Снимак екрана који приказује израчунате фазе ескалације

source: SLA Example
de: SLA-Beispiel
sr: SLA пример

source: This page contains some possible example configurations for a SLA we could think of. SLAs in general are very flexible and powerful, below doesn't have to be your standard!
de: Diese Seite enthält einige mögliche Beispielkonfigurationen für SLAs, die unserer Meinung nach sinnvoll sein können. SLAs sind im Allgemeinen sehr flexibel und leistungsfähig, passen Sie die Beispiele gerne Ihren Bedürfnissen an!
sr: Ова страница садржи неке могуће примере SLA подешавања које смо могли да смислимо. SLA су генерално веома флексибилни и моћни, примери испод не морају да буду баш за вас!

source: If they don't make sense to you, don't worry - just skip ahead to :doc:`how-do-they-work` to learn about all the options in detail, then come back here to see them in action.
de: Wenn sie für Sie keinen Sinn ergeben, machen Sie sich keine Sorgen - springen Sie einfach zu :doc:`how-do-they-work`, um mehr im Detail zu erfahren, und kehren Sie dann hierher zurück, um sie in Aktion zu sehen.
sr: Ако вам немају смисла, не брините – само прескочите на :doc:`how-do-they-work` да бисте детаљно сазнали о свим опцијама, а затим се вратите овде да бисте их видели у акцији.

source: All following SLAs have the same base configurations. They may not use all of them in all samples.
de: Alle folgenden SLAs haben die gleiche Basiskonfiguration. Es mag Beispiele geben, in denen nicht alle davon verwendet werden.
sr: Сви следећи SLA имају исте основна подешавања. Могуће је да се не користе у свим примерима.

source: **Groups**
de: **Gruppen**
sr: **Групе**

source: **Attributes**
de: **Attribute**
sr: **Атрибути**

source: User / VIP (default, Boolean)
de: Kunde / VIP (ja/nein)
sr: Корисник / VIP (подразумевано, логички)

source: Organization / Support-Contract (Single selection field, ``None`` as default value)
de: Organisation / Supportvertrag (Einfachauswahl-Feld, ``Keine`` als Standardwert)
sr: Организација / Уговор подршке (поље једноструког избора, ``Ништа`` као подразумевана вредност)

source: **Calendar setting**
de: **Kalendereinstellungen**
sr: **Подешавање календара**

source: The calendar is set to 8 hours per day, from Monday to Friday.
de: Der Kalender ist auf 8 Stunden pro Tag eingestellt, von Montag bis Freitag.
sr: Календар је подешен на 8 сати дневно, од понедељка до петка.

source: **1. Support contract levels and VIP customers**
de: **1. Supportvertrag-Stufen und VIP-Kunden**
sr: **1. Подршка према нивоима уговора и VIP клијентима**

source: This approach uses a combination of contract levels (where any level except for none causes SLA escalations) and VIP customers that can have further priority.
de: Dieser Ansatz verwendet eine Kombination aus Vertragsstufen (wobei jede Stufe außer *keiner* zu SLA-Eskalationen führt) und VIP-Kunden, die eine höhere Priorität haben können.
sr: Овај приступ користи комбинацију нивоа уговора (где било који ниво осим ништа изазива SLA ескалације) и VIP клијената који могу имати даљи приоритет.

source: The configuration of these SLAs ensures that either fitting support contract levels trigger or the VIP state is being used. They're not overlapping.
de: Die Konfiguration dieser SLAs stellt sicher, dass entweder passende Supportvertragsstufen ausgelöst werden oder der VIP-Status verwendet wird. Sie sind nicht überlappend.
sr: Подешавање ових SLA осигурава да се или активирање нивоа уговора за подршку или да се користи VIP стање. Не преклапају се.

source: VIP customers
de: VIP-Kunden
sr: VIP клијенти

source: SLA configuration checking if the customer is a VIP customer.
de: SLA-Konfiguration prüft, ob der Kunde ein VIP-Kunde ist.
sr: SLA конфигурација проверава да ли је клијент VIP корисник.

source: Screenshot showing SLA configuration for VIP customers.
de: Screenshot der SLA-Konfiguration für VIP-Kunden.
sr: Снимак екрана који приказује SLA подешавања за VIP клијенте.

source: Support contract levels
de: Supportvertrag-Levels
sr: Подршка према нивоу уговора

source: The settings of each support contract level SLA basically are the same. The only setting that differs is the support contract level of each configuration and the SLA timings.
de: Die Einstellungen der einzelnen Supportvertragsstufen (SLA) sind grundsätzlich gleich. Die einzigen Einstellungen, die sich unterscheiden, sind die Supportvertragsstufe und die SLA-Zeiten.
sr: Подешавања сваког SLA према нивоу уговора о подршци су у основи иста. Једино подешавање које се разликује је ниво уговора о подршци и SLA времена.

source: For this reason we're showing the bronze level configuration as an example only.
de: Aus diesem Grund zeigen wir die Konfiguration der Stufe Bronze nur als Beispiel.
sr: Из тог разлога приказујемо подешавање бронзаног нивоа само као пример.

source: Screenshot showing SLA configuration for support contract level bronze.
de: Screenshot der SLA-Konfiguration für den Supportvertrag Stufe Bronze.
sr: Снимак екрана који приказује SLA подешавање за уговор о подршци бронзаног нивоа.

source: The result
de: Das Ergebnis
sr: Резултат

source: This approach causes the following SLA timings for each level:
de: Dieser Ansatz führt zu den folgenden SLA-Zeiten für jede Stufe:
sr: Овај приступ узрокује следећа SLA времена за сваки ниво:

source: If the customer has no VIP state and the organization has a support level
de: Wenn der Kunde keinen VIP-Status hat und die Organisation einen Support-Level hat
sr: Ако клијент нема VIP стање и организација има ниво подршке

source: First response time: ``6 hours``
de: Erste Reaktionszeit: ``6 Stunden``
sr: Време првог одзива: ``6 сати``

source: Update time (for an agent to respond): ``6 hours``
de: Aktualisierungszeit (bis ein Agent antwortet): ``6 Stunden``
sr: Време ажурирања (да оператер одговори): ``6 сати``

source: Solution time: ``40 hours``
de: Lösungszeit: ``40 Stunden``
sr: Време решења: ``40 сати``

source: Silver
de: Silber
sr: Сребрна

source: First response time: ``4 hours``
de: Erste Reaktionszeit: ``4 Stunden``
sr: Време првог одзива: ``4 сата``

source: Update time (for an agent to respond): ``4 hours``
de: Aktualisierungszeit (bis ein Agent antwortet): ``4 Stunden``
sr: Време ажурирања (да оператер одговори): ``4 сата``

source: Solution time: ``32 hours``
de: Lösungszeit: ``32 Stunden``
sr: Време решења: ``32 сата``

source: First response time: ``2 hour``
de: Erste Antwortzeit: ``2 Stunden``
sr: Време првог одзива: ``2 сата``

source: Update time (for an agent to respond): ``2 hour``
de: Aktualisierungszeit (für die Antwort eines Agenten): ``2 Stunden``
sr: Време ажурирања (да оператер одговори): ``2 сата``

source: Solution time: ``24 hours``
de: Lösungszeit: ``24 Stunden``
sr: Време решења: ``24 сата``

source: None
de: Keine
sr: Празно

source: This setting has no SLA configuration. Tickets will not escalate.
de: Diese Einstellung hat keine SLA-Konfiguration. Tickets werden nicht eskaliert.
sr: Ово подешавање нема SLA конфигурацију. Тикети неће ескалирати.

source: If the customer has the VIP state
de: Wenn der Kunde einen VIP-Status hat
sr: Ако клијент има VIP стање

source: First response time: ``1 hour``
de: Erste Antwortzeit: ``1 Stunde``
sr: Време првог одзива: ``1 сат``

source: Update time (for an agent to respond): ``1 hour``
de: Aktualisierungszeit (für die Antwort eines Agenten): ``1 Stunde``
sr: Време ажурирања (да оператер одговори): ``1 сат``

source: Solution time: ``16 hours``
de: Lösungszeit: ``16 Stunden``
sr: Време решења: ``16 сати``

source: **2. VIP customers**
de: **2. VIP-Kunden**
sr: **2. VIP клијенти**

source: non VIP customers
de: Nicht-VIP-Kunden
sr: клијенти који нису VIP

source: SLA configuration checking if the customer is not a VIP customer.
de: Überprüfung der SLA-Konfiguration, wenn der Kunde kein VIP-Kunde ist.
sr: SLA подешавање које проверава да ли клијент није VIP корисник.

source: Screenshot showing SLA configuration for non-VIP customers.
de: Screenshot der SLA-Konfiguration für Nicht-VIP-Kunden.
sr: Снимак екрана који приказује SLA подешавање за клијенте који нису VIP.

source: If the customer has no VIP state
de: Wenn der Kunde keinen VIP-Status hat
sr: Ако клијент нема VIP стање

source: First response time: ``8 hours``
de: Erste Reaktionszeit: ``8 Stunden``
sr: Време првог одзива: ``8 сати``

source: Update time (for an agent to respond): ``16 hours``
de: Aktualisierungszeit (für die Antwort eines Agenten): ``16 Stunden``
sr: Време ажурирања (да оператер одговори): ``16 сати``

source: With tags, tickets can be categorized and marked.
de: Mit Tags können Tickets kategorisiert und markiert werden.
sr: Уз употребу ознака, тикети се могу категорисати и маркирати.

source: How to Tag
de: Wie man Tags hinzufügt
sr: Како означити

source: All agents can tag tickets. You can find further information about tagging of tickets on our :user-docs:`user documentation </basics/service-ticket/settings/tags.html>`. If you don't want your agents to create new tags, disable the creation of new tags by setting the toggle to inactive.
de: Alle Agenten können Tickets mit Tags kennzeichnen. Weitere Informationen zum Taggen von Tickets finden Sie in unserer :user-docs:`Benutzer Dokumentation </basics/service-ticket/settings/tags.html>`. Wenn Sie nicht möchten, dass Ihre Agenten neue Tags erstellen, deaktivieren Sie die Erstellung neuer Tags, indem Sie den Schalter auf inaktiv setzen.
sr: Сви оператери могу означити тикете. Додатне информације о означавању тикета можете пронаћи у нашој :user-docs:`корисничкој документацији </basics/service-ticket/settings/tags.html>`. Уколико не желите да ваши оператери додају нове ознаке, искључите могућност додавања нових ознака постављањем прекидача на искључено.

source: Tag-Overviews
de: Tag-Übersichten
sr: Прегледи ознака

source: You can find tickets based on their tags in different ways:
de: Sie können Tickets anhand ihrer Tags auf verschiedene Weise finden:
sr: Тикете можете пронаћи по њиховим ознакама на различите начине:

source: By providing an appropriate overview
de: Durch die Bereitstellung einer geeigneten Übersicht
sr: Пружањем одговарајућег прегледа

source: Create a new overview and select "Tag contains ..." as condition. You can find further information in :doc:`overviews`.
de: Erstellen Sie eine neue Übersicht und wählen Sie als Bedingung "Tag enthält eins ...". Weitere Informationen finden Sie in :doc:`overviews`.
sr: Додајте нови преглед и изаберите „Ознака садржи ...” као услов. Више информација можете пронаћи у :doc:`overviews`.

source: By a search-query
de: Durch eine Suchabfrage
sr: Упитом за претрагу

source: Enter e.g.: ``tags:americano`` in the search and you will get all tickets that have been tagged accordingly.
de: Geben Sie z.B.: ``tags:americano`` in die Suche ein und Sie erhalten alle Tickets, die entsprechend getaggt wurden.
sr: Унесите нпр: ``tags:americano`` у форми за претрагу и добићете све тикете који су означени на тај начин.

source: By clicking on the tag in the tag management
de: Durch Klicken auf den Tag in der Tag-Verwaltung
sr: Кликом на ознаку у области управљања ознакама

source: In the tag management you can find an overview of existing tags used in the system (and a counter how often they are used):
de: In der Tag-Verwaltung finden Sie eine Übersicht über die im System verwendeten Tags (und einen Zähler, wie oft sie verwendet werden):
sr: У области управљања ознакама можете пронаћи преглед постојећих ознака које се користе у систему (и бројач колико се често користе):

source: For more information about the individual tags, just click on the blue counter. This creates a search for this tag. Select one of the tickets that appears below the search box or get a complete overview of all tickets by clicking on "Show Search Details"
de: Für weitere Informationen zu den einzelnen Tags klicken Sie einfach auf den blauen Zähler. Dadurch wird eine Suche nach diesem Tag erstellt. Wählen Sie eines der Tickets aus, die unterhalb des Suchfeldes erscheinen, oder verschaffen Sie sich eine vollständige Übersicht über alle Tickets, indem Sie auf "Suchdetails anzeigen" klicken
sr: За више информација о појединачним ознакама, само кликните на плави бројач. Тиме ћете покренути претрагу за ту ознаку. Изаберите један од тикета који се појављује испод поља за претрагу или погледајте комплетан преглед свих тикета кликом на „Прикажи детаље претраге”

source: Templates
de: Vorlagen
sr: Шаблони

source: Templates allow you to create tickets at a rapid speed by defining a ticket template for recurring tickets.
de: Mit Vorlagen können Sie schnell Tickets erstellen, indem Sie eine Ticketvorlage für wiederkehrende Tickets definieren.
sr: Шаблони вам омогућавају да отварате тикете великом брзином тако што одредите шаблон за тикете који се понављају.

source: Screenshot showing Zammad's (ticket) template management page
de: Screenshot Verwaltung von Zammads (Ticket-)Vorlagen
sr: Снимак екрана који приказује Zammad-ову страну за управљање шаблонима тикета

source: ⚠️ Limitation ahead
de: ⚠️ **Achtung Einschränkung**
sr: ⚠️ Постоје ограничења

source: Please note that ticket templates do not allow the use of variables.
de: Bitte beachten Sie, dass Ticketvorlagen keine Verwendung von Variablen zulassen.
sr: Имајте на уму да шаблони тикета не дозвољавају употребу променљивих.

source: Managing templates
de: Vorlagen verwalten
sr: Управљање шаблонима

source: Adding new template
de: Hinzufügen einer neuen Vorlage
sr: Додавање новог шаблона

source: Use the *New Template* button to start creating a new template.
de: Verwenden Sie die Schaltfläche *Neue Vorlage*, um eine neue Vorlage zu erstellen.
sr: Користите дугме *Нови шаблон* да бисте започели додавање новог шаблона.

source: Select a meaningful template name. This name will be shown to your agents during ticket creation (within *Select Template*).
de: Wählen Sie einen aussagekräftigen Vorlagennamen. Dieser Name wird Ihren Mitarbeitern bei der Ticketerstellung angezeigt (unter *Vorlage auswählen*).
sr: Изаберите смислени назив шаблона. Овај назив ће бити приказан вашим оператерима током отварања тикета (у оквиру *Изабери шаблон*).

source: Within actions, Zammad will provide all available ticket attributes. This allows you to create granular templates with the information you need.
de: In den Aktionen können alle verfügbaren Ticketattribute verwendet werden. So können Sie granulare Vorlagen mit den von Ihnen benötigten Informationen erstellen.
sr: У оквиру акција, Zammad ће обезбедити све доступне атрибуте тикета. Ово вам омогућава да дефинишете грануларне шаблоне са информацијама које су вам потребне.

source: Set any currently active ticket template to ``inactive`` if you don't need it momentarily. This allows you to keep the template for e.g. seasonal reasons without providing it as an option to your agents.
de: Setzen Sie eine derzeit aktive Ticketvorlage auf ``nicht aktiv``, wenn Sie sie im Moment nicht benötigen. So können Sie z.B. eine saisonale Vorlage behalten, ohne dass Ihre Mitarbeiter sie verwenden können.
sr: Поставите било који тренутно активни шаблон тикета на ``искључено`` ако вам није тренутно потребан. Ово вам омогућава да задржите шаблон из нпр. сезонских разлога, а да то не пружите као опцију вашим оператерима.

source: Screenshot showing the template configuration
de: Screenshot Vorlagenkonfiguration
sr: Снимак екрана који приказује подешавање шаблона

source: Editing templates
de: Bearbeiten von Vorlagen
sr: Уређивање шаблона

source: If your template no longer fits your need or contains errors, simply click on the template name to edit it.
de: Wenn Ihre Vorlage nicht mehr Ihren Anforderungen entspricht oder falsch ist, klicken Sie einfach auf den Namen der Vorlage, um sie zu bearbeiten.
sr: Ако ваш шаблон више не одговара вашим потребама или садржи грешке, једноставно кликните на назив шаблона да бисте га уредили.

source: Cloning templates
de: Klonen von Vorlagen
sr: Клонирање шаблона

source: Zammad allows you to clone existing templates and continue your new template from there.
de: Zammad ermöglicht es Ihnen, bestehende Vorlagen zu klonen und Ihre neue Vorlage von dort aus weiter zu bearbeiten.
sr: Zammad вам омогућава да клонирате постојеће шаблоне и одатле наставите са новим шаблоном.

source: To do so, use ⋮ in the Action column of the desired template in your list and choose *Clone*. A new template modal will open with attributes prefilled.
de: Verwenden Sie dazu ⋮ in der Spalte Aktion der gewünschten Vorlage in Ihrer Liste und wählen Sie *Klonen*. Es öffnet sich ein neue Vorlagen-Dialog mit vorausgefüllten Werten.
sr: Да бисте то урадили, користите падајући мени ⋮ у колони Акције поред жељеног шаблона у вашој листи и изаберите *Клонирај*. Отвориће се дијалог новог шаблона са унапред попуњеним атрибутима.

source: Removing templates
de: Entfernen von Vorlagen
sr: Уклањање шаблона

source: If you no longer require a specific template, use ⋮ in the Action column in the list and choose *Delete*.
de: Wenn Sie eine bestimmte Vorlage nicht mehr benötigen, verwenden Sie ⋮ in der Spalte Aktion in der Liste und wählen Sie *Löschen*.
sr: Ако вам више није потребан одређени шаблон, користите падајући мени ⋮ у колони Акције и изаберите *Избриши*.

source: Be aware that the deletion is permanent.
de: Beachten Sie, dass die Löschung dauerhaft ist.
sr: Будите свесни да је брисање трајно.

source: Text Modules
de: Textbausteine
sr: Текстуални исечци

source: Text modules can be edited in the admin interface under *Manage > Text modules*. Here you find text snippets which are already shipped by Zammad, which can be extended as needed.
de: Textbausteine können in der Verwaltungsoberfläche unter *Verwalten > Textbausteine* bearbeitet werden. Hier finden Sie Textbausteine, die bereits von Zammad ausgeliefert werden und die Sie nach Bedarf erweitern können.
sr: Текстуални исечци се могу уређивати у интерфејсу администратора под *Управљање > Текстуални исечци*. Овде можете пронаћи исечке који долазе у стандардном издању Zammad-a, а који се по потреби могу проширити.

source: Beside text modules Zammad also allows you to use :user-docs:`Ticket Templates for ticket creation </advanced/ticket-templates.html>`.
de: Neben Textbausteinen können Sie in Zammad auch :user-docs:`Ticketvorlagen für die Erstellung von Tickets </advanced/ticket-templates.html>` verwenden.
sr: Поред текстуалних исечака, Zammad вам такође омогућава да користите :user-docs:`шаблоне тикета при отварању </advanced/ticket-templates.html>`.

source: Here you can add new text modules, delete or edit them.
de: Hier können Sie neue Textbausteine hinzufügen, sie löschen oder bearbeiten.
sr: Овде можете додати нове текстуалне исечке, избрисати их или уредити.

source: Creating keywords makes it easier to find the right text module.
de: Das Anlegen von Schlüsselwörtern erleichtert das Auffinden des richtigen Textbausteins.
sr: Одређивање кључних речи олакшава проналажење правог текстуалног исечка.

source: You can find text modules either by their name or keyword.
de: Sie können Textbausteine entweder nach ihrem Namen oder nach einem Stichwort suchen.
sr: Текстуалне исечке можете пронаћи или по називу или по кључној речи.

source: If needed, you can restrict text modules to specific groups. With this, you can easily keep text module lists short and dedicate specific texts to where they belong.
de: Bei Bedarf können Sie Textbausteine auf bestimmte Gruppen beschränken. Dadurch können Sie die Liste der Textvorschläge für die Benutzer kurz halten und steuern, wer welche Textbausteine verwenden kann.
sr: Ако је потребно, можете ограничити текстуалне исечке на одређене групе. Овим приступом лако можете држати листе текстуалних исечака кратким и ограничити одређене исечке на одговарајуће место.

source: You can adjust the group memberships for text modules at any time. This allows you to have the text module available globally (no groups selected) or one or several specific groups.
de: Sie können die zugewiesenen Gruppen in Textbausteinen jederzeit anpassen. So können Sie den Textbaustein global (keine Gruppen ausgewählt) oder einer oder mehrerer definierter Gruppen zur Verfügung stellen.
sr: У било ком тренутку можете да прилагодите чланство у групама за текстуалне исечке. Ово вам омогућава да текстуални исечак буде доступан глобално (није изабране групе) или једна или неколико одређених група.

source: Example: Restricting text modules to 2nd Level group only.
de: Beispiel: Einschränkung der Textbausteine auf die Gruppe "2nd Level".
sr: Пример: Ограничавање текстуалних исечака само на 2nd Level групу.

source: To select placeholders from a list, just enter ``::`` in the text block. The list can be searched with the arrow keys after inputting keywords or shortcuts. All text modules can be used in articles as well as in the chat.
de: Um Platzhalter aus einer Liste auszuwählen, geben Sie einfach ``::`` im Textbereich ein. Die Liste kann nach der Eingabe von Schlüsselwörtern oder Abkürzungen mit den Pfeiltasten durchsucht werden. Alle Textbausteine können sowohl in Artikeln als auch im Chat verwendet werden.
sr: Да бисте одабрали предефинисане вредности из листе, само унесите ``::`` у блоку текста. Листа се може претраживати помоћу тастера са стрелицама након уноса кључних речи или пречица. Сви текстуални исечци се могу користити у чланцима као и при ћаскању.

source: To use the text modules in a ticket, you can use ``::`` too! You can find more information on how to use text modules in our :user-docs:`user documentation </advanced/text-modules.html>`.
de: Um die Textbausteine in einem Ticket zu nutzen können Sie auch ``::`` verwenden! Weitere Informationen über die Verwendung von Textbausteinen finden Sie in unserer :user-docs:`Benutzerdokumentation </advanced/text-modules.html>`.
sr: За коришћење текстуалних исечака у тикету, можете користити и ``::``! Више информација о томе како да користите текстуалне исечке можете пронаћи у нашој :user-docs:`корисничкој документацији </advanced/text-modules.html>`.

source: The example text modules below use :doc:`/misc/variables` to dynamically insert information like the customer's or agent's names.
de: Die folgenden Beispiel-Textbausteine verwenden :doc:`/misc/variables`, um Informationen wie den Namen des Kunden oder des Agenten dynamisch einzufügen.
sr: Примери текстуалних исечака у наставку користе :doc:`променљиве </misc/variables>` за динамичко уметање информација као што су имена клијента или оператера.

source: **Examples of snippets are**::
de: **Beispiele dafür sind**::
sr: **Примери исечака су**::

source: Of course you can also use multi line snippets.
de: Natürlich können Sie auch mehrzeilige Textbausteine verwenden.
sr: Наравно, можете користити и вишелинијске исечке.

source: Delete or Clone Text Modules
de: Löschen oder Klonen von Textbausteinen
sr: Избришите или клонирајте текстуалне исечке

source: Often similar text modules have to be created or unnecessary ones deleted. For these cases you can click on the 3 points in the text module overview on the right side and select the corresponding action:
de: Oft müssen ähnliche Textbausteine erstellt oder überflüssige gelöscht werden. Für diese Fälle können Sie in der Textbausteinübersicht auf der rechten Seite die 3 Punkte anklicken und die entsprechende Aktion auswählen:
sr: Често се морају дефинисати слични текстуални исечци или брисати непотребни. За ове случајеве можете кликнути на 3 тачке у прегледу текстуалних исечака на десној страни екрана и изабрати одговарајућу радњу:
