Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: Having a lot of numbers that shouldn't be used for notifying Zammad? Within the Webhooks → URLs section of Sipgate you can select which *sources* Sipgate should notify Zammad about in- and outgoing calls.
de: Haben Sie Nummern, die nicht für die Benachrichtigung in Zammad verwendet werden sollen? Im Bereich Webhooks → URLs von Sipgate können Sie auswählen, welche *sources* Sipgate über ein- und ausgehende Anrufe an Zammad benachrichtigen soll.
sr: Имате много бројева које не би требало користити за обавештавање Zammad-а? У одељку Webhooks → URLs Sipgate-а можете да изаберете које *изворе* Sipgate треба да обавести Zammad о долазним и одлазним позивима.

source: Use either specific phone lines or use the option "Use for all phonelines and groups" to notify Zammad about all existing lines of your Sipgate account.
de: Verwenden Sie entweder bestimmte Telefonleitungen oder verwenden Sie die Option "Use for all phonelines and groups", um Zammad über alle vorhandenen Leitungen Ihres Sipgate-Kontos zu informieren.
sr: Користите или одређене телефонске линије или користите опцију „Use for all phonelines and groups“ да обавестите Zammad о свим постојећим линијама вашег Sipgate налога.

source: Screenshot showing a sample selection of phone numbers to use for the Sipgates webhooks API
de: Screenshot mit einer Beispielauswahl von Telefonnummern für die Sipgate Webhooks API
sr: Снимак екрана који приказује пример избора телефонских бројева за употребу за Sipgate API повратних позива

source: This section also allows you to enable a Debug log.
de: In diesem Abschnitt können Sie auch ein Debug-Protokoll aktivieren.
sr: Овај одељак вам такође омогућава да омогућите евиденцију уноса за отклањање грешака.

source: Screenshot showing an enabled Debug log option
de: Screenshot zeigt die aktivierte Debug-Funktion
sr: Снимак екрана који приказује омогућену опцију евиденције уноса за отклањање грешака

source: After enabling you can use the Debug log section to see all sent webhook calls to Zammad. You'll also can see the response.
de: Nach der Aktivierung können Sie den Abschnitt Debug-Log verwenden, um alle gesendeten Webhook-Aufrufe an Zammad zu sehen. Sie können auch die Antwort sehen.
sr: Након укључивања, можете користити одељак евиденције за отклањање грешака да бисте видели све позиве упућене Zammad повратном позиву. Такође ћете видети и све одговоре.

source: Screenshot showing sample log entries for Sipgates webhook calls to Zammad
de: Screenshot mit Beispielprotokolleinträgen für Sipgates Webhook-Aufrufe an Zammad
sr: Снимак екрана који приказује примере уноса евиденције за Sipgate повратне позиве Zammad-у

source: Step 4 (optional): Further configurations for Sipgate
de: Schritt 4 (optional): Weitere Konfigurationen für Sipgate
sr: Корак 4 (опционо): Даља подешавања за Sipgate

source: If needed, you can now configure Zammad's Sipgate integration in more detail. You can learn more about your options here: :ref:`Sipgate integration settings <sipgate_settings>`.
de: Bei Bedarf können Sie nun die Sipgate-Integration von Zammad detaillierter konfigurieren. Erfahren Sie hier mehr über Ihre Optionen: :ref:`Sipgate-Integrationseinstellungen <sipgate_settings>`.
sr: Ако је потребно, сада можете детаљније да подесите Zammad-ову Sipgate интеграцију. Можете сазнати више о опцијама у :ref:`подешавањима Sipgate интеграције <sipgate_settings>`.

source: You need an administrative Sipgate account for your organization.
de: Sie benötigen ein administratives Sipgate-Konto für Ihre Organisation.
sr: Потребан вам је администраторски Sipgate налог за вашу организацију.

source: Zammad requires a ``sipgate.io`` addon from the feature store (please note that API calls are not free with Sipgate. Rates may apply and differ from account to account).
de: Zammad erfordert ein ``sipgate.io`` Addon aus dem Feature Store (bitte beachten Sie, dass API-Aufrufe mit Sipgate nicht kostenlos sind. Es können Gebühren anfallen, die sich von Konto zu Konto unterscheiden).
sr: Zammad захтева ``sipgate.io`` додатак са маркета апликација. (Имајте на уму да API позиви нису бесплатни. Цене могу да се разликују од налога до налога.)

source: Sipgate must be able to reach your Zammad instance.
de: Sipgate muss in der Lage sein Ihre Zammad-Instanz zu erreichen.
sr: Sipgate мора бити у могућности да приступи вашој Zammad инстанци.

source: Learn how to configure Sipgate to enable Zammad and Sipgate to communicate with each other.
de: Erfahren Sie, wie Sie Sipgate konfigurieren, damit Zammad und Sipgate miteinander kommunizieren können.
sr: Научите како да подесите Sipgate да бисте омогућили Zammad-у и Sipgate-у да међусобно комуницирају.

source: Below endpoint settings affect the :doc:`sipgate.io configuration <provider-configurations/sipgate>`.
de: Die folgenden Endpunkteinstellungen betreffen die :doc:`sipgate.io-Konfiguration <provider-configurations/sipgate>`.
sr: Подешавања путање испод утичу на :doc:`sipgate.io подешавања <provider-configurations/sipgate>`.

source: This endpoint is required for incoming call hooks.
de: Dieser Endpunkt ist für eingehende Anrufe erforderlich.
sr: Ова путања је потребна за регистрацију долазних позиве.

source: This endpoint is required for outgoing call hooks.
de: Dieser Endpunkt ist für ausgehende Anrufe erforderlich.
sr: Ова путања је потребна за регистрацију одлазних позива.

source: Screenshot showing sample user mappings in between Sipgate and Zammad
de: Screenshot mit Beispielen für Benutzerzuordnungen zwischen Sipgate und Zammad
sr: Снимак екрана који приказује примере мапирања корисника између Sipgate-а и Zammad-а

source: You can find your agent's Sipgate username within ``Accountverwaltung → Benutzer``. You're looking for the SIP-ID.
de: Den Sipgate-Benutzernamen Ihres Agenten finden Sie unter ``Accountverwaltung → Benutzer``. Suchen Sie nach der SIP-ID.
sr: Sipgate корисничко име вашег оператера можете пронаћи у оквиру ``Accountverwaltung → Benutzer``. Тражите SIP-ID.

source: Sample VoIP credentials for a Sipgate user
de: Beispiel für VoIP-Anmeldeinformationen für einen Sipgate-Benutzer
sr: Пример VoIP креденцијала за Sipgate корисника

source: Users with several devices also have several SIP-IDs.
de: Benutzer mit mehreren Geräten haben auch mehrere SIP-IDs.
sr: Корисници са више уређаја такође имају неколико SIP-ID-ова.

source: The Elasticsearch integration allows you to create a read-only user to use with your favorite reporting tool (e.g. like Grafana).
de: Die Elasticsearch-Integration ermöglicht es Ihnen, einen schreibgeschützten Benutzer zu erstellen, den Sie mit Ihrem bevorzugten Reporting-Tool (z.B. Grafana) verwenden können.
sr: Elasticsearch интеграција вам омогућава да додате корисника само за читање кога ћете користити са вашим омиљеним алатом за извештавање (нпр. као што је Grafana).

source: If you want to take full advantage of the Zammad reporting, have a look at our :docs:`Grafana </appendix/reporting-tools-thirdparty/grafana.html>` setup page as well.
de: Wenn Sie die Vorteile des Reportings mit Zammad voll ausschöpfen wollen, sollten Sie auch einen Blick auf unsere Seite zur :docs:`Grafana-Einrichtung </appendix/reporting-tools-thirdparty/grafana.html>` werfen.
sr: Ако желите да у потпуности искористите Zammad извештавање, погледајте и нашу страницу за подешавање :docs:`Grafana-е </appendix/reporting-tools-thirdparty/grafana.html>`.

source: **🚧 Hosted environment specific 🚧**
de: **🚧 Spezifisch für die gehostete Umgebung 🚧**
sr: **🚧 Oкружење специфичхо за хостоване иснтанце 🚧**

source: This integration is only available for Hosted setups. In order to use Elasticsearch you'll need the **Plus** subscription.
de: Diese Integration steht nur in gehosteten Umgebungen zur Verfügung. Um Elasticsearch nutzen zu können, benötigen Sie ein **Plus** Abonnement.
sr: Ова интеграција је доступна само за хостоване системе. Да бисте користили Elasticsearch, биће вам потребна **Plus** претплата.

source: Self hosted users have all the control over their self hosted Elasticsearch instances.
de: Selbstgehostete Nutzer haben die gesamte Kontrolle über ihre selbst gehosteten Elasticsearch-Instanzen.
sr: Корисници који сами хостују имају сву контролу над својим Elasticsearch инстанцама које сами хостују.

source: Elasticsearch integration page on SaaS environments
de: Seite Elasticsearch-Integrations für SaaS-Umgebungen
sr: Страница за Elasticsearch интеграцију у SaaS окружењима

source: Please note the following limitations of Elasticsearch access on hosted environments:
de: Bitte beachten Sie die folgenden Limitierungen für den Elasticsearch-Zugriff auf gehosteten Umgebungen:
sr: Имајте на уму следећа ограничења приступа Elasticsearch у хостованим окружењима:

source: access to the Elasticsearch index is read-only access
de: der Zugriff auf Elasticsearch-Indexe ist ein lesender Zugriff
sr: приступ Elasticsearch индексу је омогућен само за читање

source: currently you're limited to user only
de: Sie sind zur Zeit auf einen Benutzer beschränkt
sr: тренутно сте ограничени само на кориснике

source: Reporting tools that require to write into the indexes (like Kibana) are not supported
de: Reporting-Tools die Schreibzugriff auf Indexen benötigen (wie Kibana) werden nicht unterstützt
sr: Алати за извештавање који захтевају писање у индексе (као што је Kibana) нису подржани

source: IP access restriction is currently not yet supported
de: IP-Zugriffsbeschränkung wird zur Zeit noch nicht unterstützt
sr: Ограничење приступа на основу IP адресе још увек није подржано

source: Activating Elasticsearch Access
de: Aktivieren des Elasticsearch-Zugangs
sr: Укључивање Elasticsearch приступа

source: By default external access to your Elasticsearch index is not active. You can enable the integration at any time if needed.
de: Standardmäßig ist der externe Zugriff auf Ihren Elasticsearch-Index nicht aktiv. Sie können die Integration bei Bedarf jederzeit aktivieren.
sr: Подразумевано, спољни приступ вашем Elasticsearch индексу није омогућен. Можете укључити интеграцију у било ком тренутку ако је потребно.

source: Please ensure to note down the password provided - you won't have access to it afterwards.
de: Bitte notieren Sie sich das angegebene Passwort, da Sie später keinen Zugriff mehr darauf haben.
sr: Обавезно забележите достављену лозинку - касније јој нећете имати приступ.

source: Screencast showing activation of Elasticsearch integration
de: Screencast zeigt Aktivierung der Elasticsearch-Integration
sr: Снимак екрана који приказује укључивање Elasticsearch интеграције

source: Connection Settings
de: Verbindungs-Einstellungen
sr: Подешавања везе

source: This section holds the most important general information for accessing your Elasticsearch indexes - such as:
de: Dieser Abschnitt enthält die wichtigsten allgemeinen Informationen für den Zugriff auf Ihre Elasticsearch-Indizes - wie zum Beispiel:
sr: Овај одељак садржи најважније опште информације за приступ вашим Elasticsearch индексима – као што су:

source: A unique subdomain that does not tell your real instance URL.
de: Eine eindeutige Subdomain, die Ihre echte Instanz-URL nicht verrät.
sr: Јединствени поддомен који не садржи URL адресу ваше праве инстанце.

source: The major version of the search index being used. This is required by some Reporting tools like Grafana.
de: Die Hauptversion des verwendeten Suchindexes. Dies wird von einigen Reporting-Tools wie Grafana benötigt.
sr: Major верзија индекса претраге која се користи. Ово захтевају неки алати за извештавање као што је Grafana.

source: Authentication
de: Authentifizierung
sr: Аутентификација

source: The authentication type being supported. ``Basic Authentication``
de: Der unterstützte Authentifizierungstyp. ``Basic Authentication``
sr: Тип аутентификације који је подржан. ``Basic Authentication``

source: Available Indexes
de: Verfügbare Indexe
sr: Доступни индекси

source: Within this section we're displaying the -in our opinion- most important indexes for a Zammad instance.
de: In diesem Abschnitt zeigen wir die - unserer Meinung nach - wichtigsten Indizes für eine Zammad-Instanz an.
sr: У оквиру овог одељка приказујемо - по нашем мишљењу - најважније индексе за Zammad инстанцу.

source: If you require all indexes or our listing is not good enough for you, point your browser to the URL we're providing and append ``/_aliases?pretty=true``. The result should look like this: ``https://<URL>.zammad.com/_aliases?pretty=true``.
de: Wenn Sie alle Indizes benötigen oder Ihnen unsere Auflistung nicht ausreicht, rufen Sie mit Ihrem Browser die von uns angegebene URL auf und fügen Sie ``/_aliases?pretty=true`` hinzu. Das Ergebnis sollte wie folgt aussehen: ``https://<URL>.zammad.com/_aliases?pretty=true``.
sr: Ако су вам потребни сви индекси или наш списак није довољно детаљан, усмерите свој претраживач на следећу URL адресу ``/_aliases?pretty=true``. Резултат би требало да изгледа овако: ``https://<URL>.zammad.com/_aliases?pretty=true``.

source: Your browser will automatically ask for your credentials - you'll then see something like this:
de: Ihr Browser fragt automatisch nach Ihren Zugangsdaten - Sie sehen dann etwas wie das hier:
sr: Ваш претраживач ће аутоматски затражити да се аутентификујете - тада ћете видети нешто овако:

source: Credentials
de: Zugangsdaten
sr: Креденцијали

source: Within this section Zammad displays your available users. The password is provided once (upon activation) and cannot be retrieved after that.
de: In diesem Abschnitt zeigt Zammad Ihre verfügbaren Benutzer an. Das Passwort wird einmalig vergeben (bei der Aktivierung) und kann danach nicht mehr abgerufen werden.
sr: У оквиру овог одељка Zammad приказује ваше доступне кориснике. Лозинка се даје једном (по активацији) и након тога се не може преузети.

source: If you need to change or reset your Elasticsearch user password, use the "Reset password" button in the credentials table. Doing so creates a brand new password for the account in question. This change is immediate, keep in mind that this may affect third party tools connected to your instance.
de: Wenn Sie das Passwort Ihres Elasticsearch-Benutzers ändern oder zurücksetzen müssen, verwenden Sie die Schaltfläche "Passwort zurücksetzen" in der Tabelle mit den Zugangsdaten. Auf diese Weise wird ein neues Passwort für das betreffende Konto erstellt. Diese Änderung wird sofort durchgeführt. Beachten Sie, dass dies Auswirkungen auf Tools von Drittanbietern haben kann, die mit Ihrer Instanz verbunden sind.
sr: Ако желите да промените или поништите вашу Elasticsearch корисничку лозинку, користите дугме „Reset password“ у табели са креденцијалима. Овиме ћете добити потпуно нову лозинку за дотични налог. Ова промена је тренутна, имајте на уму да то може да утиче на алате трећег лица повезане са вашом инстанцом.

source: With Zammad's Exchange integration, you can easily use existing address books without having to update more than one source.
de: Mit der Exchange-Integration von Zammad können Sie vorhandene Adressbücher verwenden, ohne mehr als eine Datenquelle aktualisieren zu müssen.
sr: Уз Zammad-ову Exchange интеграцију, можете лако да користите постојеће адресаре без потребе да ажурирате више од једног извора.

source: There are two ways you can connect to your Exchange service, depending on your setup:
de: Es gibt zwei Möglichkeiten, wie Sie eine Verbindung zu Ihrem Exchange-Dienst herstellen können, abhängig von Ihrer Umgebung::
sr: Постоје два начина на који можете да повежете ваш Exchange сервис, у зависности од ваше поставке:

source: Connect to a local Exchange server via :ref:`basic authentication <exchange-basic-auth>`
de: Verbindung zu einem lokalen Exchange-Server per :ref:`Basic Authentication <exchange-basic-auth>`
sr: Повезивање са локалним Exchange сервером путем :ref:`basic authentication <exchange-basic-auth>`

source: Connect to a M365 Exchange server by using :ref:`OAuth authentication <exchange-oauth>`
de: Verbindung zu einem M365 Exchange Server per :ref:`OAuth Authentication <exchange-oauth>`
sr: Повезивање са M365 Exchange сервером путем :ref:`OAuth аутентификације <exchange-oauth>`

source: You might not want to sync all addresses. The results may not be what you expect (because Exchange collects huge amounts of addresses).
de: Möglicherweise möchten Sie nicht alle Adressen synchronisieren. Die Ergebnisse sind möglicherweise nicht das, was Sie erwarten (da Exchange große Mengen an Adressen sammelt).
sr: Можда нећете желети да синхронизујете све адресе. Резултати можда неће бити оно што очекујете (зато што Exchange прикупља велике количине адреса).

source: You might want to sync a central address book of your company. By doing so, you can ensure that Zammad only gets the data you want.
de: Vielleicht möchten Sie ein zentrales Adressbuch Ihrer Firma synchronisieren. Auf diese Weise können Sie sicherstellen, dass Zammad nur die von Ihnen gewünschten Daten erhält.
sr: Можда ћете желети да синхронизујете централни адресар ваше фирме. Тиме ћете постићи да Zammad има приступ само подацима које желите.

source: It is not possible to sync the Global Address List (GAL) of your Exchange system with Zammad.
de: Es ist nicht möglich, die Globale Adressliste (GAL) Ihres Exchange-Systems mit Zammad zu synchronisieren.
sr: Није могућа синхронизација Global Address List (GAL) вашег Exchange система са Zammad-ом.

source: You can map any Exchange attribute to a Zammad user attribute (even :doc:`custom object attributes </../system/objects>`!).
de: Sie können jedes Exchange-Attribut einem Zammad-Benutzer-Attribut zuordnen (sogar :doc:`selbst definierte Objektattribute </../system/objects>`!).
sr: Можете мапирати било који Exchange атрибут на Zammad кориснички атрибут (чак и :doc:`прилагођене атрибуте објекта </../system/objects>`!).

source: **Exchange and LDAP:** The exchange sync can be overruled by Zammad's LDAP integration. If you have the same users in both sources, the LDAP version will always be Zammad's pick.
de: **Exchange und LDAP:** Die Exchange-Synchronisierung kann durch die LDAP-Integration von Zammad übersteuert werden. Wenn Sie die gleichen Benutzer in beiden Quellen haben, wird die LDAP-Version immer "gewinnen".
sr: **Exchange и LDAP:** Exchange синхронизација може бити поништена Zammad-овом LDAP интеграцијом. Ако имате исте кориснике у оба извора, LDAP верзија ће увек бити Zammad-ов избор.

source: **One way sync:** the Exchange sync is one way. Exchange => Zammad. Changes to your users inside of Zammad might be overwritten by the Exchange sync.
de: **Einweg-Synchronisation:** Die Exchange-Synchronisation ist eine Einweg-Synchronisation. Exchange => Zammad. Änderungen an Ihren Benutzern in von Zammad können durch die Exchange-Synchronisierung überschrieben werden.
sr: **Синхронизација у једном смеру:** Exchange синхронизација је једносмерна: Exchange => Zammad. Може преписати ваше измене корисника унутар Zammad-а.

source: To configure the Exchange integration, go to the *System > Integrations > Exchange* in the admin panel. Depending on your setup, continue either with the configuration for the basic authentication in the next section or head over to the :ref:`OAuth section <exchange-oauth>`.
de: Um die Exchange-Integration zu konfigurieren, gehen Sie im Admin-Bereich zu *System > Integrationen > Exchange*. Je nach Setup fahren Sie entweder mit der Konfiguration für die Basisauthentifizierung im nächsten Abschnitt fort oder gehen Sie zum :ref:`OAuth-Abschnitt <exchange-oauth>` über.
sr: За подешавање Exchange интеграције, посетите *Систем > Интеграције > Exchange* у панелу администратора. У зависности од ваше поставке, наставите са подешавањем за basic authentication у следећем одељку или прескочите на :ref:`OAuth одељак <exchange-oauth>`.

source: Basic Authentication Setup
de: Einrichtung Basic Authentication
sr: Basic Authentication подешавање

source: In the Exchange integration screen, make sure **Basic Authentication** is selected in the dropdown. Click on **Configure** which opens a dialog where you have to provide the following information:
de: Vergewissern Sie sich in der Ansicht der Exchange-Integration, dass in der Dropdown-Liste **Basic Authentication** ausgewählt ist. Klicken Sie auf **Konfigurieren**, woraufhin sich ein Dialogfeld öffnet, in dem Sie die folgenden Informationen angeben müssen:
sr: У екрану Exchange интеграције, проверите да ли је одабрана опција **Basic Authentication**. Кликните на дугме **Подеси** које ће приказади дијалог где треба да унесете следеће информације:

source: **Endpoint**: The URL/IP of your Exchange server
de: **Endpunkt**: Die URL/IP Ihres Exchange-Servers
sr: **Путања**: URL/IP адреса вашег Exchange сервера

source: **User**: the user you want to use for the sync. Make sure that the user has appropriate permissions to the address book / folder you want to sync.
de: **Benutzer**: der Benutzer, den Sie für die Synchronisierung verwenden möchten. Vergewissern Sie sich, dass der Benutzer über die entsprechenden Berechtigungen für das Adressbuch verfügt, das Sie synchronisieren möchten.
sr: **Корисник**: корисничко име које желите да користите за синхронизацију. Проверите да корисник има одговарајуће дозволе за адресар / фолдер који желите да синхронизујете.

source: **Password**: Password of the user.
de: **Passwort**: Passwort des Benutzers.
sr: **Лозинка**: Корисничка лозинка.

source: If the SSL verification fails while connecting to Exchange, Zammad will ask you to turn it off temporarily.
de: Wenn die SSL-Überprüfung bei der Verbindung zu Exchange fehlschlägt, fordert Zammad Sie auf, sie vorübergehend zu deaktivieren.
sr: Уколико SSL провера не успе током остваривања везе са Exchange-ом, Zammad ће вас питати да је привремено искључите.

source: Please be aware that **turning off SSL verification is a security risk**. It should only be used temporarily or for testing purposes. If turned off, there is no verification of the certificate, which means that every presented certificate will be accepted.
de: Bitte beachten Sie, dass **das Deaktivieren der SSL-Verifizierung ein Sicherheitsrisiko darstellt**. Es sollte nur vorübergehend oder zu Testzwecken verwendet werden. Wenn diese Option deaktiviert ist, findet keine Überprüfung des Zertifikats statt, was bedeutet, dass jedes vorgelegte Zertifikat akzeptiert wird.
sr: Имајте на уму да **искључивање SSL провере носи безбедносни ризик**. Требало би је искључити само привремено или ради тестирања. Уколико је искључена, сертификати неће бити верификовани, што значи да ће било који достављени сертификат бити признат.

source: On the last two steps Zammad will ask you for the address book(s) and your desired attribute mapping. By default, Zammad only maps email address, first- and lastname.
de: In den letzten beiden Schritten werden Sie von Zammad nach den Adressbüchern und der gewünschten Zuordnung der Attribute gefragt. Standardmäßig ordnet Zammad nur E-Mail-Adressen, Vor- und Nachnamen zu.
sr: У последња два корака Zammad ће вас упитати за адресар(е) и циљно мапирање атрибута. Подразумевано, Zammad ће мапирати само имејл адресу, име и презиме.

source: After pressing Continue, Zammad will check if the configuration is okay. You can then enable Exchange and start your first sync.
de: Nachdem Sie auf Weiter gedrückt haben, prüft Zammad, ob die Konfiguration in Ordnung ist. Sie können dann Exchange aktivieren und Ihre erste Synchronisierung starten.
sr: Након што кликнете на Настави, Zammad ће проверити да ли је конфигурација исправна. Затим можете омогућити Exchange и започети своју прву синхронизацију.

source: OAuth Setup
de: Einrichtung OAuth
sr: OAuth подешавање
