Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: ``Some street 1, 12345 Berlin`` or empty if not set in user object
de: ``Irgendeine Straße 1, 12345 Berlin`` oder leer wenn nicht am Benutzerobjekt gesetzt
sr: ``Назив неке улице 1, 12345 Берлин`` или празно ако није постављено у објекту корисника

source: Article > Created by > Department
de: Artikel > Erstellt von > Abteilung
sr: Чланак > Додато од стране > Одељење

source: ``Sales`` or empty if not set in user object
de: ``Sales`` oder leer wenn nicht am Benutzerobjekt gesetzt
sr: ``Sales`` или празно ако није постављено у објекту корисника

source: Article > Created by > Email
de: Artikel > Erstellt von > Email
sr: Чланак > Додато од стране > Имејл

source: Article > Created by > Fax
de: Artikel > Erstellt von > Fax
sr: Чланак > Додато од стране > Факс

source: ``+4930123456789`` or empty if not set in user object
de: ``+4930123456789`` oder leer wenn nicht im Benutzerobjekt gesetzt
sr: ``+4930123456789`` или празно ако није постављено у објекту корисника

source: Article > Created by > Firstname
de: Artikel > Erstellt von > Vorname
sr: Чланак > Додато од стране > Име

source: ``Joe`` or empty if not set
de: ``Joe`` oder leer wenn nicht gesetzt
sr: ``Joe`` или празно ако није постављено

source: Article > Created by > Lastname
de: Artikel > Erstellt von > Nachname
sr: Чланак > Додато од стране > Презиме

source: ``Doe`` or empty if not set
de: ``Doe`` oder leer wenn nicht gesetzt
sr: ``Doe`` или празно ако није постављено

source: Article > Created by > Login
de: Artikel > Erstellt von > Login
sr: Чланак > Додато од стране > Пријава

source: Article > Created by > Mobile
de: Artikel > Erstellt von > Mobil
sr: Чланак > Додато од стране > Мобилни

source: Article > Created by > Note
de: Artikel > Erstellt von > Notiz
sr: Чланак > Додато од стране > Напомена

source: ``Some note about user`` or empty if not set in user object
de: ``Eine Notiz über den Benutzer`` oder leer wenn nicht am Benutzerobjekt gesetzt
sr: ``Нека напомена о кориснику`` или празно ако није постављено у објекту корисника

source: Article > Created by > Phone
de: Artikel > Erstellt von > Telefon
sr: Чланак > Додато од стране > Телефон

source: Article > Created by > VIP
de: Artikel > Erstellt von > VIP
sr: Чланак > Додато од стране > VIP

source: ``true`` or ``false``
de: ``true`` oder ``false``
sr: ``true`` или ``false``

source: Article > Created by > Web
de: Artikel > Erstellt von > Web
sr: Чланак > Додато од стране > Веб

source: ``https://zammad.com`` or empty if not set in user object
de: ``https://zammad.com`` oder leer wenn nicht im Benutzerobjekt gesetzt
sr: ``https://zammad.com`` или празно ако није постављено у објекту корисника

source: Article > Created
de: Artikel > Erstellt
sr: Article > Додато у

source: Article > From
de: Artikel > Von
sr: Чланак > Од

source: ``Joe Doe <jdoe@example.com>`` may differ, depends on ``FROM`` of send mail
de: ``Joe Doe <jdoe@example.com>`` kann abweichen, kommt auf ``FROM`` der gesendeten E-Mail an
sr: ``Joe Doe <jdoe@example.com>`` може бити различито, зависи од ``FROM`` атрибута имејл поруке

source: Article > Sender > Name
de: Artikel > Sender > Name
sr: Чланак > Пошиљалац > Назив

source: ``Customer``, ``Agent`` or ``System``
de: ``Customer``, ``Agent`` oder ``System``
sr: ``Customer``, ``Agent`` или ``System``

source: Article > Subject
de: Artikel > Betreff
sr: Чланак > Предмет

source: ``My amazing subject``
de: ``Mein tolles Betreff``
sr: ``Мој екстра предмет`

source: Article > Text
de: Artikel > Text
sr: Чланак > Текст

source: ``Test`` without formatting (plain)
de: ``Test`` ohne Formatierung
sr: ``Test`` без форматираног текста (обичан)

source: Article > TicketID
de: Artikel > Ticket-ID
sr: Чланак > TicketID

source: ``1`` (not ticket number)
de: ``1`` (nicht Ticketnummer)
sr: ``1`` (не представља број тикета)

source: Article > To
de: Artikel > An
sr: Чланак > За

source: Article > Type > Name
de: Artikel > Typ > Name
sr: Чланак > Тип > Назив

source: ``email`` (`list of article types <https://github.com/zammad/zammad/blob/develop/db/seeds/ticket_article_types.rb>`_)
de: ``email`` (`Liste der Artikeltypen <https://github.com/zammad/zammad/blob/develop/db/seeds/ticket_article_types.rb>`_)
sr: ``email`` (`листа типова чланака <https://github.com/zammad/zammad/blob/develop/db/seeds/ticket_article_types.rb>`_)

source: Article > Updated by > Address
de: Artikel > Aktualisiert von > Adresse
sr: Чланак > Освежено од стране > Адреса

source: Article > Updated by > Department
de: Artikel > Aktualisiert von > Abteilung
sr: Чланак > Освежено од стране > Одељење

source: Article > Updated by > Email
de: Artikel > Aktualisiert von > Email
sr: Чланак > Освежено од стране > Имејл

source: Article > Updated by > Fax
de: Artikel > Aktualisiert von > Fax
sr: Чланак > Освежено од стране > Факс

source: Article > Updated by > Firstname
de: Artikel > Aktualisiert von > Vorname
sr: Чланак > Освежено од стране > Име

source: Article > Updated by > Lastname
de: Artikel > Aktualisiert von > Nachname
sr: Чланак > Освежено од стране > Презиме

source: Article > Updated by > Login
de: Artikel > Aktualisiert von > Login
sr: Чланак > Освежено од стране > Пријава

source: Article > Updated by > Mobile
de: Artikel > Aktualisiert von > Mobil
sr: Чланак > Освежено од стране > Мобилни

source: Article > Updated by > Note
de: Artikel > Aktualisiert von > Notiz
sr: Чланак > Освежено од стране > Напомена

source: Article > Updated by > Phone
de: Artikel > Aktualisiert von > Telefon
sr: Чланак > Освежено од стране > Телефон

source: Article > Updated by > VIP
de: Artikel > Aktualisiert von > VIP
sr: Чланак > Освежено од стране > VIP

source: Article > Updated by > Web
de: Artikel > Aktualisiert von > Web
sr: Чланак > Освежено од стране > Веб

source: Article > Updated
de: Artikel > Aktualisiert
sr: Чланак > Освежено у

source: Article > Visibility
de: Artikel > Sichtbarkeit
sr: Чланак > Видљивост

source: ``false`` or ``true`` (false if not internal)
de: ``false`` oder ``true`` (false wenn nicht intern)
sr: ``false`` или ``true`` (false ако није интерни)

source: Article Text as HTML (not referenced)
de: Artikel-Text als HTML (nicht referenziert)
sr: Текст чланка у HTML формату (без референцирања)

source: ``Test`` with formatting
de: ``Test`` mit Formatierung
sr: ``Тест`` са форматираним текстом

source: Ticket > Article#
de: Ticket > Artikel#
sr: Чланак > Број

source: ``1`` number of ticket articles
de: ``1`` Anzahl der Ticket-Artikel
sr: ``1`` број чланака тикета

source: Config
de: Konfiguration
sr: Конфигурација

source: Below you'll find config related variables. These hold useful configuration information that you can use within e.g. triggers to show necessary information to your customer.
de: Unten finden Sie konfigurationsbezogene Variablen. Diese beinhalten nützliche Informationen zur Konfigurationen die in z.B. Triggern zum Anzeigen notwendiger Informationen für die Kunden genutzt werden können.
sr: Испод ћете пронаћу променљиве које се односе на конфигурацију. Могу садржати корисне податке које бисте желели да користите унутар нпр. окидача за приказ потребних информација вашим клијентима.

source: Config Variables
de: Konfigurations-Variablen
sr: Променљиве конфигурације

source: Config > Fully Qualified Domain Name
de: Konfiguration > Vollständig qualifizierter Domänenname
sr: Конфигурација > Квалификовани назив домена

source: Config > HTTP type
de: Konfiguration > HTTP-Typ
sr: Конфигурација > HTTP протокол

source: ``https`` or ``http``
de: ``https`` oder ``http``
sr: ``https`` или ``http``

source: Config > Organization
de: Konfiguration > Organisation
sr: Конфигурација > Организација

source: ``Zammad GmbH`` value set in `Branding <https://admin-docs.zammad.org/en/latest/settings-branding.html>`_
de: ``Zammad GmbH`` Wert wird unter `Branding <https://admin-docs.zammad.org/en/latest/settings-branding.html>`_ gesetzt
sr: Вредност организације постављене у `брендингу <https://admin-docs.zammad.org/en/latest/settings-branding.html>`_

source: Config > Product Name
de: Konfiguration > Produktname
sr: Конфигурација > Назив производа

source: ``Helpdesk`` value set in `Branding <https://admin-docs.zammad.org/en/latest/settings-branding.html>`_
de: ``Helpdesk`` Wert wird unter `Branding <https://admin-docs.zammad.org/en/latest/settings-branding.html>`_ gesetzt
sr: Вредност назива производа постављене у `брендингу <https://admin-docs.zammad.org/en/latest/settings-branding.html>`_

source: Config > SystemID
de: Konfiguration > System-ID
sr: Конфигурација > SystemID

source: ``31`` (value between 1 and 99)
de: ``31`` (Wert zwischen 1 und 99)
sr: ``31`` (вредност између 1 и 99)

source: Config > Ticket Hook
de: Konfiguration > Ticket-Hook
sr: Конфигурација > Прикључак тикета

source: Current User
de: Aktueller Benutzer
sr: Тренутни корисник

source: Current user variables always return values of the current user that caused e.g. a trigger to run.
de: Variablen für den aktuellen Benutzer geben immer die Werte zurück, die den z.B. Trigger ausgelöst haben.
sr: Променљиве тренутног корисника увек враћају вредности корисника који је покренуо нпр. окидач.

source: Due to the above fact, these variables are often not (yet) set or available for usage.
de: Aus diesem Grund sind diese Variablen oft (noch) nicht gesetzt oder stehen nicht zur Verfügung.
sr: С обзиром на горњу чињеницу, ове променљиве често немају (још увек) вредност или нису доступне.

source: In situations where e.g. schedulers or triggers run, this most likely is nothing you want to use.
de: In Situationen, in denen z.B. Automatisierungen oder Trigger laufen, werden Sie das höchstwahrscheinlich nicht verwenden wollen.
sr: У ситуацијама када се извршавају нпр. планери или окидачи, ово није нешто на шта бисте желели да се ослоните.

source: Current User Variables
de: Aktueller Benutzer-Variablen
sr: Променљиве тренутног корисника

source: Current User > Address
de: Aktueller Benutzer > Adresse
sr: Тренутни корисник > Адреса

source: ``Some street 1, 12345 Berlin`` or empty if not set
de: ``Irgendeine Straße 1, 12345 Berlin`` oder leer wenn nicht gesetzt
sr: ``Назив неке улице 1, 12345 Берлин`` или празно ако није постављено

source: Current User > Avatar
de: Aktueller Benutzer > Avatar
sr: Тренутни корисник > Аватар

source: avatar picture with width and height in pixel (e.g. 60,60)
de: Avatarbild mit Breite und Höhe in Pixel (z.B. 60,60)
sr: аватар сличица ширине и висине у пикселима (нпр. 60,60)

source: Current User > Created at
de: Aktueller Benutzer > Erstellt am
sr: Тренутни корисник > Додато од стране

source: Current User > Created by > Address
de: Aktueller Benutzer > Erstellt von > Adresse
sr: Тренутни корисник > Додато од стране > Адреса

source: Current User > Created by > Avatar
de: Aktueller Benutzer > Erstellt von > Avatar
sr: Тренутни корисник > Додато од стране > Аватар

source: Current User > Created by > Department
de: Aktueller Benutzer > Erstellt von > Abteilung
sr: Тренутни корисник > Додато од стране > Одељење

source: ``Sales`` or empty if not set
de: ``Verkauf`` oder leer wenn nicht gesetzt
sr: ``Sales`` или празно ако није подешено

source: Current User > Created by > Email
de: Aktueller Benutzer > Erstellt von > Email
sr: Тренутни корисник > Додато од стране > Имејл

source: ``jdoe@customer.tld``
de: ``jdoe@kunde.tld``

source: Current User > Created by > Fax
de: Aktueller Benutzer > Erstellt von > Fax
sr: Тренутни корисник > Додато од стране > Факс

source: ``004930123464789`` or empty if not set
de: ``004930123464789`` oder leer wenn nicht gesetzt
sr: ``004930123464789`` или празно ако није постављено

source: Current User > Created by > Firstname
de: Aktueller Benutzer > Erstellt von > Vorname
sr: Тренутни корисник > Додато од стране > Име

source: ``John`` or empty if not set
de: ``John`` oder leer wenn nicht gesetzt
sr: ``John`` или празно ако није постављено

source: Current User > Created by > Lastname
de: Aktueller Benutzer > Erstellt von > Nachname
sr: Тренутни корисник > Додато од стране > Презиме

source: Current User > Created by > Login
de: Aktueller Benutzer > Erstellt von > Login
sr: Тренутни корисник > Додато од стране > Пријава

source: Current User > Created by > Mobile
de: Aktueller Benutzer > Erstellt von > Mobil
sr: Тренутни корисник > Додато од стране > Мобилни

source: ``0049176123456789`` or empty if not set
de: ``0049176123456789`` oder leer wenn nicht gesetzt
sr: ``0049176123456789`` или празно ако није постављено

source: Current User > Created by > Note
de: Aktueller Benutzer > Erstellt von > Notiz
sr: Тренутни корисник > Додато од стране > Напомена

source: ``Some note to this user`` or empty if not set
de: ``Eine Notiz zu diesem Benutzer`` oder leer wenn nicht gesetzt
sr: ``Нека напомена за овог корисника`` или празно ако није постављено

source: Current User > Created by > Phone
de: Aktueller Benutzer > Erstellt von > Telefon
sr: Тренутни корисник > Додато од стране > Телефон

source: ``004930123456789`` or empty if not set
de: ``004930123456789`` oder leer wenn nicht gesetzt
sr: ``004930123456789`` или празно ако није постављено

source: Current User > Created by > VIP
de: Aktueller Benutzer > Erstellt von > VIP
sr: Тренутни корисник > Додато од стране > VIP

source: Current User > Created by > Web
de: Aktueller Benutzer > Erstellt von > Web
sr: Тренутни корисник > Додато од стране > Веб

source: ``https://zammad.org`` or empty if not set
de: ``https://zammad.org`` oder leer wenn nicht gesetzt
sr: ``https://zammad.org`` или празно ако није постављено

source: Current User > Department
de: Aktueller Benutzer > Abteilung
sr: Тренутни корисник > Одељење

source: Current User > Email
de: Aktueller Benutzer > Email
sr: Тренутни корисник > Имејл

source: Current User > Fax
de: Aktueller Benutzer > Fax
sr: Тренутни корисник > Факс

source: Current User > Firstname
de: Aktueller Benutzer > Vorname
sr: Тренутни корисник > Име

source: Current User > Lastname
de: Aktueller Benutzer > Nachname
sr: Тренутни корисник > Презиме

source: Current User > Login
de: Aktueller Benutzer > Login
sr: Тренутни корисник > Пријава

source: Current User > Mobile
de: Aktueller Benutzer > Mobil
sr: Тренутни корисник > Мобилни

source: Current User > Note
de: Aktueller Benutzer > Notiz
sr: Тренутни корисник > Напомена

source: Current User > Organization > Domain based assignment
de: Aktueller Benutzer > Organisation > Domain basierte Zuordnung
sr: Тренутни корисник > Организација > Додела на основу домен

source: Current User > Organization > Domain
de: Aktueller Benutzer > Organisation > Domain
sr: Тренутни корисник > Организација > Домен

source: ``zammad.com`` or empty if not set
de: ``zammad.com`` oder leer wenn nicht gesetzt
sr: ``zammad.com`` или празно ако није постављено

source: Current User > Organization > Name
de: Aktueller Benutzer > Organisation > Name
sr: Тренутни корисник > Организација > Назив

source: Current User > Organization > Note
de: Aktueller Benutzer > Organisation > Notiz
sr: Тренутни корисник > Организација > Напомена

source: ``A note to the organization of the user`` or empty if not set
de: ``Eine Notiz in der Organisation des Benutzers`` oder leer, wenn nicht gesetzt
sr: ``Напомена организације корисника`` или празно ако није постављено

source: Current User > Organization > Shared organization
de: Aktueller Benutzer > Organisation > Geteilte Organisation
sr: Тренутни корисник > Организација > Заједничка организације

source: Current User > Organization > VIP
de: Aktueller Benutzer > Organisation > VIP
sr: Тренутни корисник > Организација > VIP

source: Current User > Phone
de: Aktueller Benutzer > Telefon
sr: Тренутни корисник > Телефон

source: Current User > Updated at
de: Aktueller Benutzer > Aktualisiert am
sr: Current User > Освежено у

source: Current User > Updated by > Address
de: Aktueller Benutzer > Aktualisiert von > Adresse
sr: Тренутни корисник > Освежено од стране > Адреса

source: Current User > Updated by > Avatar
de: Aktueller Benutzer > Aktualisiert von > Avatar
sr: Тренутни корисник > Освежено од стране > Аватар

source: Current User > Updated by > Department
de: Aktueller Benutzer > Aktualisiert von > Abteilung
sr: Тренутни корисник > Освежено од стране > Одељење

source: Current User > Updated by > Email
de: Aktueller Benutzer > Aktualisiert von > Email
sr: Тренутни корисник > Освежено од стране > Имејл

source: Current User > Updated by > Fax
de: Aktueller Benutzer > Aktualisiert von > Fax
sr: Тренутни корисник > Освежено од стране > Факс

source: Current User > Updated by > Firstname
de: Aktueller Benutzer > Aktualisiert von > Vorname
sr: Тренутни корисник > Освежено од стране > Име

source: Current User > Updated by > Lastname
de: Aktueller Benutzer > Aktualisiert von > Nachname
sr: Тренутни корисник > Освежено од стране > Презиме

source: Current User > Updated by > Login
de: Aktueller Benutzer > Aktualisiert bei > Login
sr: Тренутни корисник > Освежено од стране > Пријава

source: Current User > Updated by > Mobile
de: Aktueller Benutzer > Aktualisiert von > Mobil
sr: Тренутни корисник > Освежено од стране > Мобилни

source: Current User > Updated by > Note
de: Aktueller Benutzer > Aktualisiert von > Notiz
sr: Тренутни корисник > Освежено од стране > Напомена

source: Current User > Updated by > Phone
de: Aktueller Benutzer > Aktualisiert von > Telefon
sr: Тренутни корисник > Освежено од стране > Телефон

source: Current User > Updated by > VIP
de: Aktueller Benutzer > Aktualisiert von > VIP
sr: Тренутни корисник > Освежено од стране > VIP

source: ``false`` or ``true``
de: ``false`` oder ``true``
sr: ``false`` или ``true``

source: Current User > Updated by > Web
de: Aktueller Benutzer > Aktualisiert von > Web
sr: Тренутни корисник > Освежено од стране > Веб

source: Current User > VIP
de: Aktueller Benutzer > VIP
sr: Тренутни корисник > VIP

source: Current User > Web
de: Aktueller Benutzer > Web
sr: Тренутни корисник > Веб

source: Below you can find all available ticket-based variables within Zammad. These can be called via triggers for example. If you're unsure if Zammad does support variables at the point you're at, you can try to type ``::`` to check.
de: Unten finden Sie alle verfügbaren ticketbasierten Variablen in Zammad. Diese können zum Beispiel in Triggern aufgerufen werden. Wenn Sie unsicher sind, welche Variablen an diesem Punkt unterstützt, tippen Sie einfach ``::`` zum Prüfen.
sr: Испод можете пронаћи све доступне променљиве тикета унутар Zammad-а. Могуће их је користити у окидачима, на пример. Ако нисте сигурни да ли Zammad подржава променљиве у неком делу, можете откуцати ``::`` да бисте проверили.

source: Ticket Variables
de: Ticket-Variablen
sr: Променљиве тикета

source: Ticket > Accounted Time
de: Ticket > erfasste Zeit
sr: Тикет > Обрачунато време

source: ``1``, ``2.75`` or empty response
de: ``1``, ``2.75`` oder leere Ausgabe
sr: ``1``, ``2.75`` или празно

source: ``3``, any number of articles existing in the ticket right now
de: ``3``, eine beliebige Anzahl von Artikeln, die derzeit im Ticket vorhanden sind
sr: ``3``, број чланака који тренутно постоје у тикету

source: Ticket > Closing time
de: Ticket > Schließzeit
sr: Тикет > Време затварања

source: Ticket > Created at
de: Ticket > Erstellt am
sr: Тикет > Додато у

source: Ticket > Created by > Address
de: Ticket > Erstellt von > Adresse
sr: Тикет > Додато од стране > Адреса

source: Ticket > Created by > Avatar
de: Ticket > Erstellt von > Avatar
sr: Тикет > Додато од стране > Аватар

source: Ticket > Created by > Department
de: Ticket > Erstellt von > Abteilung
sr: Тикет > Додато од стране > Одељење

source: Ticket > Created by > Email
de: Ticket > Erstellt von > Email
sr: Тикет > Додато од стране > Имејл

source: Ticket > Created by > Fax
de: Ticket > Erstellt von > Fax
sr: Тикет > Додато од стране > Факс

source: Ticket > Created by > Firstname
de: Ticket > Erstellt von > Vorname
sr: Тикет > Додато од стране > Име

source: Ticket > Created by > Lastname
de: Ticket > Erstellt von > Nachname
sr: Тикет > Додато од стране > Презиме

source: Ticket > Created by > Login
de: Ticket > Erstellt von > Login
sr: Тикет > Додато од стране > Пријава

source: Ticket > Created by > Mobile
de: Ticket > Erstellt von > Mobil
sr: Тикет > Додато од стране > Мобилни

source: Ticket > Created by > Note
de: Ticket > Erstellt von > Notiz
sr: Тикет > Додато од стране > Напомена

source: Ticket > Created by > Phone
de: Ticket > Erstellt von > Telefon
sr: Тикет > Додато од стране > Телефон

source: Ticket > Created by > VIP
de: Ticket > Erstellt von > VIP
sr: Тикет > Додато од стране > VIP

source: Ticket > Created by > Web
de: Ticket > Erstellt von > Web
sr: Тикет > Додато од стране > Веб

source: Ticket > Customer > Address
de: Ticket > Kunde > Adresse
sr: Тикет > Клијент > Адреса

source: Ticket > Customer > Avatar
de: Ticket > Kunde > Avatar
sr: Тикет > Клијент > Аватар

source: Ticket > Customer > Department
de: Ticket > Kunde > Abteilung
sr: Тикет > Клијент > Одељење

source: Ticket > Customer > Email
de: Ticket > Kunde > Email
sr: Тикет > Клијент > Имејл

source: Ticket > Customer > Fax
de: Ticket > Kunde > Fax
sr: Тикет > Клијент > Факс

source: Ticket > Customer > Firstname
de: Ticket > Kunde > Vorname
sr: Тикет > Клијент > Име

source: Ticket > Customer > Lastname
de: Ticket > Kunde > Nachname
sr: Тикет > Клијент > Презиме

source: Ticket > Customer > Login
de: Ticket > Kunde > Login
sr: Тикет > Клијент > Пријава

source: Ticket > Customer > Mobile
de: Ticket > Kunde > Mobil
sr: Тикет > Клијент > Мобилни

source: Ticket > Customer > Note
de: Ticket > Kunde > Notiz
sr: Тикет > Клијент > Напомена

source: Ticket > Customer > Phone
de: Ticket > Kunde > Telefon
sr: Тикет > Клијент > Телефон

source: Ticket > Customer > VIP
de: Ticket > Kunde > VIP
sr: Тикет > Клијент > VIP

source: Ticket > Customer > Web
de: Ticket > Kunde > Web
sr: Тикет > Клијент > Веб

source: Ticket > Escalation at
de: Ticket > Eskalation am
sr: Тикет > Ескалација у

source: ``2019-10-07 16:25:00 UTC`` or empty if not applicable
de: ``2019-10-07 16:25:00 UTC`` oder leer, falls nicht zutreffend
sr: ``2019-10-07 16:25:00 UTC`` или празно ако не постоји

source: Ticket > First response
de: Ticket > Erste Reaktion
sr: Тикет > Први одговор

source: ``2019-10-07 16:25:00 UTC`` or empty if not applicable yet
de: ``2019-10-07 16:25:00 UTC`` oder leer, wenn noch nicht zutreffend
sr: ``2019-10-07 16:25:00 UTC`` или празно ако не постоји

source: Ticket > Group > Assign Follow-Ups
de: Ticket > Gruppe > Zuweisung bei Nachfrage
sr: Тикет > Група > Додели наставке

source: Ticket > Group > Assignment Timeout
de: Ticket > Gruppe > Zeitliche Zuweisungsüberschreitung
sr: Тикет > Група > Време истека доделе

source: ``20`` or empty if not configured
de: ``20`` oder leer, wenn nicht konfiguriert
sr: ``20`` или празно ако није постављено

source: Ticket > Group > Follow-up possible
de: Ticket > Gruppe > Nachfrage möglich
sr: Тикет > Група > Могућ наставак

source: ``no`` or ``yes``
de: ``Nein`` oder ``Ja``
sr: ``no`` или ``yes``

source: Ticket > Group > Name
de: Ticket > Gruppe > Name
sr: Тикет > Група > Назив

source: ``Sales``
de: ``Verkauf``

source: Ticket > Group > Note
de: Ticket > Gruppe > Notiz
sr: Тикет > Група > Напомена

source: ``Note about this group``
de: ``Notiz über diese Gruppe``
sr: ``Напомена о овој групи`

source: Ticket > Last contact (agent)
de: Ticket > letzter Kontakt (Agent)
sr: Тикет > Последњи одговор (оператер)

source: Ticket > Last contact (customer)
de: Ticket > letzter Kontakt (Kunde)
sr: Тикет > Последњи одговор (клијент)
