Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: So which one is right for you? *Whichever one is less work.* If you're trying to assign multiple agents to the same group with the same permissions, create a role for them to share—that's what roles are for!
de: Welche Vorgehensweise ist also die Richtige für Sie? *Diejenige, die für Sie weniger arbeitsintensiv ist.* Wenn Sie mehreren Agenten aus einer Gruppe die selben Berechtigungen zuzuweisen wollen, erstellen Sie eine Rolle. Diese können Sie allen Benutzern aus der Gruppe zuweisen - dafür sind Rollen da!
sr: Дакле, који је прави приступ за вас? *Који год вам прави мање посла.* Ако покушавате да доделите више оператера истој групи са истим дозволама, додајте улогу коју ће моћи да деле — за то и служе!

source: 🤔 **Can't see the group permission table?**
de: **🤔 Ich kann die Tabelle mit den Gruppenberechtigungen nicht sehen...**
sr: 🤔 **Не видите табелу групних дозвола?**

source: Please make sure that you have selected the ``ticket.agent`` permission for the user or role.
de: Achten Sie darauf, dass Sie die Berechtigung``ticket.agent`` für den Benutzer oder die Rolle gesetzt haben.
sr: Молимо проверите да ли сте одабрали ``ticket.agent`` дозволу за корисника или улогу.

source: Examples
de: Beispiele
sr: Примери

source: “The Standard Issue”
de: "Der Standard-Fall"
sr: „Правила службе”

source: The group permission table, checked "Full"
de: Gruppenberechtigungstabelle, "Voll" ausgewählt
sr: Табела групних дозвола означена са „све“

source: When a system only has one group, this is the default permission level assigned to all agents. Unless you have special needs in mind, this is the way to go.
de: Wenn ein System nur über eine Gruppe verfügt, ist dies die Standardberechtigung, die allen Agenten zugewiesen ist. Sofern Sie keine speziellen Anforderungen haben, ist dies die einfachste Einstellung.
sr: Када систем има само једну групу, ово је подразумевани ниво дозвола додељен свим оператерима. Осим ако немате посебне потребе на уму, ово је права ствар за вас.

source: “The Supervisor”
de: "Der Überwacher"
sr: „Шеф”

source: The group permission table, checked "Read", "Create", "Change", and "Overview
de: In der Gruppenberechtigungstabelle sind "Lesen“, "Erstellen“, "Ändern“ und "Übersicht“ aktiviert
sr: Табела групних дозвола означена са „читање“, „додавање“, „измена“ и „преглед“

source: Agents with all permissions except for “full” **cannot be assigned tickets**. Otherwise, their privileges are identical to agents with “full” access. Great for letting other people do the real work.
de: Agenten mit allen Berechtigungen außer "Voll“ können **keine Tickets zugewiesen werden**. Ansonsten sind ihre Berechtigungen identisch mit denen von Agenten mit "vollem“ Zugriff. Großartig, um andere Leute die eigentliche Arbeit machen zu lassen.
sr: Оператерима са свим дозволама осим „све“ **не могу бити додељени тикети**. Иначе, њихове привилегије су идентичне оператерима са пуним приступом. Одлично је за пуштање других људи да раде на прави начин.

source: “The Meddler”
de: "Der Einmischer"
sr: „Мирођија“

source: The group permission table, checked "Read", "Change", and "Overview
de: In der Gruppenberechtigungstabelle sind "Lesen“, "Ändern“ und "Übersicht“ aktiviert
sr: Табела групних дозвола означена са „читање“, „измена“ и „преглед“

source: Agents with “read”, “change”, and “overview” access can do everything except create tickets or be assigned to them. Great for getting involved in other people's business.
de: Agenten mit den Zugriffsrechten "Lesen", "Ändern" und "Übersicht" können alles tun, außer Tickets erstellen oder ihnen zugewiesen werden. Ideal, um sich in fremden Tickets einzumischen.
sr: Оператери са дозволом „читање“, „измена“ и „преглед“ могу да раде све осим да отварају тикете или да им буду додељени. Одлично за мешање у послове других људи.

source: “The Intern”
de: "Der Interne"
sr: „Приправник“

source: The group permission table, checked "Create"
de: Gruppenberechtigungstabelle, "Erstellen" ausgewählt
sr: Табела групних дозвола означена са „додавање“

source: Agents with only “create” permission can do just that, and nothing else—once they hit **Save**, they'll never see that ticket again. Great for taking phone calls for someone more important than you.
de: Agenten, die nur Zugriff auf "Erstellen" haben, können genau das und nichts anderes tun - sobald sie auf **Speichern** klicken, wird ihnen das Ticket nie wieder angezeigt. Ideal, um nur Anrufe für jemanden entgegenzunehmen.
sr: Оператери са дозволом само за „додавање“ могу да ураде управо то, и ништа друго – чим притисну **Сачувај**, више никада неће видети тај тикет. Одлично за примање телефонских позива за некога важнијег од вас.

source: Learn more
de: Erfahren Sie mehr
sr: Saznajte više

source: This is the group management area. Here you can edit existing groups and add new groups.
de: Dies ist der Gruppenverwaltungsbereich. Von hier aus können Sie bestehende Gruppen bearbeiten und neue Gruppen hinzufügen.
sr: Ово је област управљања групом. Овде можете уређивати постојеће групе и додавати нове групе.

source: Groups in Zammad are similar to working groups that deal with different topics within a company. For example, the tickets relevant to the sales department might be available in the *Sales* group, while the tickets for the support department might be available in the *Support* group. These are just examples; how you structure your groups is up to you.
de: Gruppen in Zammad ähneln Arbeitsgruppen, die sich mit unterschiedlichen Themen innerhalb eines Unternehmens befassen. Beispielsweise könnten die für die Vertriebsabteilung relevanten Tickets in der Gruppe *Vertrieb* bearbeitet werden, während die Tickets für die Supportabteilung möglicherweise in der Gruppe *Support* bearbeitet werden. Das sind nur Beispiele; Wie Sie Ihre Gruppen strukturieren, bleibt Ihnen überlassen.
sr: Групе у Zammad-у су сличне радним групама које се баве различитим темама унутар фирме. На пример, тикети релевантни за одељење продаје могу бити доступне у групи *Продаја*, док тикети за одељење подршке могу бити доступне у групи *Подршка*. Ово су само примери; како ћете структурирати своје групе зависи само од вас.

source: Tickets enter Zammad through various channels (e.g. via email) and are then sorted into these groups. The tickets (cases) are thus made available to the agents responsible for the group. Each ticket can only belong to one group, and you can decide via **access levels** (see below) what access your agents have in each group.
de: Tickets gelangen über verschiedene Kanäle (z.B. per E-Mail) in Zammad und werden dann in Gruppen einsortiert. Die Tickets (Fälle) werden so den für die Gruppe zuständigen Agenten zur Verfügung gestellt. Jedes Ticket kann nur zu einer Gruppe gehören, und Sie können über **Zugriffsberechtigungen** (siehe unten) entscheiden, welchen Zugriff Ihre Agenten in jeder Gruppe haben.
sr: Тикети долазе у Zammad преко различитих канала (нпр. путем имејла), а затим се сортирају у ове групе. Тикети (случајеви) су на тај начин доступни оператерима одговорним за групу. Сваки тикет може припадати само једној групи, а ви можете да одлучите преко **групних дозвола** (погледајте испод) који приступ имају ваши оператери у свакој групи.

source: For example, you might want set up a group *Management* for confidential tickets. With access levels, you can configure that only a few selected agents will have access to these tickets.
de: Sie könnten zum Beispiel eine Gruppe *Management* für vertrauliche Tickets einrichten. Mit Zugriffsberechtigungen können Sie festlegen, dass nur einige ausgewählte Agenten Zugriff auf diese Tickets haben.
sr: На пример, можда желите да подесите групу *Менаџмент* за поверљиве тикете. Са нивоима приступа, можете подесити да само неколико изабраних оператера има приступ овим тикетима.

source: For an additional way to categorize tickets, have a look at :doc:`/manage/tags`.
de: Eine weitere Möglichkeit zur Kategorisierung von Tickets finden Sie unter :doc:`/manage/tags`.
sr: За додатни начин категоризације тикета, погледајте :doc:`/manage/tags`.

source: Zammad users are global to the whole instance. Restriction to specific groups is not possible.
de: Zammad-Benutzer gelten global für die gesamte Instanz. Eine Beschränkung auf bestimmte Gruppen ist nicht möglich.
sr: Zammad корисници су глобални за целу инстанцу. Ограничење за одређене групе није могуће.

source: If the *Group* field does not appear in the ticket view, ensure that:
de: Wenn das Feld *Gruppe* nicht in der Ticketansicht angezeigt wird, stellen Sie sicher, dass:
sr: Ако се поље *Група* не појављује у приказу тикета, уверите се да:

source: you have created more than one group
de: Sie mehr als eine Gruppe erstellt haben
sr: додали сте више група

source: the current user has "change" permissions to more than one group
de: Der aktuelle Benutzer über die "Änderungs“-Berechtigungen für mehr als eine Gruppe verfügt
sr: тренутни корисник има дозволу „измена“ за више група

source: This is necessary because Zammad automatically hides selection fields with only one option.
de: Dies ist notwendig, da Zammad Auswahlfelder mit nur einer Option automatisch ausblendet.
sr: Ово је неопходно јер Zammad аутоматски сакрива поља за избор са само једном опцијом.

source: Group Settings
de: Gruppeneinstellungen
sr: Подешавања групе

source: Click on a group to edit it, or click on *New group* to create a new group.
de: Klicken Sie auf eine Gruppe, um sie zu bearbeiten, oder klicken Sie auf *Neue Gruppe*, um eine neue Gruppe zu erstellen.
sr: Кликните на групу да бисте је уредили или кликните на *Нова група* да бисте додали нову групу.

source: Screenshot showing Zammad's group management
de: Screenshot, der die Gruppenverwaltung von Zammad zeigt
sr: Снимак екрана који приказује управљање групом у Zammad-у

source: No matter if you're going to edit or create a new group, each group comes with the following settings you can adjust as needed.
de: Unabhängig davon, ob Sie eine Gruppe bearbeiten oder eine neue erstellen, verfügt jede Gruppe über die folgenden Einstellungen, die Sie nach Bedarf anpassen können.
sr: Без обзира да ли ћете уредити или додати нову групу, свака група долази са следећим подешавањима која можете да прилагодите по потреби.

source: Please note that groups cannot be removed.
de: Bitte beachten Sie, dass Gruppen nicht entfernt werden können.
sr: Обратите пажњу да се групе не могу уклонити.

source: This is the name your agents (and customers when using :doc:`/channels/web`) will see within the Zammad-UI.
de: Dies ist der Name, den Ihre Agenten (und Kunden bei Verwendung von :doc:`/channels/web`) in der Zammad-Benutzeroberfläche sehen.
sr: Ово је назив које ће ваши оператери (и клијенти када користе :doc:`/channels/web`) видети у оквиру Zammad корисничког интерфејса.

source: Parent group
de: Übergeordnete Gruppe
sr: Надређена група

source: You can define *another* group as a parent group here. This is useful if you want to create group hierarchies. In such a hierarchy (child/parent relation), the tree of the parent group is inherited to the child group. That means if you move a group which itself has child groups, the child groups are "moved" accordingly. However, there is no inheritance of membership or permissions. That means you can treat each group as an individual group - even if they have a child/parent relation.
de: Sie können hier eine *andere* Gruppe als übergeordnete Gruppe definieren. Dies ist nützlich, wenn Sie Gruppenhierarchien erstellen möchten. In einer solchen Hierarchie wird der Baum der übergeordneten Gruppe an die untergeordnete Gruppe vererbt. Das heißt, wenn Sie eine Gruppe verschieben, die selbst Untergruppen hat, werden die Untergruppen entsprechend "verschoben". Es gibt jedoch keine Vererbung von Zuweisungen oder Berechtigungen. Das bedeutet, dass Sie jede Gruppe als *eigenständige Gruppe* behandeln können - auch wenn sie eine in Beziehung zueinander stehen.
sr: Можете одредити неку *другу* групу као надређену групу овде. Ово је корисно ако желите да направите хијерархију група. У таквој хијерархији (однос подређени/надређени), стабло надређене групе се наслеђује за подређену групу. Ово значи да ако преместите групу која има своје подређене групе, све подређене групе ће бити такође „премештене”. Међутим, не постоји наслеђивање дозвола. Ово значи да можете третирати сваку групу на појединачан начин – чак иако имају однос подређени/надређени.

source: Zammad doesn't show you any child group of the currently selected group in the edit dialog. This would lead to a circular reference!
de: Zammad zeigt Ihnen im Bearbeitungsdialog keine untergeordneten Gruppen der aktuell ausgewählten Gruppe an. Dies würde zu einem Zirkelbezug führen!
sr: Zammad не приказује предређене групе тренутно одабране групе у дијалогу уређивања. Ово би иначе водило до кружне референце!

source: Zammad supports 10 hierarchy levels for groups as a maximum.
de: Zammad unterstützt maximal 10 Hierarchieebenen für Gruppen.
sr: Zammad подржава максимално 10 нивоа групне хијерархије.

source: Assignment timeout
de: Zeitliche Zuweisungsüberschreitung
sr: Време истека доделе

source: The time in minutes after which the ticket's ownership will revert back to *unassigned* after the assigned agent hasn't worked on the ticket. This timeout does *not* take any working hours in account.
de: Die Zeit in Minuten, nach der der Besitzer des Tickets wieder auf "nicht zugewiesen“ zurückgesetzt wird, sofern der zugewiesene Besitzer (Agent) nicht an dem Ticket gearbeitet hat. Bei dieser Zeitüberschreitung werden *keine* Arbeitszeiten berücksichtigt.
sr: Време у минутима након којег ће се власништво тикета вратити на *недодељено* након што додељени оператер није радио на тикету. Калкулација овог временског истека *не* узима у обзир радне сате.

source: Follow-up possible
de: Nachfrage möglich
sr: Могућ наставак

source: This option allows you to decide how Zammad should react if a customer replies to a closed ticket (no matter if by e.g. email or UI).
de: Mit dieser Option können Sie entscheiden, wie Zammad sich verhalten soll, wenn ein Kunde auf ein geschlossenes Ticket antwortet (egal ob per E-Mail oder Benutzeroberfläche).
sr: Ова опција вам омогућава да одлучите како Zammad треба да реагује ако клијент одговори на затворени тикет (без обзира да ли путем имејла или корисничког интерфејса).

source: yes
de: ja
sr: да

source: The ticket will be reopened. This is the default value.
de: Das Ticket wird wieder geöffnet. Dies ist der Standardwert.
sr: Тикет ће бити поново отворен. Ово је подразумевана вредност.

source: do not reopen Ticket but create new Ticket
de: Ticket nicht wieder öffnen, sondern neues Ticket erstellen
sr: уместно поновног отварања отвори нови тикет

source: The ticket will remain closed and Zammad will create a new ticket instead. The new ticket contains the customers reply only.
de: Das Ticket bleibt geschlossen und Zammad erstellt stattdessen ein neues Ticket. Das neue Ticket enthält nur die Antwort des Kunden.
sr: Тикет ће остати затворен и Zammad ће уместо њега отворити нов тикет. Нов тикет садржи само одговор клијента.

source: do not reopen ticket after certain time but create new ticket
de: nach einer bestimmten Zeit das Ticket nicht wieder öffnen, sondern ein neues erstellen
sr: уместо поновног отварања након извесног времена отвори нови тикет

source: The ticket can be reopened unless the specified number of days *after last ticket closure* has been exceeded. If the time limit is exceeded, Zammad will create a new ticket instead of reopening.
de: Das Ticket kann wieder geöffnet werden, es sei denn, die angegebene Anzahl von Tagen *nach der letzten Schließung des Tickets* wurde überschritten. Wenn das Zeitlimit überschritten wurde, erstellt Zammad ein neues Ticket, anstatt es erneut zu öffnen.
sr: Тикет се може поново отворити осим ако је прекорачен наведени број дана *након последњег затварања тикета*. Ако је временско ограничење прекорачено, Zammad ће отворити нов тикет уместо поновног отварања.

source: Choosing this option will provide the option *Reopening time in days* which requires you to provide the number of days you want Zammad to wait until it creates new tickets.
de: Wenn Sie diese Option wählen, wird die Option *Wiedereröffnungszeit in Tagen* angezeigt, bei der Sie die Anzahl der Tage angeben müssen, nach denen Zammad ein neues Ticket erstellen soll.
sr: Избор ове опције ће обезбедити опцију *Време поновног отварања у данима* која захтева да наведете број дана који желите да Zammad сачека док не крене да отвара нове тикета.

source: Assign follow-ups
de: Zuweisung bei Nachfrage
sr: Додели наставке

source: This setting allows you to decide if, upon a reopen of a ticket, the last assigned owner should stay assigned or if Zammad should reset the owner to nobody.
de: Mit dieser Einstellung können Sie festlegen, ob beim erneuten Öffnen eines Tickets der zuletzt zugewiesene Besitzer gesetzt bleiben soll oder ob Zammad den Besitzer zurücksetzen soll.
sr: Ово подешавање вам омогућава да одлучите да ли, након поновног отварања тикета, последњи додељени власник треба да остане додељен или да Zammad ресетује власника на никога.

source: The ticket will remain with the last agent who owned it. This is the default value.
de: Das Ticket verbleibt beim letzten Agenten, dem es zugewiesen ist. Dies ist der Standardwert.
sr: Тикет ће остати последњем оператеру који га је поседовао. Ово је подразумевана вредност.

source: no
de: nein
sr: не

source: The owner assignment of the ticket will be removed.
de: Der Besitzer wird aus dem Ticket entfernt.
sr: Додела власника тикета ће бити уклоњена.

source: Sending Email Address
de: E-Mail-Versandadresse
sr: Имејл адреса за слање

source: Select which sender's email address Zammad will use outbound for replying on a ticket in this group.
de: Wählen Sie die E-Mail-Adresse des Absenders aus, die Zammad ausgehend für die Beantwortung eines Tickets in dieser Gruppe verwenden soll.
sr: Изаберите имејл адресу пошиљаоца коју ће Zammad користити као одлазну адресу за одговарање на тикет у овој групи.

source: **You don't have an email address configured yet?**
de: **Sie haben noch keine E-Mail-Adresse konfiguriert?**
sr: **Још немате подешену имејл адресу?**

source: Please configure an email based channel before here
de: Bitte konfigurieren Sie zuvor einen E-Mail-basierten Kanal hier
sr: Прво подесите имејл канал

source: :doc:`Channels → Email </channels/email/index>`
de: :doc:`Kanäle → E-Mail </channels/email/index>`
sr: :doc:`Канали → Имејл </channels/email/index>`

source: :doc:`Channels → Microsoft 365 IMAP </channels/microsoft365/index>`
de: :doc:`Kanäle → Microsoft 365 IMAP </channels/microsoft365/index>`
sr: :doc:`Канали → Microsoft 365 IMAP </channels/microsoft365/index>`

source: :doc:`Channels → Microsoft 365 Graph </channels/microsoft365-graph/index>`
de: :doc:`Kanäle → Microsoft 365 Graph </channels/microsoft365/index>`
sr: :doc:`Канали → Microsoft 365 Graph </channels/microsoft365-graph/index>`

source: :doc:`Channels → Google </channels/google/index>`
de: :doc:`Kanäle → Google </channels/google/index>`
sr: :doc:`Канали → Google </channels/google/index>`

source: and come back afterwards.
de: und fahren Sie anschließend hier fort.
sr: а затим се вратите овде.

source: Signature
de: Signatur
sr: Потпис

source: Choose which :doc:`signature </channels/email/signatures>` to use when replying to tickets in this group. Leaving this option unset will send emails without any signature.
de: Wählen Sie aus, welche :doc:`Signatur </channels/email/signatures>` beim Beantworten von Tickets in dieser Gruppe verwendet werden soll. Wenn Sie diese Option nicht aktivieren, werden E-Mails ohne Signatur versendet.
sr: Изаберите који :doc:`потпис </channels/email/signatures>` желите да користите када одговарате на тикете у овој групи. Ако ову опцију не подесите, имејл поруке ће се слати без икаквог потписа.

source: Shared Drafts
de: Gemeinsame Entwürfe
sr: Заједнички нацрти

source: Shared drafts allows your agents to share ticket drafts (for new and existing tickets) with their colleagues. By default this setting is enabled, disable it if you don't want your agents to use this function.
de: Mit freigegebenen Entwürfen können Ihre Agenten Ticketentwürfe (für neue und bestehende Tickets) mit ihren Kollegen teilen. Standardmäßig ist diese Einstellung aktiviert. Deaktivieren Sie sie, wenn Ihre Agenten diese Funktion nicht verwenden sollen.
sr: Заједнички нацрти омогућавају вашим оператерима да деле нацрте тикета (за нове и постојеће тикете) са својим колегама. Подразумевано је ова поставка омогућена, онемогућите је ако не желите да ваши оператери користе ову функцију.

source: Learn more about shared drafts :user-docs:`in our user documentation </extras/shared-drafts.html>`.
de: Erfahren Sie mehr über geteilte Entwürfe :user-docs:`in unserer Benutzer-Dokumentation </extras/shared-drafts.html>`.
sr: Сазнајте више о заједничким нацртима :user-docs:`у нашој корисничкој документацији </extras/shared-drafts.html>`.

source: Summary Generation
de: Erstellung der Zusammenfassung

source: Allows to override the setting about when to generate the :doc:`AI ticket summary </ai/summary>` on group level.
de: Ermöglicht es, die Einstellung auf Gruppenebene zu überschreiben, wann die :doc:`KI-Ticket-Zusammenfassung </ai/summary>` erstellt werden soll.

source: An internal note about the group that is only visible to people who can access the group management area.
de: Ein interner Hinweis zur Gruppe, der nur für Personen sichtbar ist, die Zugriff auf den Gruppenverwaltungsbereich haben.
sr: Интерна напомена о групи која је видљива само људима који могу да приступе области управљања групом.

source: Want to handle tickets from an inactive group, which are updated by customers?
de: Möchten Sie mit Tickets aus einer inaktiven Gruppe umgehen, die von Kunden aktualisiert werden?
sr: Желите да обрађујете тикете у искљученој групи, које клијенти освежавају?

source: You could e.g. create a trigger which moves them to another group when they got updated. Create this trigger before deactivating the group so it is selectable in the trigger configuration.
de: Sie könnten z.B. einen Trigger erstellen, der sie in eine andere Gruppe verschiebt, wenn sie aktualisiert wurden. Erstellen Sie diesen Trigger, bevor Sie die Gruppe deaktivieren, damit sie in der Trigger-Konfiguration auswählbar ist.
sr: Можете нпр. да додате окидач који их премешта у другу групу након освежавања. Додајте овај окидач пре искључивања групе тако да је одабир исте могућ приликом подешавања окидача.

source: Please keep in mind that you still can route tickets into these groups. This is potentially dangerous, make sure the group is no longer part of email filters or a destination group.
de: Bitte beachten Sie, dass Tickets weiterhin diesen Gruppen zugewiesen werden können. Dies ist potenziell gefährlich. Stellen Sie deshalb sicher, dass die Gruppen nicht mehr Teil von E-Mail-Filtern oder einer in anderen Kanälen hinterlegt sind.
sr: Имајте на уму да још увек можете да усмерите тикете у ове групе. Ово је потенцијално опасно, уверите се да група више није део имејл филтера или одредишне групе.

source: Publish your own library of FAQs, how-tos, internal processes and more with the **knowledge base**.
de: Veröffentlichen Sie Ihre eigene Bibliothek von FAQs, Anleitungen, Prozesse und mehr mit der **Knowledge Base**.
sr: Објавите сопствену библиотеку честих питања, упутстава, интерних процеса и још много тога уз **базу знања**.
