Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: To set up a new Gmail or G Suite channel in Zammad, you first have to create an **OAuth app** in Google's Cloud console. Then you can connect Zammad with your Google account and add as many Gmail accounts to Zammad as you want, using only active Gmail browser sessions (no usernames or passwords required).
de: Um einen neuen Gmail- oder G Suite-Kanal in Zammad einzurichten, müssen Sie zunächst eine **OAuth-App** in Googles Cloud-Konsole erstellen. Dann können Sie Zammad mit Ihrem Google-Konto verbinden und so viele Gmail-Konten zu Zammad hinzufügen, wie Sie möchten und dabei nur aktive Browsersitzungen verwenden (keine Nutzernamen oder Passwörter erforderlich).
sr: Да подесите нови Gmail или G Suite канал у Zammad-у, прво ћете морати да креирате **OAuth апликацију** у Google Cloud конзоли. Након тога, моћи ћете да повежете онолико Gmail налога са Zammad-ом колико желите, користећи само активне Gmail сесије (нису потребна корисничка имена или лозинке).

source: If you already set up Google email channels in Zammad, you can easily migrate them to a Google channel. Follow the steps below but skip the step "Add Account" and proceed with :ref:`migrate-channel`.
de: Wenn Sie bereits E-Mail-Kanäle für Google in Zammad eingerichtet haben, können Sie diese einfach in einen Google-Kanal migrieren. Folgen Sie den nachfolgenden Schritten, aber überspringen Sie den Schritt "Konto hinzufügen" und fahren Sie mit :ref:`migrate-channel` fort.
sr: Уколико сте већ подесили Google имејл канале у Zammad-у, можете их једноставно мигрирати на Google канал. Пратите упутства испод, али прескочите корак „Додавање налога” и наставите са :ref:`миграцијом канала <migrate-channel>`.

source: Register an OAuth App
de: Einrichtung einer OAuth-App
sr: Региструјте OAuth апликацију

source: Sign in to the `Google Cloud console <https://console.cloud.google.com/>`_. You should see a dashboard where you can add a new project. If you already have an app which is in production, create a new one and follow the steps below.
de: Melden Sie sich bei der `Google Cloud-Konsole <https://console.cloud.google.com/>`_ an. Sie sollten ein Dashboard sehen, in dem Sie ein neues Projekt hinzufügen können. Wenn Sie bereits eine produktive App im Einsatz haben, erstellen Sie eine neue und folgen Sie den nachfolgenden Schritten.
sr: Пријавите се на `Google Cloud конзолу <https://console.cloud.google.com/>`_. Требало би да видите контролну таблу где можете додати нови пројекат. Уколико већ имате апликацију у продукцији, креирајте нову и пратите кораке испод.

source: Create an OAuth Consent Screen
de: Erstellen eines OAuth-Einwilligungs-Dialogs
sr: Креирање OAuth екрана за сагласност

source: In the left sidebar of your project's "APIs & Services" section, select OAuth consent screen and provide the requested information.
de: Wählen Sie in der linken Seitenleiste des Abschnitts "APIs & Services" Ihres Projekts "OAuth consent screen" und geben Sie die erforderlichen Informationen ein.
sr: У левој бочној траци одељка „APIs & Services” вашег пројекта, одаберите OAuth екран сагласности и унесите тражене информације.

source: Screenshot shows OAuth consent screen creation in Google Cloud console
de: Der Screenshot zeigt die Erstellung des OAuth-Einwilligungsdialogs in der Google Cloud-Konsole
sr: Снимак екрана за подешавање OAuth екрана сагласности у Google Cloud конзоли

source: In the first screen, select "Internal" as User Type and click on "Create".
de: Wählen Sie in der ersten Ansicht als User Type "Internal" und klicken Sie auf "Create".
sr: На првом екрану, одаберите „Internal” за User Type и кликните на „Create”.

source: Provide the following information in the next screen:
de: Geben Sie nächsten Schritt die folgenden Informationen an:
sr: Унесите информације испод на следећем екрану:

source: **App name**: enter a suitable name for this app
de: **App name**: Geben Sie einen passenden Namen für diese App ein
sr: **App name**: унесите одговарајућ назив за ову апликацију

source: **User support email**: select an email address from the dropdown
de: **User support email**: Wählen Sie eine E-Mail-Adresse aus der Dropdown-Liste
sr: **User support email**: одаберите имејл адресу из падајућег менија

source: **Authorized domain**: the domain of your Zammad without http or https prefix
de: **Authorized domain**: die Domain Ihres Zammad-Systems ohne http- oder https-Präfix
sr: **Authorized domain**: домен ваше Zammad инстанце без http или https префикса

source: **Developer contact information**: enter a valid email address
de: **Developer contact information**: Geben Sie eine gültige E-Mail-Adresse ein
sr: **Developer contact information**: унесите исправну имејл адресу

source: After entering the information, click on "Save and Continue". You should be on the "Scopes" screen. Click on "Add or Remove Scopes" to see the dialog as in the following screenshot.
de: Nachdem Sie die Informationen eingegeben haben, klicken Sie auf "Save and Continue". Sie sollten sich auf der Ansicht "Scopes" befinden. Klicken Sie auf "Add or Remove Scopes", um den Dialog wie im folgenden Screenshot zu sehen.
sr: По уносу информација, кликните на „Save and Continue”. Бићете преусмерени на „Scopes” екран. Кликните на „Add or Remove Scopes” за приказ дијалога са снимка испод.

source: Screenshot with highlighted API selection
de: Screenshot mit hervorgehobener API-Auswahl
sr: Снимак екрана са наглашеним одељком одабира API

source: Enter ``https://mail.google.com`` in the "Manually add scopes" text field
de: Geben Sie ``https://mail.google.com`` in das Textfeld "Manually add scopes" ein
sr: Унесите ``https://mail.google.com`` у текстуално поље „Manually add scopes”

source: Click on "Add to Table" to have it in the selectable scopes table above
de: Klicken Sie auf "Add to Table", um sie in die Tabelle der auswählbaren Bereiche aufzunehmen
sr: Кликните на „Add to Table” за приказ у „scopes” табели изнад

source: Select it by checking the box
de: Wählen Sie es aus durch aktivieren des Kästchens
sr: Изаберите означивањем поља за потврду

source: Confirm by clicking the "Update" button
de: Bestätigen Sie mit einem Klick auf die Schaltfläche "Update"
sr: Потврдите кликом на дугме „Update”

source: Go on by clicking "Save and Continue". If your app is in "Testing" mode, add a user as which you want to sign in to your Google account. After that you see a summary screen where you can check the information. Confirm by clicking the "Back to Dashboard" button and go on with creating credentials for your app.
de: Klicken Sie anschließend auf "Save and Continue". Wenn sich Ihre App im "Testing"-Modus befindet, fügen Sie einen Benutzer hinzu, als den Sie sich in Ihrem Google Konto anmelden möchten. Danach sehen Sie eine zusammenfassende Ansicht, in der Sie die Informationen überprüfen können. Bestätigen Sie durch Klicken auf die Schaltfläche "Back to Dashboard" und fahren Sie mit der Erstellung der Zugangsdaten für Ihre App fort.
sr: Кликните на „Save and Continue” за наставак. Уколико је ваша апликација у моду „Testing”, додајте корисника којим се пријављујете на ваш Google налог. Након тога биће вам приказан резиме екран где можете да проверите све информације. Потврдите кликом на „Back to Dashboard” и наставите са генерисањем креденцијала за вашу апликацију.

source: Create Credentials
de: Zugangsdaten erstellen
sr: Генерисање креденцијала

source: Select "Credentials" in the left sidebar, click on "➕ Create Credentials" and choose "OAuth client ID".
de: Wählen Sie "Credentials" in der linken Seitenleiste, klicken Sie auf "➕ Create Credentials" und wählen Sie "OAuth client ID".
sr: Одаберите „Credentials” из леве бочне траке, кликните на „➕ Create Credentials” и изаберите „OAuth client ID”.

source: Screenshot shows credentials screen with highlighted elements
de: Der Screenshot zeigt Credentials-Ansicht mit hervorgehobenen Elementen
sr: Снимак екрана који приказује екран креденцијала са наглашеним елементима

source: Select "Web application" as Application type, give it a name and enter your redirect URL.
de: Wählen Sie als Anwendungstyp "Web application" aus, geben Sie einen Namen ein und geben Sie Ihre Redirect URL ein.
sr: Одаберите „Web application” за „Application type”, дајте јој назив и унесите вашу URL адресу преусмеравања.

source: The redirect URL is basically the domain of your Zammad instance, extended with ``/api/v1/external_credentials/google/callback``.
de: Die Redirect URL ist im Grunde die Domain Ihrer Zammad-Instanz, erweitert um ``/api/v1/external_credentials/google/callback``.
sr: URL адреса преусмеравања је у основи назив домена ваше Zammad инстанце, проширен са ``/api/v1/external_credentials/google/callback`` путањом.

source: You can even find the complete redirect URL in Zammad's admin area under Channels > Google. Click on "Configure App" and find your URL under "Your callback URL".
de: Sie können die vollständige URL sogar im Verwaltungsbereich von Zammad unter Kanäle > Google finden. Klicken Sie auf "App konfigurieren" und kopieren Sie Ihre URL aus "Ihre Callback-URL".
sr: Можете чак пронаћи комплетну URL адресу преусмеравања у Zammad администраторском панелу под Канали > Google. Кликните на „Подеси апликацију” и пронаћите URL адресу под „Ваш URL повратног позива”.

source: Screenshot shows Zammad's configuration dialog for a Google app
de: Der Screenshot zeigt den Konfigurationsdialog von Zammad für eine Google-App
sr: Снимак екрана који приказује Zammad дијалог подешавања за Google апликацију

source: Click on "Create" after inserting the information. You will see a dialog with your client ID and client secret. You need both of them in the next step for configuring Zammad to connect it to Google.
de: Klicken Sie auf "Create", nachdem Sie die Informationen eingegeben haben. Sie sehen einen Dialog mit Ihrer Client ID und Ihrem Client-Secret. Sie benötigen beide im nächsten Schritt für die Konfiguration von Zammad, um es mit Google zu verbinden.
sr: Кликните на „Додај” по уносу свих информација. Биће вам приказан дијалог са вашим клијент ID и клијентском шифром. Биће вам потребне обе вредности у следећем кораку подешавања конекције Zammad-а и Google-а.

source: Configure App
de: App konfigurieren
sr: Подесите апликацију

source: Go to Channels > Google in Zammad's admin area and click on "Configure App". Insert the client ID and client secret which you got in the step before.
de: Gehen Sie in den Einstellungen von Zammad zu Kanäle > Google und klicken Sie auf "App konfigurieren". Geben Sie die Client ID und das Client-Secret ein, die Sie im vorherigen Schritt erhalten haben.
sr: Идите на Канали > Google у Zammad администраторском панелу и кликните на „Подеси апликацију”. Унесите ИД и шифру клијента које сте добили у претходном кораку.

source: Screenshot shows dialogs from Google and Zammad with client ID and secret
de: Screenshot zeigt Dialoge von Google und Zammad mit Client-ID und Secret
sr: Снимак екрана који приказује дијалоге од Google и Zammad са клијент ID и шифром

source: Confirm by clicking the "Submit" button. Now you can add a Google account as channel in Zammad, see next step.
de: Bestätigen Sie mit einem Klick auf die Schaltfläche "Übermitteln". Jetzt können Sie ein Google Konto als Kanal in Zammad hinzufügen, siehe nächster Schritt.
sr: Потврдите кликом на дугме „Пошаљи”. Сада можете додати Google налог као канал у Zammad, видите следећи корак.

source: Add Account
de: Konto hinzufügen
sr: Додавање налога

source: If you already have Google email channels, you can skip this step and head over to :ref:`migrate-channel`.
de: Wenn Sie bereits über Google E-Mail-Kanäle verfügen, können Sie diesen Schritt überspringen und zu :ref:`migrate-channel` übergehen.
sr: Уколико већ имате подешене Google имејл канале, можете прескочити овај корак и наставити право на :ref:`миграцију канала <migrate-channel>`.

source: After you've registered Zammad as an OAuth app, you can connect Gmail accounts to Zammad.
de: Nachdem Sie Zammad als OAuth-App registriert haben, können Sie Konten von Gmail mit Zammad verbinden.
sr: Након што сте регистровали Zammad као OAuth апликацију, можете повезати Gmail налоге са Zammad-ом.

source: By default, Zammad will **delete all emails** in your inbox during the import process. Use the *Keep Messages on Server* setting to :ref:`disable this behavior <google-keep-messages-on-server>`.
de: Standardmäßig **löscht Zammad alle E-Mails** in Ihrem Posteingang während des Importvorgangs. Verwenden Sie die Einstellung *Nachrichten auf dem Server behalten*, um :ref:`dieses Verhalten zu deaktivieren <google-keep-messages-on-server>`.
sr: Подразумевано, Zammad **брише све имејл поруке** из вашег сандучета приликом увоза. Користите подешавање *Чувај поруке на серверу* да бисте :ref:`онемогућили ово понашање <google-keep-messages-on-server>`.

source: Zammad will send an auto-reply message to every email it imports (including the old ones!). Make sure to :doc:`disable this behavior </manage/trigger>` prior adding an email account and to turn it back on once all your messages have been imported.
de: Zammad sendet eine automatische Eingangsbestätigung an alle Absender der importierten E-Mails (auch an die Absender von alten E-Mails!). Stellen Sie sicher, dass Sie :doc:`dieses Verhalten vor dem Hinzufügen eines E-Mail Kontos deaktivieren </manage/trigger>` und es wieder einschalten, sobald alle Ihre E-Mails importiert wurden.
sr: Zammad ће послати аутоматски одговор на сваку имејл поруку коју увезе (укључујући и старе!). Обавезно :doc:`онемогућите ово понашање </manage/trigger>` пре него што додате имејл налог, и укључите га поново када све ваше поруке буду увезене.

source: To connect you Google account, click on "Add Account" in Zammad. You will be redirected to a consent dialog. Click through the screens and and make sure to select the desired Google account as well as to grant the permission for email handling as you can see in the following screenshot.
de: Um Ihr Google Konto zu verbinden, klicken Sie in Zammad auf "Konto hinzufügen". Sie werden dann zu einem Zustimmungsdialog weitergeleitet. Klicken Sie sich durch die Bildschirme und stellen Sie sicher, dass Sie das gewünschte Google Konto auswählen und die Erlaubnis zur E-Mail-Bearbeitung erteilen, wie Sie im folgenden Screenshot sehen können.
sr: За повезивање вашег Google налога, кликните на „Додај налог” у Zammad-у. Бићете преусмерени на екран сагласности. Кликните кроз екране и обавезно одаберите жељени Google налог за давање дозволе за управљање имејлом као што видите на снимку испод.

source: Screenshot shows Google's consent screen with checked email permission
de: Der Screenshot zeigt den Zustimmungsbildschirm von Google mit erteilter E-Mail-Berechtigung
sr: Снимак екрана приказује Google екран сагласности за означеном имејл дозволом

source: After clicking on "Continue", you are redirected to Zammad where you can see a dialog for specifying some settings for the channel:
de: Nachdem Sie auf "Weiter" geklickt haben, werden Sie zu Zammad weitergeleitet, wo Sie einen Dialog sehen, in dem Sie einige Einstellungen für den Kanal festlegen können:
sr: Након клика на „Continue”, бићете преусмерени на Zammad где ће вам бити приказан дијалог за одабир неких подешавања канала:

source: Screenshot shows Zammad's add channel dialog
de: Der Screenshot zeigt das Dialogfeld "Kanal hinzufügen" von Zammad
sr: Снимак екрана који приказује Zammad-ов дијалог додавања канала

source: Use :doc:`filters </channels/google/filters>` for more fine-grained sorting of incoming email.
de: Verwenden Sie :doc:`Filter </channels/google/filters>` für eine feinere Sortierung der eingehenden E-Mails.
sr: Користите :doc:`филтере </channels/google/filters>` за прецизније сортирање долазне поште.

source: **Change to ...** will add this email address to the group for outgoing emails. This may overwrite an already assigned email address.
de: Mit **Wechsel zu ...** wird diese E-Mail-Adresse der Gruppe für ausgehende E-Mails hinzugefügt. Dies kann eine bereits zugewiesene E-Mail-Adresse überschreiben.
sr: **Измени на ...** ће доделити ову имејл адресу групи за одлазну пошту. Ово може преиначити већ додељену имејл адресу.

source: **Do not change email address** doesn't assign an email address to the group or change it. If the group has no assigned email address, it stays empty. If the group already has an assigned email address, it stays the same.
de: **E-Mail-Adresse nicht ändern** weist der Gruppe keine E-Mail-Adresse zu und ändert sie nicht. Wenn der Gruppe keine E-Mail-Adresse zugewiesen ist, bleibt sie leer. Wenn der Gruppe bereits eine E-Mail-Adresse zugewiesen wurde, bleibt diese unverändert.
sr: **Без измене имејл адресе** ће прескочити доделу имејл адресу групи или њену измену. Уколико група нема додељену имејл адресу, остаје празна. Уколико група већ има додељену имејл адресу, остаје иста.

source: Specify which folder (or *label*) to fetch from, or leave empty to fetch from ``INBOX``. If specifying a nested folder, be sure to use the full path, e.g. ``Inquiries/Tech-Support``.
de: Geben Sie an, welcher Ordner (oder welches *Label*) abgerufen werden soll oder lassen Sie ihn leer, um E-Mails aus ``INBOX`` abzurufen. Wenn Sie einen verschachtelten Ordner angeben, stellen Sie sicher, dass Sie den vollständigen Pfad verwenden, z.B. ``Anfragen/Support``.
sr: Изаберите који фолдер (или *label*) желите да примате, или оставите празно за ``INBOX`` доставу. Ако наведете угнежђени фолдер, обавезно користите пуну путању, нпр. ``Inquiries/Tech-Support``.

source: After successfully adding the Google account, you can adjust the default group Zammad is going to assign incoming new tickets to.
de: Nachdem Sie das Google Konto erfolgreich hinzugefügt haben, können Sie die Gruppe einstellen, der Zammad neu eingehende Tickets zuweist.
sr: Након успешног додавања Google налога, можете да прилагодите подразумевану групу којој ће Zammad доделити нове тикете.

source: Migrate from Email Channel
de: Von E-Mail-Kanal migrieren
sr: Миграција са имејл канала

source: Convert Email Channel to Google Channel
de: E-Mail-Kanal in Google-Kanal umwandeln
sr: Претворите имејл канал у Google канал

source: Zammad provides a migration logic that allows you to migrate existing Google accounts from an email channel into a Google channel.
de: In Zammad gibt es eine Migrations-Funktion, mit der Sie ein als E-Mail-Kanal existierendes Google-Konto in einen Google-Kanal umwandeln können.
sr: Zammad обезбеђује логику миграције која вам омогућава да мигрирате постојеће Google налоге са имејл канала на Google канал.

source: 🧐 **Zammad is expecting specific settings**
de: 🧐 **Zammad erwartet konkrete Einstellungen**
sr: 🧐 **Zammad очекује одређена подешавања**

source: In order for Zammad to display the migration option, it expects the channels hostname to be ``imap.gmail.com`` for IMAP and ``smtp.gmail.com`` for SMTP.
de: Damit Zammad die Umwandlung anbietet, muss der Hostname ``imap.gmail.com`` für IMAP und ``smtp.gmail.com`` für SMTP lauten.
sr: Да би Zammad приказао опцију миграције, очекује да назив сервера канала буде ``imap.gmail.com`` за IMAP и ``smtp.gmail.com`` за SMTP.

source: The easiest way to start the migration is to :ref:`register-oauth-google` for your Google accounts before migrating. However, if you don't, Zammad will ask you to provide your app credentials before allowing you to continue.
de: Der einfachste Weg, die Migration zu starten, ist eine :ref:`register-oauth-google` für Ihre Google Konten vor der Migration zu erstellen. Wenn Sie dies nicht tun, werden Sie von Zammad aufgefordert, Ihre App-Zugangsdaten für die Anwendung anzugeben, bevor Sie fortfahren können.
sr: Најлакши начин да започнете миграцију је да :ref:`региструјете апликацију <register-oauth-google>` за своје Google налоге пре конверзије. Међутим, ако то не учините, Zammad ће од вас тражити да доставите акредитиве за апликацију пре него што вам дозволи да наставите.

source: If you're ready to go, simply click on the *Migrate now!* button in the red banner of the email channel in question. Zammad will redirect you to Google and request you to authenticate and consent to said account.
de: Wenn Sie bereit sind, klicken Sie einfach auf den *Jetzt migrieren!* Button im roten Banner des betreffenden E-Mail-Kanals. Sie werden dann zu Google weitergeleitet und müssen sich dort authentifizieren und zustimmen.
sr: Ако сте спремни да почнете, једноставно кликните на дугме *Мигрирај одмах!* на црвеном банеру дотичног имејл канала. Zammad ће вас преусмерити на Google и затражити од вас да потврдите аутентичност и пристанете на наведену операцију.

source: After you pressed next you'll be redirect to Zammad's Google channel overview. Your channel, if successful, is now migrated to an Google channel.
de: Nachdem Sie auf weiter geklickt haben werden Sie zur Konto-Übersicht des Google-Kanals in Zammad weitergeleitet. Ihr Kanal wurde nun erfolgreich in einen Google-Kanal umgewandelt.
sr: Након што притиснете „Даље“, бићете преусмерени на Zammad-ов преглед Google канала. Ако је успешно, ваш канал је сада мигриран на Google канал.

source: Migrate an existing email channel to Google
de: Wandeln Sie einen vorhandenen E-Mail-Kanal in einen Google-Kanal um
sr: Мигрирајте постојећи имејл канал на Google

source: Rolling Back the Migration
de: Rückgängigmachen der Migration
sr: Поништавање миграције

source: In case something went wrong, Zammad allows you to roll back the migration for up to 7 days. For this time period Zammad will remember your original credentials and restore it if needed. These information will be removed entirely after 7 days.
de: Falls etwas schiefgegangen ist, können Sie die Umwandlung innerhalb von 7 Tagen rückgängig machen. Für diese Zeitspanne speichert Zammad die Zugangsdaten und kann sie bei Bedarf wiederherstellen. Diese Zugangsdaten werden nach 7 Tagen vollständig gelöscht.
sr: У случају да нешто пође по злу, Zammad вам омогућава да поништите миграцију до 7 дана уназад. За овај временски период Zammad ће запамтити ваше оригиналне акредитиве и вратити их ако је потребно. Ове информације ће у потпуности бити уклоњене након 7 дана.

source: My OAuth credentials stopped working
de: Mein OAuth-Zugang funktioniert nicht mehr
sr: Моји OAuth креденцијали су одједном престали да раде

source: Did you recently change your Google password? Google invalidates all your OAuth tokens whenever you change it.
de: Haben Sie kürzlich Ihr Google-Passwort geändert? Google setzt alle Ihre OAuth-Tokens auf ungültig, wenn Sie es ändern.
sr: Да ли сте скоро мењали вашу Google лозинку? Google ће прогласити неважећим све ваше OAuth кључеве кад год је промените.

source: How to use the Gmail account for outgoing system notifications?
de: Wie kann das Gmail Konto für ausgehende Systembenachrichtigungen verwenden werden?
sr: Како користити Gmail налог за одлазна системска обавештења?

source: On **subscription/cloud-hosted instances**, you can't do that. Notifications will always come from “Notification Master <noreply\@your.zammad.domain>”.
de: Auf **Cloud-Service Instanzen** ist das nicht möglich. Die Benachrichtigungen kommen immer von "Notification Master <noreply\@your.zammad.domain>".
sr: На **хостованим/инстанцама са претплатом**, једноставно не можете. Обавештења ће увек долазити од „Notification Master <noreply\@your.zammad.domain>“.
