Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: AI Agents
de: KI-Agenten
sr: AI агенти

source: To help your agents focusing on more important tasks, you can create AI agents which can take over routine tasks. These AI agents are managed in Zammad's admin settings under *AI > AI Agents*. Make sure to configure an :doc:`AI provider <provider>` before activating the feature. Otherwise, a warning message will tell you to do so.
de: Damit sich Ihre Agenten auf wichtigere Aufgaben konzentrieren können, können Sie KI-Agenten erstellen, die Routineaufgaben übernehmen können. Diese KI-Agenten werden in den Einstellungen von Zammad unter *KI > KI-Agenten* verwaltet. Stellen Sie sicher, dass Sie einen :doc:`KI-Anbieter <provider>` konfigurieren, bevor Sie die Funktion aktivieren. Andernfalls werden Sie durch eine Warnmeldung darauf hingewiesen.
sr: Да бисте помогли вашим оператерима да се сконцентришу на важније ствари, дефинишите AI агенте који могу преузети рутинске задатке. AI агентима се управља из Zammad администраторског панела под *AI > AI агенти*. Пбавезно подесите :doc:`AI провајдера <provider>` пре укључивања ове функције. У супротном, добићете поруку упозорења која вас опомиње на то.

source: While an AI agent works on a ticket, an avatar is displayed in the live user section in the bottom bar of the ticket detail view, see example below. In such a short period of time, the agents should not apply changes to the ticket because they could get overwritten.
de: Während ein KI-Agent an einem Ticket arbeitet, wird ein Avatar im Live-Benutzer-Bereich in der unteren Leiste der Ticket Detailansicht angezeigt, siehe Beispiel unten. In dieser kurzen Zeitspanne sollten Agenten keine Änderungen am Ticket vornehmen, da diese überschrieben werden könnten.
sr: Док AI агент обрађује тикет, аватар сличица ће бити приказана у одељку присутних.корисника у доњој траци детаљног прегледа тикета, видите пример испод. У том кратком временском интервалу, оператери би требао да избегну освежавања тикета јер њихове измене могу бити преиначене.

source: Screenshot shows avatar of AI agent in the live user section in ticket detail's bottom bar
de: Screenshot zeigt den Avatar des KI-Agenten im Bereich der Live-Benutzer in der unteren Leiste der Ticket-Detailansicht
sr: Снимак екрана који приказује аватар сличицу AI агента у одељку присутних корисника у доњој траци детаљног прегледа тикета

source: Avatar of an AI agent which shows up in the live user section.
de: Avatar eines KI-Agenten, der im Live-Benutzer-Bereich angezeigt wird.
sr: Аватар сличица AI агента која се приказује у одељку присутних корисника.

source: Important Information
de: Wichtige Informationen
sr: Важне информације

source: To configure AI agents, the ``admin.ai_agent`` permission is required
de: Um KI-Agenten zu konfigurieren ist die Berechtigung ``admin.ai_agent`` erforderlich
sr: За подешавања AI агената, неопходна је дозвола ``admin.ai_agent``

source: AI agents don't run on their own. They have to be invoked by a :doc:`trigger </manage/trigger>` or a :doc:`scheduler job </manage/scheduler>` with the action **AI** > **AI Agent**.
de: KI-Agenten laufen nicht von selbst. Sie müssen durch einen :doc:`Trigger </manage/trigger>` oder eine :doc:`Automatisierungsaufgabe </manage/scheduler>` mit der Aktion **KI** > **KI-Agent** aufgerufen werden.
sr: AI агенти неће бити извршени сами од себе. Морају бити покренути од стране :doc:`окидача </manage/trigger>` или a :doc:`планера </manage/scheduler>` преко радње **AI** > **AI агент**.

source: If an AI agent applies changes to a ticket, you can find an entry in the ticket history with the name of the AI agent.
de: Wenn ein KI-Agent Änderungen an einem Ticket vornimmt, finden Sie in der Ticket-Historie einen Eintrag mit dem Namen des KI Agenten.
sr: Уколико AI агент освежи тикет, пронаћићете унос евиденције у историјату тикета под називом AI агента.

source: Manage AI Agents
de: KI-Agenten verwalten
sr: Управљање AI агентима

source: Screenshot shows AI agents management
de: Screenshot zeigt die Verwaltung von KI-Agenten

source: Create an AI agent by clicking the **New AI Agent** button in the top right corner. This opens a wizard where you can choose the type of the agent and additional settings based on the selected type, see :ref:`ai-agent-types` for details. The action column with the ︙ button allows you to clone or delete an AI agent. You can only delete AI agents which are not used in triggers and schedulers. You can find this information in the two columns in the AI agent table.
de: Erstellen Sie einen KI-Agenten, indem Sie auf die Schaltfläche **Neuer KI-Agent** in der oberen rechten Ecke klicken. Dies öffnet einen Assistenten, in dem Sie den Typ des Agenten und zusätzliche Einstellungen basierend auf dem gewählten Typ auswählen können, siehe :ref:`ai-agent-types` für Details. In der Aktionsspalte mit der Schaltfläche ︙ können Sie einen KI-Agenten klonen oder löschen. Sie können nur KI-Agenten löschen, die nicht in Triggern und Automatisierungsaufgaben verwendet werden. Sie finden diese Informationen in den beiden Spalten der Tabelle der KI-Agenten.

source: AI Agent Types
de: KI-Agenten-Typen

source: Define your AI agents and use them afterwards in triggers or scheduler jobs. An example for a trigger configuration could look like this:
de: Definieren Sie Ihre KI-Agenten und verwenden Sie sie anschließend in Triggern oder der Automatisierung. Ein Beispiel für eine Trigger-Konfiguration könnte wie folgt aussehen:

source: Activated by: **Action**
de: Aktiviert durch: **Aktion**

source: Action execution: **Selective**
de: Aktions-Ausführung: **Selektiv**

source: Conditions for affected objects: **Action** *is* ``created``
de: Bedingungen für zu verarbeitende Objekte: **Aktion** *ist* ``erstellt``

source: Execute changes on objects: **AI Agent** > Select your AI agent
de: Führt folgende Änderungen an Objekten durch: **KI Agent** > Wählen Sie Ihren KI-Agenten

source: Depending on the agent type, you can limit the available options for the AI agents. If you do so, make sure to select at least two options the agent can choose from.
de: Je nach Agententyp können Sie die verfügbaren Optionen für die KI-Agenten einschränken. Wenn Sie dies tun, achten Sie darauf, dass Sie mindestens zwei Optionen auswählen, aus denen der Agent wählen kann.

source: Ticket Categorizer
de: Ticket-Kategorisierung

source: This AI agent is capable of assigning categories to tickets. Because there is no built in category field in Zammad, you first have to create a :doc:`custom ticket attribute </system/objects>` in which you want to track the ticket's category. The field type must be one of the select types.
de: Dieser KI-Agent ist in der Lage, Tickets Kategorien zuzuweisen. Da es in Zammad kein eingebautes Kategorie-Feld gibt, müssen Sie zunächst ein :doc:`benutzerdefiniertes Ticket-Attribut </system/objects>` erstellen, in das Sie die Kategorie des Tickets eintragen wollen. Der Feldtyp muss einer der Auswahltypen sein.

source: The ticket categorizer AI agent uses the content of all articles and the title to compare it with your category names. You can limit from which categories the AI agent can choose from and define if multiple values are possible (if using a multi-select field type) in the wizard. In case you limit the categories, you can also provide a description for each category the AI agent can choose from.
de: Der KI-Agent für die Ticket-Kategorisierung verwendet den Inhalt aller Artikel und den Titel, um ihn mit den Kategorienamen zu vergleichen. Sie können die Kategorien, aus denen der KI-Agent wählen kann, einschränken und in der Konfiguration festlegen, ob mehrere Werte möglich sind (bei Verwendung eines Feldtyps mit Mehrfachauswahl). Falls Sie die Kategorien einschränken können Sie auch eine Beschreibung für die einzelnen Kategorien angeben, aus denen der KI-Agent wählen kann.

source: Ticket Group Dispatcher
de: Ticket Gruppen-Zuweiser

source: This AI agent is capable of assigning tickets to different groups. It compares the content of the ticket in question with your group names in Zammad. If a suitable group can be found, it selects this group for the ticket. You can use all of your groups or just specific ones by limiting it for the AI agent in the configuration wizard.
de: Dieser KI-Agent ist in der Lage, Tickets verschiedenen Gruppen zuzuordnen. Er vergleicht den Inhalt des betreffenden Tickets mit Ihren Gruppennamen in Zammad. Wenn eine passende Gruppe gefunden wird, wählt er diese Gruppe für das Ticket aus. Sie können alle Ihre Gruppen oder nur bestimmte Gruppen verwenden, indem Sie diese im Konfigurationsassistenten für den KI-Agenten einschränken.

source: Ticket Prioritizer
de: Ticket-Priorisierung

source: This AI agent is capable of setting a ticket priority based on the title of the ticket and the content of the last article. You can choose to use all priorities or limit them to specific ones. In case you limit the priorities, you can also provide a description for each priority the AI agent can choose from.
de: Dieser KI-Agent ist in der Lage, eine Ticket-Priorität basierend auf dem Titel des Tickets und dem Inhalt des letzten Artikels festzulegen. Sie können entweder alle Prioritäten verwenden oder die Auswahl auf bestimmte Prioritäten einschränken. Falls Sie die Prioritäten einschränken, können Sie eine Beschreibung für alle Prioritäten angeben, aus denen der KI-Agent wählen kann.

source: Ticket Title Rewriter
de: Ticket-Titel-Umschreibung

source: This AI agent is capable of rephrasing the ticket title based on the content of the last article. The title is not considered by the agent and gets completely rewritten. This can be useful if your customers often send requests with unclear subjects or if you have a specific channel which only creates tickets with generic titles (e.g. from a web form).
de: Dieser KI-Agent ist in der Lage, den Titel des Tickets auf der Grundlage des Inhalts des letzten Artikels neu zu formulieren. Der bisherige Titel wird vom Agent nicht berücksichtigt und komplett umgeschrieben. Dies kann nützlich sein, wenn Ihre Kunden häufig Anfragen mit unklarem Betreff senden oder wenn Sie einen bestimmten Kanal haben, der nur Tickets mit generischen Titeln erstellt (z.B. aus einem Webformular).

source: Introduction
de: Einführung
sr: Увод

source: Zammad offers AI powered features to support your agents! The configuration is pretty easy so the entry barrier is low. Read on how to configure it and check which features are currently supported.
de: Zammad bietet KI-gestützte Funktionen zur Unterstützung Ihrer Agenten! Die Konfiguration ist ziemlich einfach, so dass die Einstiegshürde niedrig ist. Lesen Sie, wie man diese konfiguriert und welche Funktionen derzeit unterstützt werden.

source: Provider Configuration
de: Provider-Konfiguration
sr: Подешавања провајдера

source: To use AI feature in Zammad, you have to configure an AI provider which handles the requests. You can configure it in Zammad's admin settings under *AI > Provider*.
de: Um die KI-Funktion in Zammad zu nutzen, müssen Sie einen KI-Provider konfigurieren, der die Anfragen bearbeitet. Sie können dies in den Verwaltungseinstellungen von Zammad unter *KI > Provider* konfigurieren.
sr: За коришћење AI функција у Zammad-у, морате имати подешен AI провајдер који обрађује захтеве. Можете га подесити у Zammad администраторском панелу под *AI > Провајдер*.

source: Screenshot shows configuration of AI provider in Zammad
de: Screenshot zeigt die Konfiguration des KI-Providers in Zammad
sr: Снимак екрана приказује конфигурацију AI провајдера у Zammad-у

source: The following providers are supported:
de: Die folgenden Anbieter werden unterstützt:
sr: Следећи провајдери су подржани:

source: The AI service you have subscribed to is not available? This is just the first step. We are going to add more providers soon! If you want to support us or need the provider as soon as possible, just let our `sales department <https://zammad.com/en/company/contact>`_ know!
de: Der KI-Dienst, den Sie nutzen, ist nicht verfügbar? Dies ist nur der erste Schritt. Wir werden bald weitere Anbieter hinzufügen! Wenn Sie uns unterstützen wollen oder Ihren Anbieter so schnell wie möglich in Zammad benötigen, lassen Sie es einfach unser `Vertriebs-Team <https://zammad.com/en/company/contact>`_ wissen!
sr: AI сервис на који сте већ претплаћени није подржан? Ово је само први корак. Ускоро додајемо све више провајдера! Уколико желите да нас подржите или желите неки провајдер што је пре могуће, обратите се нашем `одељењу продаје <https://zammad.com/en/company/contact>`_!

source: To use Anthropic's service as AI backend, choose it as AI provider and add your API token. After that, make sure to click the ``Save`` button and read on in the desired feature's section. To use a specific model, add its name in the **Model** field. Leave it empty to use the default which is shown as placeholder in the field.
de: Um Anthropics Service als KI-Backend zu nutzen, wählen Sie ihn als KI-Anbieter aus und fügen Sie Ihr API-Token hinzu. Klicken Sie anschließend auf die Schaltfläche ``Speichern`` und lesen Sie im Abschnitt über die gewünschte Funktion weiter. Um ein bestimmtes Modell zu verwenden, fügen Sie dessen Namen in das Feld **Modell** ein. Lassen Sie es leer, um das Standardmodell zu verwenden, das als Platzhalter in dem Feld angezeigt wird.

source: To use the Azure AI service as AI backend, choose it as AI provider and add your URL as well as your API token. You get the URL after configuring the AI service in Azure. After that, make sure to click the ``Save`` button and read on in the desired feature's section.
de: Um den Azure KI-Dienst als KI-Backend zu verwenden, wählen Sie ihn als KI-Anbieter aus und fügen Sie Ihre URL sowie Ihr API-Token hinzu. Sie erhalten die URL, nachdem Sie den KI-Dienst in Azure konfiguriert haben. Klicken Sie anschließend auf die Schaltfläche ``Speichern`` und lesen Sie im Abschnitt über die gewünschte Funktion weiter.

source: `Ollama <https://ollama.com/>`_ is an AI tool that allows you to set up your own AI server on a machine you control. That means your data is not transferred to a third party. Be aware that this only makes sense if you have a powerful GPU in your system!
de: `Ollama <https://ollama.com/>`_ ist ein KI-Tool, mit dem Sie Ihren eigenen KI-Server auf einem Rechner einrichten können, den Sie kontrollieren. Das bedeutet, dass Ihre Daten nicht an eine dritte Partei gesendet werden. Seien Sie sich bewusst, dass dies nur Sinn macht, wenn Sie eine leistungsstarke GPU in Ihrem System haben!

source: When choosing Ollama as your AI provider, you just have to provide the IP/URL of your instance with appended port number. To use a specific model, add its name in the **Model** field. Leave it empty to use the default which is shown as placeholder in the field. In any case, the correct model has to be available.
de: Wenn Sie Ollama als KI-Anbieter wählen, müssen Sie nur die IP/URL Ihrer Instanz mit angehängter Portnummer angeben. Wenn Sie ein bestimmtes Modell verwenden möchten, geben Sie dessen Namen in das Feld **Model** ein. Lassen Sie es leer, um das Standardmodel zu verwenden, das als Platzhalter in dem Feld angezeigt wird. In jedem Fall muss das richtige Model verfügbar sein.

source: If you don't have an Ollama running already, their `deployment guide <https://github.com/ollama/ollama/blob/main/docs/linux.md>`_ is a good starting point. You can find the available models in `Ollama's model library <https://ollama.com/library>`_ and useful information and additional links in the `Ollama Github repository <https://github.com/ollama/ollama>`_. If you just installed Ollama, you can pull and run a model by executing:
de: Wenn Sie noch kein Ollama im Einsatz haben, ist deren `Installationsanleitung <https://github.com/ollama/ollama/blob/main/docs/linux.md>`_ ein guter Ausgangspunkt. Sie finden die verfügbaren Models in `Ollama's Model Library <https://ollama.com/library>`_ und nützliche Informationen und zusätzliche Links im `Ollama-Github-Repository <https://github.com/ollama/ollama>`_. Wenn Sie Ollama installiert haben, können Sie ein Modell abrufen und ausführen, indem Sie folgendes ausführen:

source: Make sure to click the ``Save`` button and read on in the desired feature's section.
de: Stellen Sie sicher, dass Sie auf ``Speichern`` klicken und lesen Sie im Abschnitt der gewünschten Funktion weiter.

source: You probably already heard about `OpenAI <https://openai.com/>`_, haven't you? To use their service as AI backend, choose them as AI provider and add your API token. To use a specific model, add its name in the **Model** field. Leave it empty to use the default which is shown as placeholder in the field.
de: Sie haben wahrscheinlich schon von `OpenAI <https://openai.com/>`_ gehört, oder? Um deren Dienst als KI-Anbieter zu nutzen, wählen Sie sie als KI-Anbieter und fügen Sie Ihr API-Token hinzu. Um ein bestimmtes Model zu verwenden, fügen Sie dessen Namen in das Feld **Model** ein. Lassen Sie es leer, um das Standardmodel zu verwenden, das als Platzhalter in dem Feld angezeigt wird.

source: Zammad AI
de: Zammad KI

source: Zammad as AI provider is currently limited to specific customers for testing. If you're interested as well, please `let our sales department know <https://zammad.com/en/company/contact>`_.
de: Zammad als KI-Anbieter ist derzeit auf bestimmte Kunden zu Testzwecken beschränkt. Wenn auch Sie Interesse haben, melden Sie sich bitte bei `unserer Vertriebsabteilung <https://zammad.com/de/company/contact>`_.

source: The usage of Zammad AI as a provider has some benefits:
de: Die Nutzung von Zammad AI als Provider hat einige Vorteile:
sr: Коришћење Zammad AI као провајдера долази са неким погодностима:

source: You don't have to care about the setup and configuration compared to your own setup.
de: Im Gegensatz zu einem eigenen Setup müssen Sie sich nicht um die Einrichtung und Konfiguration kümmern.
sr: Не морате да бринете о поставци и подешавањима у односу на ваш сопствени сервис.

source: Your requests with sensitive information aren't used for training.
de: Ihre Anfragen mit sensiblen Informationen werden nicht zum KI-Training verwendet.
sr: Ваши захтеви за осетљивим информацијама неће бити коришћени за тренинг модела.

source: If something isn't working as expected, you just have one place where you get support.
de: Wenn etwas nicht wie erwartet funktioniert, haben Sie eine Anlaufstelle, bei der Sie Unterstützung erhalten.
sr: Уколико нешто не функционише очекивано, имате подршку на само једном месту.

source: To configure it, simply choose **Zammad AI** as your provider and add your token. After that, make sure to click the ``Save`` button and read on in the desired feature's section.
de: Um es zu konfigurieren, wählen Sie einfach **Zammad AI** als Anbieter und fügen Sie Ihr Token hinzu. Klicken Sie anschließend auf die Schaltfläche ``Speichern`` und lesen Sie im Abschnitt der gewünschten Funktion weiter.

source: Ticket Summary
de: Ticket Zusammenfassung
sr: Сажети опис тикета

source: Activating this feature generates summaries of tickets which are displayed in a new ticket sidebar tab. This can be a huge time saver when dealing with large tickets and/or many hand-overs between agents.
de: Wenn Sie diese Funktion aktivieren, werden Zusammenfassungen von Tickets erstellt, die in einem neuen Seitenleisten-Tab angezeigt werden. Dies kann bei großen Tickets und/oder vielen Übergaben zwischen Agenten eine enorme Zeitersparnis bedeuten.

source: Make sure to configure an :doc:`AI provider <provider>` before activating the feature. Otherwise, a warning message will tell you to do so.
de: Stellen Sie sicher, dass Sie einen :doc:`KI-Anbieter <provider>` konfigurieren, bevor Sie die Funktion aktivieren. Andernfalls werden Sie durch eine Warnmeldung darauf hingewiesen.

source: Screenshot shows AI ticket summary configuration
de: Screenshot zeigt die Konfiguration der KI-Ticket-Zusammenfassung

source: If you activate this feature, **Customer Intent** and **Conversation Summary** are enabled by default. You can choose to activate **Open Questions**, **Upcoming Events** and **Customer Sentiment**, depending on your use case.
de: Wenn Sie diese Funktion aktivieren, sind **Anliegen des Kunden** und **Zusammenfassung der Konversation** standardmäßig aktiviert. Je nach Anwendungsfall können Sie **Offene Fragen**, **Anstehende Ereignisse** und **Stimmung des Kunden** aktivieren.

source: Enabling the ticket summary feature triggers a request to the configured AI service at the configured action (see below). After the summary is generated, agents are notified by an indicator on the summary sidebar tab.
de: Die Aktivierung der Funktion Ticket-Zusammenfassung löst zu einem definierten Zeitpunkt (siehe unten) eine Anfrage an den konfigurierten KI-Dienst aus. Nachdem die Zusammenfassung erstellt wurde, werden die Agenten durch einen Indikator auf dem Seitenleisten-Tab benachrichtigt.

source: Decide when the summary is generated via **Generation** dropdown. It is generated when the ticket got updated and an agent either opens the ticket or opens the summary sidebar tab of the ticket. The first mentioned option is more comfortable for agents, the latter saves computing resources if the AI summary is not always viewed. If you want to have a more granular control, you can override this setting for each group individually in the :doc:`group management </manage/groups/index>`.
de: Legen Sie im Dropdown-Menü **Generierung** fest, wann die Zusammenfassung erstellt wird. Sie wird erstellt, wenn das Ticket aktualisiert wurde und ein Agent entweder das Ticket öffnet oder den Seitenleisten-Tab der Ticketzusammenfassung öffnet. Die erstgenannte Option ist für Agenten komfortabler, die letztere spart Rechenressourcen, wenn die KI-Zusammenfassung nicht immer angezeigt wird. Wenn Sie eine feinere Einstellung wünschen, können Sie diese Einstellung für jede Gruppe einzeln in der :doc:`Gruppenverwaltung </manage/groups/index>` überschreiben.

source: If you use an own Ollama server as provider, make sure to have the ``llama3.2`` model available for this feature or specify an available model in the :ref:`provider configuration <ollama-provider>`.
de: Wenn Sie einen eigenen Ollama-Server als Anbieter verwenden, stellen Sie sicher, dass das Modell ``llama3.2`` für diese Funktion verfügbar ist oder geben Sie ein verfügbares Modell in der :ref:`Provider-Konfiguration <ollama-provider>` an.

source: Writing Assistant
de: Schreibassistent

source: Zammad's writing assistant tools allow agents to apply AI based changes to their text before saving or sending it. You can access the settings in Zammad's admin section under *AI > Writing Assistant*. Make sure to configure an :doc:`AI provider <provider>` before activating the feature. Otherwise, a warning message will tell you to do so. Activate the feature by turning on the switch.
de: Die Schreibassistent Werkzeuge von Zammad ermöglichen es den Agenten, KI-basierte Änderungen an ihrem Text vor dem Speichern oder Senden vorzunehmen. Sie können die Einstellungen im Admin-Bereich von Zammad unter *KI > Schreibassistent* aufrufen. Stellen Sie sicher, dass Sie einen :doc:`KI-Anbieter <provider>` konfigurieren, bevor Sie die Funktion aktivieren. Andernfalls werden Sie durch eine Warnmeldung darauf hingewiesen. Aktivieren Sie die Funktion, indem Sie den Schalter einschalten.

source: Screenshots shows writing assistant settings screen with available default tools
de: Screenshot zeigt die Einstellungen des Schreibassistenten mit den verfügbaren Standardwerkzeugen

source: Manage Tools
de: Verwalten von Werkzeugen
