Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: In some cases, your network structure (e.g. firewalls, proxies) may disconnect long web socket connections. This leads to select fields staying empty (e.g. owner selection *after* selecting your group) or fields not shown / hidden (e.g. when switching to or from pending states, the "pending till" field not showing / hiding).
de: In einigen Fällen kann es vorkommen, dass Ihr Netzwerk (z.B. Firewalls, Proxys) lange Web-Socket-Verbindungen unterbricht. Dies führt dazu, dass Auswahlfelder leer bleiben (z.B. Auswahl des Besitzers *nach* Gruppenauswahl) oder Felder nicht angezeigt/ausgeblendet werden (z.B. beim Wechsel in oder in den Status "Warten auf" wird das Feld "Warten bis" nicht angezeigt/ausgeblendet).
sr: У неким случајевима, ваша мрежна инфраструктура (нпр. firewall, прокси сервери) може да прекине дуге конекције путем web socket-а. Ово доводи до тога да одабрана поља остају празна (нпр. избор власника *након* одабира ваше групе) или поља која нису приказана/сакривена (нпр. када се прелази у или из стања на чекању, поље „На чекању до“ се не приказује/сакрива).

source: Please keep in mind that the Ajax fallback may cause serious pressure on your application server. If you have the choice stick to web sockets.
de: Bitte bedenken Sie, dass der Ajax-Fallback Ihren Server stark belasten kann. Wenn Sie die Wahl haben, bleiben Sie bei Web-Sockets.
sr: Имајте на уму да Ajax режим може изазвати озбиљан притисак на апликативни сервер. Ако имате избор, држите се web socket-а.

source: Default: ``no`` (inactive)
de: Voreinstellung: ``nein`` (inaktiv)
sr: Подразумевано: ``не`` (искључено)

source: Show calendar weeks in the picker of date/datetime fields
de: Kalenderwochen im Datums-Auswahlfeld anzeigen
sr: Приказ календарске недеље у бирачу поља датума и времена

source: With this setting you can instruct Zammad to provide week number display globally for all users. Calendar with week number display are usually used in business sectors and may not be relevant for everyone.
de: Mit dieser Einstellung können Sie Zammad die Kalenderwochen global für alle Benutzer in entsprechenden Auswahlfeldern anzeigen lassen. Kalender mit Wochennummern werden nur in manchen Geschäftsbereichen verwendet und sind möglicherweise nicht für jeden relevant.
sr: Са овим подешавањем можете наложити Zammad-у да обезбеди приказ броја недеље на глобалном нивоу за све кориснике. Календар са приказом броја седмица се обично користи у пословним секторима и можда није релевантан за све.

source: This setting affects *all areas* - you'll also see week numbers in the admin panel for e.g. triggers and macros.
de: Diese Einstellung wirkt sich auf *alle Bereiche* aus - Sie sehen die Wochennummern auch im Verwaltungsbereich für z.B. Trigger und Makros.
sr: Ово подешавање утиче на *све области* - такође ћете видети бројеве недеља у административном панелу за нпр. окидаче и макрои.

source: Default: ``no`` (not shown)
de: Voreinstellung: ``nein`` (nicht angezeigt)
sr: Подразумевано: ``не`` (није приказано)

source: Here's the difference:
de: Hier sehen Sie den Unterschied:
sr: Ево разлике:

source: Screenshot showing Zammad's date picker (in the default way)
de: Screenshot mit Datumsauswahl von Zammad (Standardeinstellung)
sr: Снимак екрана који приказује Zammad-ов бирач датума (на подразумевани начин)

source: Set to ``no``
de: Auf ``Nein`` gesetzt
sr: Постављено на ``не``

source: Screenshot showing Zammad's date picker with week numbers enabled
de: Screenshot zeigt die Datumsauswahl von Zammad mit aktivierten Kalenderwochen
sr: Снимак екрана који приказује Zammad-ов бирач датума са укљученим бројевима недеља

source: Set to ``yes``
de: Auf ``Ja`` gesetzt
sr: Постављено на ``да``

source: We split each tab within system settings into its own page:
de: Wir haben jeden Tab innerhalb der Systemeinstellungen in eine eigene Seite aufgeteilt:

source: Additionally, there are console based settings which aren't accessible from Zammad's UI. Although they are meant for special use cases, they could be helpful. You can find them in our :docs:`advanced customization section in the system documentation </admin/console/hidden-settings.html>`.
de: Darüber hinaus gibt es Einstellungen per Konsole, die über die Benutzeroberfläche von Zammad nicht zugänglich sind. Obwohl sie für spezielle Anwendungsfälle gedacht sind, können sie hilfreich sein. Sie finden sie im Abschnitt :docs:`Advanced Customization Settings </admin/console/hidden-settings.html>` in der Systemdokumentation.

source: Network
de: Netzwerk
sr: Мрежа

source: The proxy settings can only be saved after successfully testing the proxy connection.
de: Die Proxy-Einstellungen können erst nach erfolgreichem Testen der Proxy-Verbindung gespeichert werden.
sr: Подешавања проксија могу се сачувати само након успешног тестирања прокси конекције.

source: Proxy Address
de: Proxy-Adresse

source: Allows you to provide a proxy server if needed. This is relevant for network communication by Zammad.
de: Ermöglicht es Ihnen, bei Bedarf einen Proxyserver bereitzustellen. Dies ist für die Netzwerkkommunikation von Zammad relevant.
sr: Омогућава вам да подесите прокси сервер ако је потребно. Ово је релевантно за мрежну комуникацију од стране Zammad-а.

source: It **does not** affect the update process or Elasticsearch.
de: Sie **beeinflusst nicht** den Aktualisierungsprozess und Elasticsearch.
sr: Ово **не** утиче на процес освежавања или Elasticsearch.

source: Username for proxy connection
de: Benutzername für Verbindung zum Proxy
sr: Корисничко име за прокси конекцију

source: If your proxy server requires authentication, provide the username here.
de: Wenn Ihr Proxyserver eine Authentifizierung erfordert, geben Sie hier den Benutzernamen an.
sr: Ако ваш прокси сервер захтева аутентификацију, овде унесите корисничко име.

source: Password for proxy connection
de: Passwort für Verbindung zum Proxy
sr: Лозинка за прокси конекцију

source: If your proxy server requires authentication, provide the password here.
de: Wenn Ihr Proxyserver eine Authentifizierung erfordert, geben Sie hier das Passwort ein.
sr: Ако ваш прокси сервер захтева аутентификацију, овде унесите лозинку.

source: No proxy for the following hosts
de: Keinen Proxy für die folgenden Hosts verwenden
sr: Без проксија за следеће сервере

source: Exception list for hosts you can't or don't want to reach via proxy server.
de: Ausnahmeliste für Hosts, die Sie nicht über den Proxyserver erreichen können oder wollen.
sr: Листа изузетака за хостове којима не можете или не желите да приступите преко прокси сервера.

source: Default: ``localhost,127.0.0.0,::1``
de: Voreinstellung: ``localhost,127.0.0.0,::1``
sr: Подразумевано: ``localhost,127.0.0.0,::1``

source: Services
de: Dienste
sr: Услуге

source: Image Service
de: Bilder-Dienst
sr: Услуга за слике

source: Defines the backend for user and organization image lookups.
de: Definierte das Backend für Bildersuchen von Benutzern und Organisationen.
sr: Одређује позадински модул за тражење сличица корисника и организација.

source: Default: ``Zammad Image Service`` (active)
de: Standard: ``Zammad Image Service`` (aktiv)
sr: Подразумевано: ``Zammad сервис за слике`` (укључено)

source: Make sure your on premise installation has ``HTTPS`` access to ``images.zammad.com``.
de: Stellen Sie sicher, dass Ihre Installation vor Ort per ``HTTPS`` Zugriff auf ``images.zammad.com`` hat.
sr: Проверите да ваша локална инстанца има ``HTTPS`` приступ ``images.zammad.com``.

source: Geo Calendar Service
de: Geo-Kalender-Dienst
sr: Услуга географског календара

source: Defines the backend for geo calendar lookups. Used for initial calendar setup.
de: Definiert das Backend für Geo-Kalender-Lookups. Wird für die Kalendereinrichtung verwendet.
sr: Одређује позадински модул за географско тражење календара. Користи се за иницијалан одабир календара.

source: Default: ``Zammad GeoCalendar Service`` (active)
de: Standard: ``Zammad GeoCalendar Service`` (aktiv)
sr: Подразумевано: ``Zammad GeoCalendar сервис`` (укључено)

source: Make sure your on premise installation has ``HTTPS`` access to ``geo.zammad.com``.
de: Stellen Sie sicher, dass Ihre Installation vor Ort per ``HTTPS`` Zugriff auf ``geo.zammad.com`` hat.
sr: Проверите да ваша локална инстанца има ``HTTPS`` приступ ``geo.zammad.com``.

source: Defines the backend for geo IP lookups. Shows also location of an IP address if an IP address is shown.
de: Definiert das Backend für Geo-IP-Lookups. Zeigt auch den Standort einer IP-Adresse an, wenn eine IP-Adresse angezeigt wird.
sr: Дефинише позадински модул за географске IP упите. Приказује и локацију IP адресе ако је IP адреса приказана.

source: Default: ``Zammad GeoIP Service`` (active)
de: Voreinstellung: ``Zammad GeoIP Service`` (aktiv)
sr: Подразумевано: ``Zammad GeoIP сервис`` (укључено)

source: Geo Location Service
de: Geo-Lokalisierungs-Service
sr: Услуга географске локације

source: Defines the backend for geo location lookups to store geo locations for addresses.
de: Definiert das Backend für Geo-Standortabfragen, um Geo-Standorte für IP-Adressen zu speichern.
sr: Одређује позадински модул за географско тражење локација ради чувања географских локација адреса.

source: Default: ``OpenStreetMap (ODbL 1.0, http://osm.org/copyright)`` (active)
de: Voreinstellung: ``OpenStreetMap (ODbL 1.0, http://osm.org/copyright)`` (aktiv)
sr: Подразумевано: ``OpenStreetMap (ODbL 1.0, http://osm.org/copyright)`` (укључено)

source: You can find a detailed privacy information on what we store for how long on our :docs:`Privacy Appendix </appendix/privacy.html>` inside of our System Documentation.
de: Detaillierte Informationen zum Datenschutz, was wir wie lange speichern, finden Sie in unserem :docs:`Datenschutzhinweisen </appendix/privacy.html>` in unserer Systemdokumentation.
sr: Детаљне информације о приватности података и о томе шта чувамо и колико дуго можете пронаћи у нашем :docs:`додатку о приватности </appendix/privacy.html>` унутар наше системске документације.

source: Storage
de: Speicher
sr: Складиштење

source: Here you can define where Zammad stores attachments for tickets and the knowledge base. By default, Zammad writes to the **Database** - you can switch to **Filesystem** or **Simple Storage (S3)** at any time. In this case, please have a look on the following instructions.
de: Hier können Sie festlegen, wo Zammad Anhänge für Tickets und die Knowledge Base speichert. Standardmäßig speichert Zammad diese in der **Datenbank** - Sie können jederzeit auf **Dateisystem** oder **Simple Storage (S3)** umschalten. In diesem Fall schauen Sie sich bitte die folgende Anleitung an.

source: If you have a busy Zammad instance, we strongly encourage you to use filesystem storage instead of **Database**. This improves the system performance (decreases database load and and size).
de: Wenn Sie eine ausgelastete Zammad-Instanz haben, empfehlen wir Ihnen dringend, **Dateisystem** als Speichermethode anstelle von **Datenbank** zu verwenden. Dies verbessert die Systemleistung (verringert die Datenbanklast und -größe).

source: Database
de: Datenbank
sr: База података

source: This is the default storage method. The attachments are stored directly in the database. If your Zammad instance grows, we recommend one of the other methods to maintain performance.
de: Dies ist die Standard-Speichermethode. Die Anhänge werden direkt in der Datenbank gespeichert. Wenn Ihre Zammad-Instanz wächst, empfehlen wir eine der anderen Methoden, um keine Einschränkungen bzgl. Leistung zu bekommen.
sr: Ово је подразумевани метод складиштења. Прилоги се чувају директно у бази података. Ако ваша Zammad инстанца расте, препоручујемо прелазак на други метод да бисте очували перформансе.

source: Filesystem
de: Dateisystem
sr: Систем датотека

source: This storage method is recommended for all Zammad instances, especially for those with a higher load. If you choose filesystem, your files are written to ``/opt/zammad/storage/``.
de: Diese Speichermethode wird für alle Zammad-Instanzen empfohlen, insbesondere für solche mit einer höheren Last. Wenn Sie Dateisystem wählen, werden Ihre Dateien nach ``/opt/zammad/storage/`` geschrieben.
sr: Овај метод складиштења је препоручен за све Zammad инстанце, поготову за оне са већим оптерећењем. Ако сте изабрали метод датотека, ваше датотеке се снимају у ``/opt/zammad/storage/``.

source: Moving attachments from **Database** to **Filesystem** can be run during production use. However, you should consider your framework conditions (e.g. bandwidth, system load in production) to define the right moment.
de: Das Verschieben von Anhängen aus der **Datenbank** in das **Dateisystem** kann während des Betriebs von Zammad durchgeführt werden. Sie sollten jedoch Ihre Rahmenbedingungen (z.B. Bandbreite, Systemlast im Produktivbetrieb) berücksichtigen, um den richtigen Zeitpunkt zu bestimmen.

source: **You noticed slow updates of Zammad?**
de: **Haben Sie langsame Aktualisierungen von Zammad festgestellt?**
sr: **Приметили сте спор одзив у Zammad-у?**

source: While Zammad is being updated, it enforces a recursive "change owner" (chown) for this directory. For instances with many files this can be time consuming. To mitigate that, you can move your files and create a symlink in ``/opt/zammad/storage/`` to the new directory. Of course you have to make sure that the permissions are always correct.
de: Während Zammad aktualisiert wird, wird das ganze Verzeichnis rekursiv per "change owner" (chown) aktualisiert. Für Instanzen mit vielen Dateien kann dies sehr zeitaufwendig sein. Um das zu vermeiden, können Sie Ihre Dateien verschieben und eine symbolische Verlinkung (Symlink) in ``/opt/zammad/storage/`` auf das neue Verzeichnis erstellen. Natürlich müssen Sie dann dafür sorgen, dass die Berechtigungen immer korrekt sind.

source: To use the Simple Storage (S3), you have to provide some settings, which can't be accessed in the UI (see instructions below).
de: Um Simple Storage (S3) zu nutzen, müssen Sie einige Einstellungen vornehmen, die nicht über die Benutzeroberfläche zugänglich sind (siehe Anleitung unten).
sr: Да бисте користили Simple Storage (S3) морате обезбедити нека подешавања, којима не можете приступити путем корисничког интерфејса (погледајте упутства испод).

source: ⚠️ Please note that the current implementation is in its early stages and can be modified in the future.
de: ⚠️ Bitte beachten Sie, dass sich die derzeitige Umsetzung noch im Anfangsstadium befindet und sich in Zukunft Änderungen ergeben können.
sr: ⚠️ Упозоравамо вас да је тренутна имплементација у раном стадијуму и да може бити промењена у будућности.

source: The prerequisite is to have access to a S3-compatible storage and to have all necessary parameters available (which depends on your storage provider; if in doubt, please ask there for help).
de: Voraussetzung ist, dass Sie Zugang zu einem S3-kompatiblen Speicher haben und alle notwendigen Parameter vorliegen (das hängt von Ihrem Speicheranbieter ab; im Zweifelsfall fragen Sie bitte dort nach).
sr: Услов је да имате приступ S3 компатибилном складишту и да имате доступне све захтеване параметере (који зависе од вашег провајдера складишта; ако нисте сигурни, замолите их за помоћ).

source: Steps to configure S3:
de: Schritte zur Konfiguration von S3:
sr: Кораци за подешавање S3:

source: Copy ``config/zammad/storage.yml.dist`` to ``config/zammad/storage.yml``
de: Kopieren Sie ``config/zammad/storage.yml.dist`` nach ``config/zammad/storage.yml``
sr: Ископирајте ``config/zammad/storage.yml.dist`` у ``config/zammad/storage.yml``

source: Edit the copied file in one of the following ways:
de: Bearbeiten Sie die kopierte Datei auf eine der folgenden Arten:
sr: Измените копирану датотеку на један од следећих начина:

source: Either provide your S3 configuration with one attribute per line like in the upper area of the file
de: Entweder Sie erstellen Ihre S3-Konfiguration mit einem Attribut pro Zeile wie im oberen Bereich der Datei
sr: Или обезбедите вашу S3 конфигурацију са једним атрибутом по линији на начин како је то урађено на почетку датотеке

source: Or provide your S3 configuration as an URL (which you can find at the end of the file). Note: you can also provide this URL as environment variable (:docs:`see system documentation </appendix/configure-env-vars.html#storage-options>`) without using this yml-file.
de: Oder Sie geben Ihre S3-Konfiguration als URL an (die Sie am Ende der Datei finden). Hinweis: Sie können diese URL auch als Umgebungsvariable angeben (:docs:`siehe System Documentation </appendix/configure-env-vars.html#storage-options>`) , ohne diese yml-Datei zu verwenden.
sr: Или обезбедите вашу S3 конфигурацију као URL адресу (чији пример можете наћи при крају датотеке). Напомена: такође можете обезбедити ову URL адресу као променљиву окружења (:docs:`погледајте системску документацију </appendix/configure-env-vars.html#storage-options>`) без коришћења ове YML датотеке.

source: We recommend the deletion of the not used configuration style to avoid inconsistencies.
de: Wir empfehlen die Löschung der nicht verwendeten Konfiguration, um Inkonsistenzen zu vermeiden.
sr: Предлажемо брисање свих конфигурација које не користите да бисте избегли недоследности.

source: Restart Zammad so the config file / environment variable is loaded
de: Zammad neu starten, damit die Konfigurationsdatei / Umgebungsvariable geladen wird
sr: Рестартујте Zammad ради поновног учитавања конфигурационе датотеке / променљиве окружења

source: Set the "Storage Method" in Zammad to **Simple Storage (S3)** in Settings > System > Storage and click on "Submit". After that, Zammad checks your configuration and the connection to the service and will raise an error message if something is wrong.
de: Setzen Sie die "Speichermethode" in Zammad auf **Simple Storage (S3)** in Einstellungen > System > Speicher und klicken Sie auf "Übermitteln". Danach überprüft Zammad Ihre Konfiguration und die Verbindung zum Dienst und gibt eine Fehlermeldung aus, wenn etwas nicht stimmt.

source: A very simple storage configuration could look like this:
de: Eine sehr einfache Speicherkonfiguration könnte wie folgt aussehen:
sr: Врло једноставна конфигурација складишта би могла личити на следеће:

source: If you use a different provider than AWS (e.g. Backblaze) and you observe issues, try to add the ``request_checksum_calculation`` and ``response_checksum_validation`` parameters as you can see in the example below:
de: Wenn Sie einen anderen Anbieter als AWS (z.B. Backblaze) verwenden und Probleme beobachten, versuchen Sie, die Parameter ``request_checksum_calculation`` und ``response_checksum_validation`` hinzuzufügen, wie im folgenden Beispiel zu sehen:
sr: Уколико користите другог провајдера (нпр. Backblaze) и приметите проблеме, додајте ``request_checksum_calculation`` и ``response_checksum_validation`` параметре као у примеру испод:

source: Before setting the storage method to ``Simple Storage (S3)`` (step 4), please make sure to have a working setup.
de: Bevor Sie die Speichermethode auf ``Simple Storage (S3)`` einstellen (Schritt 4), stellen Sie bitte sicher, dass Sie ein funktionierendes Setup haben.
sr: Пре постављања метода складиштења на ``Simple Storage (S3)`` (корак 4), молимо проверите да ли ваш сервис функционише.

source: You can verify this by running ``rails r 'Rails.logger = Logger.new(STDOUT); pp Store::Provider::S3.ping?'`` in your Zammad directory. If everything is fine, you should see ``true``, else you should see ``false`` and a simple error message.
de: Sie können dies überprüfen, indem Sie ``rails r 'Rails.logger = Logger.new(STDOUT); pp Store::Provider::S3.ping?'`` in Ihrem Zammad Verzeichnis ausführen. Wenn alles in Ordnung ist, wird ein ``true`` ausgegeben, ansonsten wird ``false`` und eine einfache Fehlermeldung ausgegeben.
sr: Ово можете проверити извршавањем команде ``rails r ‘Rails.logger = Logger.new(STDOUT); pp Store::Provider::S3.ping?’`` у вашем Zammad директоријуму. Уколико је све у реду, требало би да видите ``true``, у супротном биће приказано ``false` са кратком поруком о грешци.

source: If you installed Zammad through a package manager (rather than from source), replace ``rails r`` with ``zammad run rails r`` above. To learn more, see :docs:`Administration via Console </admin/console.html>`.
de: Sofern Sie Zammad über einen Paketmanager (keine Source-Installation) installiert haben, ersetzen Sie ``rails r`` mit ``zammad run rails r``. Für weitere Information siehe :docs:`Administration via Konsole </admin/console.html>`.
sr: Ако сте инсталирали Zammad путем менаџера пакета (а не преко изворне архиве), замените ``rails r`` са ``zammad run rails r`` изнад. За више детаља, погледајте :docs:`администрацију путем конзоле </admin/console.html>`.

source: Here you can adjust general ticket settings. Additional ones for the ticket composer interface can be found in the :doc:`/misc/composer`.
de: Hier können Sie allgemeine Einstellungen für Tickets vornehmen. Zusätzliche Einstellungen finden Sie im :doc:`/misc/composer`.
sr: Овде можете подесити општа подешавања тикета. Додатна подешавања за интерфејс уредника текста могу се наћи у :doc:`/misc/composer`.

source: The identifier for a ticket; *e.g.,* Ticket#, Call#, MyTicket#.
de: Die Bezeichnung für ein Ticket; *z.B.* Ticket#, Anruf#, MeinTicket#.
sr: Идентификатор тикета, нпр. Ticket#, Call#, MyTicket#.

source: Default: ``Ticket#``
de: Standard: ``Ticket#``
sr: Подразумевано: ``Ticket#``

source: If you change the ticket hook on a system with production data, you have to :docs:`rebuild the Elasticsearch search index </install/elasticsearch.html#es-rebuild-searchindex>`.
de: Wenn Sie den Ticket-Hook auf einem Produktivsystem ändern, müssen Sie den :doc:`Elasticsearch-Suchindex neu erstellen </install/elasticsearch.html#es-rebuild-searchindex>` .
sr: Уколико промените прикључак тикета на систему у продукцији, мораћете да :docs:`обновите Elasticsearch индекс </install/elasticsearch.html#es-rebuild-searchindex>`.

source: With this setting, you can decide if the ticket hook/number should be included in the title and on which side it is inserted.
de: Mit dieser Einstellung können Sie festlegen, ob der Ticket-Hook/die Ticket-Nummer im Titel erscheinen und auf welcher Seite es eingefügt werden soll.
sr: Са овим подешавањем можете одлучиту да ли ће прикључак/број тикета бити укључен у наслову и са које стране.

source: *Right*
de: *Rechts*
sr: *десно*

source: This setting will add the ticket reference on the right site of the subject.
de: Mit dieser Einstellung wird die Ticketreferenz auf der rechten Seite des Betreffs hinzugefügt.
sr: Ово подешавање ће додати референцу тикета на десној страни предмета.

source: Example: ``Some Subject [Ticket#12345]``
de: Beispiel: ``Ein Betreff [Ticket#12345]``
sr: Пример: ``Неки предмет [Ticket#12345]``

source: *Left*
de: *Links*
sr: *лево*

source: This setting will add the ticket reference on the left site of the subject.
de: Mit dieser Einstellung wird die Ticketreferenz auf der linken Seite des Betreffs hinzugefügt.
sr: Ово подешавање ће додати референцу тикета на десној страни предмета.

source: Example: ``[Ticket#12345] Some Subject``
de: Beispiel: ``[Ticket#12345] Ein Betreff``
sr: Пример: ``[Ticket#12345] Неки предмет``

source: *None*
de: *Keine*
sr: *празно*

source: This will completely remove ticket references from the subject.
de: Dies entfernt vollständige Ticket-Referenzen aus dem Betreff.
sr: Ово ће у потпуности уклонити референце тикета из предмета.
