Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: This list previews some objects that your conditions are matching and shows a total of how many objects are being matched. Use this to double-check the entered conditions.
de: Diese Liste zeigt eine Vorschau der Objekte, auf die Ihre Bedingungen zutreffen, und gibt an, wie viele Objekte insgesamt betroffen sind. Nutzen Sie dies, um die Bedingungen zu überprüfen.
sr: Ова листа приказује неке објекте које се подударају са вашим условима и приказује укупан број објеката које се подударају. Искористите је да још једном проверите унете услове.

source: Please be aware that the preview and displayed number is just based on the currently selected condition. It doesn't necessarily represent the objects for execution at the defined time.
de: Bitte beachten Sie, dass die Vorschau und die angezeigte Anzahl nur auf der aktuell ausgewählten Bedingung basieren. Sie zeigt nicht zwingend die Objekte, die zum definierten Zeitpunkt bearbeitet werden sollen.
sr: Обратите пажњу да су листа приказа и број објеката базирани на тренутно одабраним условима. Не мора да значи да ће приказати објекте на којима ће се извршити планер у одговарајуће време.

source: Execute changes on objects
de: Führt folgende Änderungen an Objekten durch
sr: Изврши измене на објектима

source: Determine the changes to be made to the object. The possible changes depend on the selected object context. Be aware that a related object context may not be available (e.g. to perform ticket actions from a user context based scheduler).
de: Bestimmen Sie die Änderungen, die an dem Objekt vorgenommen werden sollen. Die möglichen Änderungen hängen vom gewählten Objektkontext ab. Beachten Sie, dass verwandte Objekte möglicherweise nicht verfügbar sind (z.B. zur Durchführung von Ticket-Aktionen aus einer Benutzer-Kontext-basierten Automatisierung).
sr: Одредите измене које треба извршити на објекту. Могуће измене зависе од контекста тренутно одабраног објекта. Обратите пажњу да контекст објекта можда није доступан (нпр. за извршавање радњи тикета у контексту планера корисника).

source: You can even trigger an :doc:`AI agent </ai/ai-agents>` run using scheduler jobs.
de: Sie können einen :doc:`KI-Agent </ai/ai-agents>` sogar mit Hilfe von Automatisierungsaufgaben aufrufen.

source: 🔥 Schedulers with *Action: Delete immediately* and *Action: Add a data privacy deletion task* are dangerous and should be used with care! If executed, the objects are deleted and no rollback is possible.
de: 🔥 Automatisierungen mit *Aktion: Sofort löschen* und *Aktion: Datenschutz-Löschaufgabe hinzufügen* sind gefährlich und sollten mit Vorsicht verwendet werden! Wenn sie ausgeführt werden, werden die Objekte gelöscht und es ist keine Wiederherstellung möglich.
sr: 🔥 Планери са *Радња: Избриши одмах* и *Радња: Закажи захтев за брисање приватних података* су опасни и треба их користити са опрезом! По извршавању, објекти ће бити обрисани и није могуће вратити их.

source: **Delete immediately** will delete the ticket at the runtime of the job *without any hint* in the UI.
de: **Sofort löschen** löscht das Ticket bei der Laufzeit des Auftrags *ohne Hinweis* in der Benutzeroberfläche.
sr: **Избриши одмах** ће обрисати тикет по извршавању планера *без било какве назнаке* у корисничком интерфејсу.

source: **Add a data privacy deletion task** will create a data privacy deletion task for the object at the runtime of the job. That means it is visible in Zammad's :doc:`data privacy panel </system/data-privacy>`.
de: **Datenschutz-Löschaufgabe hinzufügen** erstellt eine Datenschutz-Löschaufgabe für das Objekt bei der Laufzeit des Jobs. Das bedeutet, dass sie in Zammads :doc:`Datenschutzpanel </system/data-privacy>` sichtbar ist.
sr: **Закажи захтев за брисање приватних података** ће заказати захтев за брисање објекта по извршавању планера. Ово значи да ће бити видљив у Zammad-овом :doc:`панелу приватности података </system/data-privacy>`.

source: Disable notifications
de: Benachrichtigungen deaktivieren
sr: Искључи обавештења

source: By default, actions triggered by schedulers won't send notifications. You can override this here by setting this to *no*.
de: Standardmäßig werden bei Aktionen, die über die Automatisierung ausgelöst werden, keine Benachrichtigungen gesendet. Sie können dies hier außer Kraft setzen, indem Sie *nein* einstellen.
sr: Подразумевано, радње које покрећу планери неће слати обавештења. Ово понашање можете преиначити овде тако што ћете овај атрибут поставити на *не*.

source: Locale
de: Sprache
sr: Језик

source: This can be activated with the switch labeled "Localization of execution changes".
de: Dies kann mit dem Schalter "Sprache für ausgeführte Aktionen" aktiviert werden.
sr: Ово можете укључити дугметом под називом „Локализација при извршавању радње”.

source: Set a desired language, in which the output of variables is translated into by using the ``t`` function. For more information, please have a look at the explanation in the :ref:`variables section <variable_localization>`.
de: Legen Sie eine gewünschte Sprache fest, in die die Ausgabe von Variablen mit Hilfe der Funktion ``t`` übersetzt werden soll. Für weitere Informationen sehen Sie sich bitte die Erklärung im Abschnitt :ref:`Variablen <variable_localization>` an.
sr: Подесите жељени језик који ће се користити приликом превода путем ``t``функције. За више информација, погледајте објашњење у :ref:`одељку о променљивама <variable_localization>`.

source: Timezone
de: Zeitzone
sr: Временска зона

source: Similar as for the "Locale" setting, you can define a time zone, which is applied to the output of time stamp variables. For more information, please have a look at the explanation in the :ref:`variables section <variable_localization>`.
de: Ähnlich wie bei der "Sprache"-Einstellung können Sie eine Zeitzone definieren, die auf die Ausgabe von Zeitstempel-Variablen angewendet wird. Für weitere Informationen schauen Sie sich bitte die Erklärung im Bereich :ref:`Variablen <variable_localization>` an.
sr: Слично подешавању „Језик”, можете одредити временску зону која ће бити коришћена за променљиве временских вредности. За више информација, погледајте објашњење у :ref:`одељку о променљивама <variable_localization>`.

source: You can use the note field to describe the purpose of the scheduler. This is only visible to other admins when they are editing the scheduler. It is *not* a way to add notes to objects.
de: Sie können das Notizfeld verwenden, um den Zweck der Automatisierung zu beschreiben. Dies ist nur für andere Administratoren sichtbar, wenn sie die Automatisierung bearbeiten. Es ist *keine* Möglichkeit, Notizen zu Objekten hinzuzufügen.
sr: Можете користити поље за напомене да опишете сврху планера. Ово је видљиво само другим администраторима када уређују планер. То *није* начин додавања напомена у објекте.

source: With this setting you can enable/disable the scheduler.
de: Mit dieser Einstellung können Sie die Automatisierung aktivieren/deaktivieren.
sr: Овим подешавањем можете укључити/искључити планер.

source: How Do SLAs Work
de: Wie funktionieren SLAs
sr: Како SLA уствари раде

source: You can define several independent SLAs, however, ensure to have no overlapping SLAs as their calculations may not work as you intended them originally.
de: Sie können mehrere unabhängige SLAs definieren. Achten Sie jedoch darauf, dass sich die SLAs nicht überschneiden. Andernfalls funktionieren diese möglicherweise nicht so, wie Sie es sich vorstellen.
sr: Можете дефинисати неколико независних SLA, међутим прво се уверите се да се не преклапају јер њихови прорачуни можда неће радити баш онако како сте првобитно намеравали.

source: Part of the configuration dialog for SLAs
de: Teil des Konfigurationsdialogs für SLAs
sr: Део дијалога подешавања за SLA

source: Updating existing SLA configurations *may* cause temporary performance issues depending on your instance size and affected tickets. You may want to perform those changes outside of your business hours.
de: Die Aktualisierung bestehender SLA-Konfigurationen *kann* abhängig von der Größe Ihrer Instanz und den betroffenen Tickets vorübergehende Leistungsprobleme verursachen. Möglicherweise sollten Sie diese Änderungen außerhalb Ihrer Geschäftszeiten durchführen.
sr: Ажурирање постојећих SLA конфигурација *може* изазвати привремене проблеме са перформансама у зависности од величине ваше инстанце и броја тикета на које утиче. Можда ћете желети да извршите те измене ван радног времена.

source: Communication type articles are not enough for your SLA? You can also configure Zammad to allow **public** notes as fulfillment for SLA requirements, :docs:`our console documentation </admin/console/working-on-ticket-articles.html#count-public-notes-toward-slas>` tells you how.
de: Artikel des Typs "Kommunikation" sind für Ihr SLA nicht ausreichend? Sie können Zammad auch so konfigurieren, dass es **öffentliche** Notizen als Erfüllung der SLA-Anforderungen zulässt; :docs:`unsere Konsolen Dokumentation </admin/console/working-on-ticket-articles.html#count-public-notes-toward-slas>` erklärt Ihnen, wie.
sr: Чланци типа комуникације нису довољни за ваш SLA? Такође можете да подесите Zammad да дозволи **јавне** напомене као испуњење захтева SLA, :docs:`наша конзолна документација</admin/console/working-on-ticket-articles.html#count-public-notes-toward-slas>` ће вам објаснити како.

source: Give your SLA a meaningful name to quickly see what or who is affected.
de: Geben Sie Ihrem SLA einen aussagekräftigen Namen, damit Sie schnell erkennen können, was oder wer betroffen ist.
sr: Дајте свом SLA смислени назив да брзо видите на шта или на кога утиче.

source: Ticket selector
de: Ticket-Auswahl
sr: Избор услова тикета

source: Specify the conditions on which tickets this SLA should apply to.
de: Geben Sie die Bedingungen an, für welche Tickets dieser SLA gelten soll.
sr: Наведите услове на које тикете треба да се примењује овај SLA.

source: In the preview you see the selection of the tickets and double check whether those are correct.
de: In der Vorschau sehen Sie die Auswahl der Tickets und können prüfen, ob die Eingrenzung korrekt ist.
sr: У приказу ће бити излистан избор тикета и још једном проверите да ли су исправни.

source: Calendar
de: Kalender
sr: Календар

source: Zammad calculates ticket escalations based on your business hours. It makes no sense to escalate tickets when you're not in.
de: Zammad berechnet die Eskalation von Tickets auf der Grundlage Ihrer Geschäftszeiten. Es macht wenig Sinn, Tickets zu eskalieren, wenn Sie nicht arbeiten.
sr: Zammad израчунава ескалације тикета на основу вашег радног времена. Нема смисла ескалирати тикете док не радите.

source: Choose the correct calendar here. If you haven't set your business hours yet, see :doc:`/manage/calendars` to learn more.
de: Wählen Sie hier den richtigen Kalender aus. Wenn Sie Ihre Geschäftszeiten noch nicht festgelegt haben, finden Sie weitere Informationen unter :doc:`/manage/calendars`.
sr: Изаберите одговарајући календар овде. Ако још увек нисте подесили радно време, погледајте :doc:`/manage/calendars` да бисте сазнали више.

source: SLA Times
de: SLA-Zeiten
sr: SLA времена

source: Define the escalation timings based on your working hours. Keep in mind that if you defined 8 hour business hours per day, a 16 hour escalation will take two business days.
de: Definieren Sie die Eskalationszeiten auf der Grundlage Ihrer Arbeitszeiten. Denken Sie daran, dass eine Eskalation, die 16 Stunden dauert, zwei Arbeitstage dauert, wenn Sie 8 Stunden Arbeitszeit pro Tag festgelegt haben.
sr: Одредите време ескалације на основу вашег радног времена. Имајте на уму да ако сте дефинисали радно време од 8 сати дневно, ескалација од 16 сати ће трајати два радна дана.

source: First Response
de: Erste Reaktion
sr: Први одзив

source: Time frame for the first response (external call, email). This time is calculated from the ticket creation.
de: Dauer für die erste Antwort (externer Anruf, E-Mail). Diese Zeit wird ab der Erstellung des Tickets berechnet.
sr: Временски оквир за први одговор (спољни позив, имејл). Ово време се рачуна од отварања тикета.

source: The start time *does not* reset if you're e.g. moving the ticket into new groups or different SLA calculations. That is because the creation time of the ticket does not change - keep this in mind.
de: Die Startzeit wird *nicht* zurückgesetzt, wenn Sie das Ticket z.B. in eine neue Gruppe verschieben oder andere SLAs Anwendung finden. Das liegt daran, dass sich die Erstellungszeit des Tickets nicht ändert.
sr: Време почетка се *не* поништава ако сте нпр. преместили тикет у нову групу или подесили различиту SLA калкулацију. То је зато што се време отварања тикета не мења - имајте то на уму.

source: Update Time
de: Aktualisierungszeit
sr: Време освежавања

source: Time frame for every following response (external call, email). This time either counts from ticket creation (if no first response is set) or *after* the first response was done.
de: Dauer für jede folgende Antwort (externer Anruf, E-Mail). Diese Zeit zählt entweder ab der Erstellung des Tickets (wenn keine erste Antwort eingestellt ist) oder *nach* der ersten Antwort.
sr: Временски оквир за сваки следећи одговор (спољни позив, имејл). Ово време се рачуна или од отварања тикета (ако није детектован први одговор) или *након* првог одговора.

source: between agent updates
de: zwischen Updates von Agenten
sr: између два одговора оператера

source: In this scenario your agent have to respond every ``n`` hours depending on your configuration. This causes Zammad to not care if your customer replied or not.
de: In diesem Szenario muss Ihr Agent je nach Konfiguration alle ``n`` Stunden antworten. Dadurch ist es Zammad egal, ob Ihr Kunde geantwortet hat oder nicht.
sr: У овом сценарију ваш оператер мора да одговори сваких ``n`` сати у зависности од ваших подешавања. Ово доводи до тога да Zammad не занима да ли је ваш клијент одговорио или не.

source: Be aware that this setting can be quite stressful for your agents!
de: Seien Sie sich bewusst, dass diese Einstellung für Ihre Agenten ziemlich stressig sein kann!
sr: Будите свесни да ово подешавање може бити мало стресно за ваше оператере!

source: for an agent to respond
de: für einen Agenten zu reagieren
sr: док оператер не одговори

source: From the moment your customer replied to the ticket, your agents have the configured time amount to respond until the ticket escalates.
de: Ab dem Zeitpunkt, zu dem Ihr Kunde auf das Ticket geantwortet hat, haben Ihre Agenten die konfigurierte Zeitspanne, um zu antworten, bis das Ticket eskaliert.
sr: Од тренутка када је ваш клијент одговорио на тикет, ваши оператери имају одређено време за одговор до ескалације тикета.

source: Solution Time
de: Lösungszeit
sr: Време решења

source: Time frame for solving the problem (setting the ticket to a closed state type).
de: Zeitrahmen für die Lösung des Problems (Versetzen des Tickets in einen geschlossenen Zustand).
sr: Временски оквир за решавање проблема (подешавање тикета на тип затвореног стања).

source: This escalation timing *does not* care about ticket responses. It's simply being calculated from the ticket creation.
de: Dieser Eskalationszeitpunkt bezieht sich *nicht* auf die Antworten auf ein Ticket. Er wird einfach ab dem Zeitpunkt der Ticket-Erstellung berechnet.
sr: Ово време ескалације *не* занимају одговори на тикет. Израчунава се од тренутка отварања тикета.

source: It is up to you if you set one, two or all three times. When the SLA time is reached, the ticket escalates.
de: Es stehe Ihnen frei, ob Sie eine, zwei oder alle drei Zeiten festlegen. Wenn eine SLA-Zeit erreicht ist, wird das Ticket eskaliert.
sr: На вама је да ли ћете поставити једно, два или сва три времена. Када се достигне SLA време, тикет ескалира.

source: *First response* and *Solution time* can only apply once. Update time applies until the ticket has been solved or the SLA no longer matches your criteria.
de: *Erste Antwort* und *Lösungszeit* können nur einmal angewandt werden. Die Aktualisierungszeit gilt, bis das Ticket gelöst wurde oder die Kriterien des SLA nicht mehr zutreffen.
sr: *Први одзив* и *Време решења* могу се применити само једном. Време освежавања важи све док се тикет не реши или док SLA више не одговара вашим критеријумима.

source: The only way to stop escalations in default installations is to set the ticket to either a pending reminder or pending close. **However**: as soon as the ticket is being set to open (e.g. by a customer responding) the ticket may instantly escalate depending on its age and your configuration.
de: Die einzige Möglichkeit, die Eskalation in Standardinstallationen zu stoppen, besteht darin, das Ticket entweder auf "warten auf Erinnerung" oder "warten auf Schließen" zu setzen. **Allerdings:** Sobald das Ticket auf "offen" gesetzt wird (z.B. durch die Antwort eines Kunden), kann das Ticket je nach Alter und Konfiguration sofort eskalieren.
sr: Једини начин да зауставите ескалације у подразумеваним инсталацијама је да поставите тикет да чека на подсетник или на затварање. **Међутим**: чим се тикет подеси да се отвори (нпр. због одговора клијента), тикет може тренутно да ескалира у зависности од његове старости и ваших подешавања.

source: Ticket escalations will notify all affected agents. This highly depends on their chosen notification settings (Profile). Escalated tickets can also be filtered for:
de: Ticket-Eskalationen werden alle betroffenen Agenten benachrichtigen. Dies hängt allerdings von den gewählten Benachrichtigungs-Einstellungen (Benutzerprofil) ab. Eskalierte Tickets können auch gefiltert werden:
sr: Ескалације тикета ће обавестити све погођене оператере. Ово у великој мери зависи од изабраних подешавања обавештења (профил). Ескалирани тикети се такође могу филтрирати за:

source: by searching
de: durch suchen
sr: претраживањем

source: Service Level Agreements, abbreviated SLAs, help you to meet specific response times for your customers' requests. This way you can define goals such as answering every inquiry within eight hours. If you are at risk of missing this target, Zammad will alert you.
de: Service Level Agreements (SLAs) helfen Ihnen, bestimmte Reaktionszeiten für die Anfragen Ihrer Kunden einzuhalten. So können Sie Ziele definieren, wie z.B. die Beantwortung jeder Anfrage innerhalb von acht Stunden. Wenn Sie Gefahr laufen, das Ziel zu verfehlen, wird Zammad Sie warnen.
sr: Споразуми о нивоу услуге, скраћено SLA, помажу вам да испуните одређена времена одзива на захтеве ваших клијената. На овај начин можете дефинисати циљеве као што је одговор на сваки упит у року од осам сати. Ако сте у опасности да промашите ову мету, Zammad ће вас упозорити.

source: Screenshot showing SLA management with configured SLA levels
de: Screenshot der SLA-Verwaltung mit konfigurierten SLA-Stufen
sr: Снимак екрана који приказује управљање SLA са подешеним нивоима SLA

source: Agents will be notified via several, optional ways. You can provide overviews for escalated or soon to escalate tickets to help you agents. Also, agents can check the current applying SLA timings of tickets at any time.
de: Die Agenten werden auf verschiedene Weise benachrichtigt. Sie können Übersichten für eskalierte oder kurz vor der Eskalation stehende Tickets bereitstellen, um Ihre Agenten zu unterstützen. Außerdem können die Agenten jederzeit die aktuell geltenden SLA-Zeiten von Tickets überprüfen.
sr: Оператери ће бити обавештени на неколико, опционих начина. Можете да обезедите прегледе за ескалиране или ускоро ескалиране тикете да бисте помогли својим оператерима. Такође, оператери могу у било ком тренутку да провере тренутнo применљиве SLA времена тикета.

source: Online notifications
de: Online-Benachrichtigungen
sr: Обавештења

source: Zammad will warn agents roughly 15 minute before escalation and when the ticket finally escalates. This depends on the notification configuration of your agent.
de: Zammad warnt Agenten etwa 15 Minuten vor der Eskalation und wenn das Ticket schließlich eskaliert. Dies hängt von den Benachrichtigungs-Einstellungen (Benutzerprofil) Ihrer Agenten ab.
sr: Zammad ће упозорити оператере отприлике 15 минута пре ескалације и када тикет коначно ескалира. Ово зависи од подешавања обавештења ваших оператера.

source: Screenshot showing two notifications: One upcoming escalation and one escalated ticket
de: Screenshot mit zwei Benachrichtigungen: Eine bevorstehende Eskalation und ein eskaliertes Ticket
sr: Снимак екрана који приказује два обавештења: једно предстојеће ескалирање и један ескалиран тикет

source: Email notifications
de: Email-Benachrichtigungen
sr: Имејл обавештења

source: Email notification for a ticket that's going to escalate.
de: E-Mail-Benachrichtigung für ein Ticket, das eskalieren wird.
sr: Имејл обавештење за тикет који ће ескалирати.

source: Notification by mail that a ticket is going to escalate.
de: Benachrichtigung per E-Mail, dass ein Ticket eskalieren wird.
sr: Имејл обавештење да ће тикет ескалирати.

source: Email notification for a ticket that escalated.
de: E-Mail-Benachrichtigung für ein Ticket, das eskaliert ist.
sr: Имејл обавештење за тикет који је ескалирао.

source: Notification by mail that a ticket has escalated.
de: Benachrichtigung per E-Mail, dass ein Ticket eskaliert ist.
sr: Имејл обавештење да је тикет ескалирао.

source: You can configure :doc:`/manage/overviews` to allow your agents to filter for escalated tickets or those that are about to escalate. By default Zammad comes with an overview that will show all tickets that are either escalated or escalating within the next 10 minutes: ``Escalated Tickets``.
de: Sie können :doc:`/manage/overviews` so konfigurieren, dass Ihre Agenten nach eskalierten Tickets oder nach kurz vor der Eskalation stehenden Tickets filtern können. Standardmäßig bietet Zammad eine Übersicht, die alle Tickets anzeigt, die entweder eskaliert sind oder innerhalb der nächsten 10 Minuten eskalieren werden: ``Eskalierte Tickets``.
sr: Можете да подесите :doc:`прегледе </manage/overviews>` да дозволите вашим оператерима да филтрирају за ескалиране тикете или оне које ће ускоро ескалирати. Zammad подразумевано долази са прегледом који ће приказати све тикете који су или ескалирани или ескалираће у наредних 10 минута: ``Ескалирани тикети``.

source: If you have all/most of your tickets covered by SLAs you may consider changing the default sorting of existing overviews by escalation time, instead of creation time.
de: Wenn alle bzw. die meisten Ihrer Tickets durch SLAs abgedeckt sind, sollten Sie die Standardsortierung der vorhandenen Übersichten nach Eskalationszeitpunkt statt nach Erstellungszeitpunkt ändern.
sr: Ако имате све/већину ваших тикета покривене са SLA, можете размислити о промени подразумеваног сортирања постојећих прегледа према времену ескалације, уместо времену отварања.

source: Screenshot showing overview with escalated tickets
de: Screenshot der Übersicht mit eskalierten Tickets
sr: Снимак екрана који приказује преглед са ескалираним тикетима

source: SLA timings of a ticket
de: SLA-Zeiten eines Tickets
sr: SLA времена тикета

source: Ticket zooms provide a timestamp of the next escalation of a ticket. Agents can hover that timestamp and learn about all upcoming escalation stages.
de: Die Ticket-Ansicht zeigt einen Zeitstempel für die nächste Eskalation des Tickets an. Agenten können mit dem Mauszeiger über diesen Zeitstempel fahren und sich über alle anstehenden Eskalationsstufen informieren.
sr: Преглед тикета пружа временску ознаку следеће ескалације тикета. Оператери могу да пређу мишем преко те временске ознаке и сазнају о свим предстојећим фазама ескалације.
