Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: **Connect Zammad to your email provider** so that it can watch your inbox, send auto-replies, and more.
de: **Verbinden Sie Zammad mit Ihrem E-Mail-Konto**, damit es Ihren Posteingang überwachen kann, Eingangsbestätigungen verschicken kann und mehr.
sr: **Повежите Zammad са својим имејл провајдером** тако да може да гледа ваше пријемно сандуче, шаље аутоматске одговоре и још много тога.

source: (Self-hosted users may have already completed this step during new system setup.)
de: (Nutzer einer selbst gehosteten Instanz haben diese Schritte bereits während der Einrichtung gemacht.)
sr: (Корисници који сами хостују су можда већ обавили овај корак током подешавања новог система.)

source: :doc:`🗂️ Filters <filters>`
de: :doc:`🗂️ Filter <filters>`
sr: :doc:`🗂 Филтери <filters>`

source: **Make sure new tickets show up in the right place** with automated, if-this-then-that rules for all incoming email.
de: Richten Sie Automatisierungen mit Wenn-Dann-Regeln ein und stellen damit sicher, dass **neue Tickets an die richtige Stelle gelangen**.
sr: **Уверите се да се нови тикети појављују на правом месту** са аутоматским правилима ако-ово-онда-оно за сву долазну пошту.

source: :doc:`📜 Signatures <signatures>`
de: :doc:`📜 Signaturen <signatures>`
sr: :doc:`📜 Потписи <signatures>`

source: Customize signatures for all outgoing email.
de: Anpassung von Signaturen für alle ausgehenden E-Mails.
sr: Прилагодите потписе за сву одлазну пошту.

source: :doc:`⚙️ Settings <settings>`
de: :doc:`⚙️ Einstellungen <settings>`
sr: :doc:`⚙️ Подешавања <settings>`

source: Manage options like:
de: Passen Sie folgende Einstellungen an:
sr: Управљајте опцијама као што су:

source: set the “From:” address on system notifications
de: definieren Sie die "Von:" Adresse bei System-Benachrichtigungen
sr: подешавање „Од:“ адресе за системска обавештења

source: raise the limit on attachment sizes
de: erhöhen Sie das Größenlimit für Anhänge
sr: подизање ограничења величине прилога

source: modify subject-line prefixes (*e.g.,* use “AW:” instead of “RE:”)
de: passen Sie den Präfix im Betreff an (*z.B.* ""AW:" anstatt "RE:")
sr: измена префикса наслова (*нпр.* коришћење „AW:“ уместо „RE:“)

source: Want to **manually edit email subjects** or **always copy parent messages into your replies**?
de: **Wollen Sie den E-Mail-Betreff manuell anpassen** oder **immer die Ursprungsnachricht in den Antworten zitieren**?
sr: Желите да **ручно измените предмете порука** или **увек копирате оригиналне поруке у своје одговоре**?

source: Check the ✍️ :doc:`/misc/composer`.
de: Schauen Sie sich ✍️ :doc:`/misc/composer` an.
sr: Погледајте ✍️ :doc:`/misc/composer`.

source: :doc:`📇 Header based actions <email-headers>`
de: :doc:`📇 Header-basierte Aktionen <email-headers>`
sr: :doc:`📇 Радње заглавља <email-headers>`

source: Manipulate auto response behavior or incoming routing.
de: Passen Sie automatische Antworten an oder das Routing für eingehende Mails.
sr: Манипулишите понашањем аутоматског одговора или долазним рутирањем.

source: 🤓 This is a very advanced topic.
de: 🤓 Das ist ein sehr spezielles Thema.
sr: 🤓 Ово је веома напредна тема.

source: Extra Options for Self-Hosted Users
de: Extra Optionen für Nutzer einer selbst gehosteten Instanz
sr: Додатне опције за кориснике који сами хостују

source: If you're too cool for POP3/IMAP/SMTP...
de: Wenn Sie zu cool für POP3/IMAP/SMTP sind...
sr: Ако сте превише кул за POP3/IMAP/SMTP...

source: Settings
de: Einstellungen
sr: Подешавања

source: Settings section in email channel
de: Einstellungsbereich im E-Mail-Kanal
sr: Одељак подешавања у имејл каналу

source: Below you can find the available email-related settings. Most of these settings have default values which can be found here as well.
de: Unten finden Sie die aktuell verfügbaren E-Mail bezogenen Einstellungen. Die meisten dieser Einstellungen haben Standardeinstellung, die Sie ebenfalls hier finden.
sr: Испод можете пронаћи доступна подешавања везана за имејл. Већина ових подешавања има подразумеване вредности које се такође могу наћи овде.

source: Some email-related settings are ticket-based settings, which is why they can be found in the :doc:`/misc/composer`.
de: Einige der E-Mail-Einstellungen sind Ticket-basierte Einstellungen, weshalb Sie diese unter :doc:`/misc/composer` finden können.
sr: Нека подешавања која се односе на имејл су подешавања тикета, због чега се могу пронаћи у :doc:`/misc/composer`.

source: List of Settings
de: Liste der Einstellungen
sr: Листа подешавања

source: Notification Sender: Default value ``Notification Master <noreply@#{config.fqdn}>``
de: Benachrichtigungs-Absender: Standardwert ``Notification Master <noreply@#{config.fqdn}>``
sr: Пошиљалац обавештења: подразумевана вредност ``Notification Master <noreply@#{config.fqdn}>``

source: This is the default sender address for Zammad that affects all mails but those generated because of replies (like triggers or agent-based mails). Your customers normally will not see this address. This email address does not need to receive and can't be assigned to a group.
de: Das ist die standardmäßige Absenderadresse in Zammad, die für alle Benachrichtigungen verwendet wird (nicht für Antworten von Agenten oder Trigger-basierte Antworten). Ihre Kunden werden diese E-Mail-Adresse normalerweise nicht zu sehen bekommen. Sie muss außerdem nicht zwingend Mails empfangen können und kann keiner Gruppe zugewiesen werden.
sr: Ово је подразумевана адреса Zammad пошиљаоца која утиче на све поруке осим на одговоре тикета (као што су окидачи или поруке оператора). Ваши клијенти обично неће видети ову адресу. Ова имејл адреса не мора да прима и не може се доделити групи.

source: This address is relevant for agent notifications and password reset mails (also affects customers).
de: Diese E-Mail-Adresse wird für die Benachrichtigung von Agenten und zum Zurücksetzen des Passworts verwendet (betrifft hier ggf. auch Kunden).
sr: Ова адреса је релевантна за обавештења оператера и поруке за ресетовање лозинке (такође утиче на клијенте).

source: Additional follow-up detection: Default value ``Subject & References``
de: Erweiterte Nachfrage-Erkennung: Standardwert ``Betreff & Referenzen``
sr: Додатна детекција наставака: Подразумевана вредност ``Предмет & референце``

source: Adjust how Zammad checks if an incoming email is a follow-up or not. If you disable all checks, Zammad only checks if a matching ticket hook & number is present in the subject.
de: Stellen Sie ein, wie Zammad prüft, ob eine eingehende E-Mail eine Nachfrage ist oder nicht. Wenn Sie alle Prüfungen deaktivieren, prüft Zammad nur, ob ein passender Ticket-Hook und eine Ticket-Nummer im Betreff vorhanden sind.
sr: Подесите како Zammad врши проверу да ли је долазна имејл порука наставак или не. Уколико искључите све провере, Zammad ће само потражити одговарајући прикључак тикета и број у предмету.

source: Subject & References
de: Betreff & Referenzen
sr: Предмет & референце

source: Checks subject and message IDs of emails and searches for initial ticket articles with the same subject and message ID. When both are matching, it is considered as a follow-up.
de: Prüft die Betreff- und Nachrichten-IDs von E-Mails und sucht nach ersten Ticket-Artikeln mit demselben Betreff und derselben Nachrichten-ID. Wenn beide übereinstimmen, wird dies als Nachfrage betrachtet.
sr: Проверава предмет и идентификаторе имејл порукa и врши претрагу за почетне чланке тикета са идентичним предметом и индентификатором. Када се обе вредности подударају, порука се сматра наставком.

source: References
de: Referenzen
sr: Референце

source: Additionally checks if a message ID from email matches an existing article.
de: Prüft zusätzlich, ob eine ID aus einer E-Mail mit einem vorhandenen Artikel übereinstimmt.
sr: Додатно проверава да ли се идентификатор имејл поруке подудара са постојећим чланком.

source: Attachment
de: Anhang
sr: Прилог

source: Additionally checks attachments of emails. Useful if you often get emails forwarded as attachments and want to have them in existing tickets, if there is a reference included in an attached email.
de: Prüft zusätzlich Anhänge von E-Mails. Nützlich, wenn Sie häufig E-Mails als Anhang weitergeleitet bekommen und diese in bestehenden Tickets haben möchten, sofern eine Referenz in einer angehängten E-Mail enthalten ist.
sr: Додатно проверава прилоге имејл порука. Корисно је ако често примате прослеђене поруке као прилоге и желите их као посебне тикете, уколико је референца укључена у приложеној имејл поруци.

source: Additionally checks the body of emails. If there is a ticket identifier (ticket hook & number) in the body, it is considered as a follow-up. Useful if you want to add emails to existing tickets which are completely independent but talking about existing tickets including such a ticket reference.
de: Zusätzlich wird der Body von E-Mails überprüft. Wenn der Body eine Ticket-Kennung (Ticket-Hook und -Nummer) enthält, wird die E-Mail als Nachfrage betrachtet. Nützlich, wenn Sie E-Mails zu bestehenden Tickets hinzufügen möchten, die völlig unabhängig sind, sich aber auf bestehende Tickets beziehen und eine solche Ticket-Referenz enthalten.
sr: Додатно проверава садржај имејл порука. Уколико је идентификатор тикета (прикључак и број тикета) у садржају поруке, сматра се наставком. Корисно ако желите да придодате имејл поруке постојећим тикетима који су потпуно независни, али спомињу постојеће тикете путем њихових референци.

source: Please note that activating additional checks can lead to false detection. In production environments, you should change this setting very carefully and monitor the behavior afterwards.
de: Bitte beachten Sie, dass die Aktivierung zusätzlicher Prüfungen zu einer falschen Erkennung führen kann. In Produktionsumgebungen sollten Sie diese Einstellung sehr vorsichtig ändern und das Verhalten anschließend überwachen.
sr: Молимо обратите пажњу да укључивање додатних провера може да допринесе детекцији лажних наставака. У продукцији, будите врло пажљиви приликом укључивања овог подешавања и пратите понашање система.

source: Maximum Email Size: Default value ``10 MB``
de: Maximale E-Mail-Größe: Standardwert ``10 MB``
sr: Максимална величина имејл поруке: подразумевана вредност ``10 MB``

source: Defines the maximum allowed size of an email Zammad fetches. Zammad will not fetch larger emails (*including attachments!*).
de: Legt die maximal zulässige Größe einer E-Mail fest, die Zammad abruft. Zammad holt keine größeren E-Mails ab (*inklusive Anhängen!*).
sr: Одређује максималну дозвољену величину имејл поруке коју Zammad преузима. Zammad неће преузимати поруке које су веће од ове вредности (*укључујући и прилоге!*).

source: Send postmaster mail if mail too large: Default value ``yes (enabled)``
de: Senden einer Postmaster-E-Mail, wenn die E-Mail zu groß ist: Standardwert ``ja``
sr: Пошаљите postmaster поруку ако је порука превелика: подразумевана вредност „да (укључено)“

source: Option set to ``yes``
de: Option ist auf ``ja`` gesetzt
sr: Опција је подешена на ``да``

source: This setting will cause Zammad to automatically reply to emails that exceed the above email size limit with a postmaster style email. It tells the sender that you have not received their email.
de: Mit dieser Einstellung antwortet Zammad automatisch auf E-Mails, die die oben genannte Größenbeschränkung überschreiten, mit einer Postmaster-E-Mail. Damit wird dem Absender mitgeteilt, dass Sie seine E-Mail nicht erhalten haben.
sr: Ово подешавање ће проузроковати да Zammad аутоматски одговара на поруке које премашују горње ограничење величине имејла са поруком у postmaster стилу. Обавештава пошиљаоца да нисте примили његову пошту.

source: Nevertheless, Zammad will remove the email from the mailbox (if enabled).
de: Dennoch wird Zammad die E-Mail aus dem Postfach entfernen (falls aktiviert).
sr: У сваком случају, Zammad ће уклонити пошту из сандучета (ако је подешено).

source: Option set to ``no``
de: Option ist auf ``nein`` gestellt
sr: Опција је подешена на ``не``

source: If the option is set to no, Zammad will not reply to emails that are too big. Your customer will **not notice** that the email was too large! Instead, Zammad will use the monitoring endpoint to alert its administrators that it can't fetch a too large email.
de: Wenn die Option auf nein gesetzt ist, antwortet Zammad nicht auf E-Mails, die zu groß sind. Ihr Kunde wird **nicht bemerken**, dass die E-Mail zu groß war! Stattdessen wird Zammad im Monitoring melden, dass eine zu große E-Mail nicht abgerufen werden kann.
sr: Ако је опција подешена на не, Zammad неће одговарати на мејлове који су превелики. Ваш клијент **неће приметити** да је пошта превелика! Уместо тога, Zammad ће користити путању мониторинга да упозори своје администраторе да не може да преузме превелику пошту.

source: Learn more about :doc:`/system/monitoring`.
de: Erfahren Sie mehr über :doc:`/system/monitoring`.
sr: Сазнајте више у :doc:`/system/monitoring`.

source: Sender based on Reply-To header: Default value ``not set (-)``
de: Absender basierend auf Reply-To-Header: Standardwert ``nicht gesetzt (-)``
sr: Пошиљалац на основу Reply-To заглавља: подразумевана вредност ``није подешено (-)``

source: This setting decides how Zammad should recognize its customers from emails that contain a ``Reply-To`` header. This comes in useful if you're working with contact forms that need to use reply to headers.
de: Mit dieser Einstellung kann festgelegt werden, wie Zammad Ihre Kunden in einer E-Mail erkennt, die einen ``Reply-To`` Header angegeben haben. Das kann z.B. nützlich sein, wenn Sie mit einem Formular arbeiten, das ``Reply-To`` Header übergibt.
sr: Ово подешавање одређује како Zammad треба да препозна своје клијенте из порука који садрже ``Reply-To`` заглавље. Ово је корисно ако радите са контакт формама које морају да користе ово заглавље.

source: Option set to ``Take reply-to header as sender/from of email.``
de: Option gesetzt auf ``Nutze "Reply-To"-Feld als Absender einer E-Mail.``
sr: Опција је подешена на ``Преузми Reply-To заглавље као од/за поље имејл поруке.``

source: This setting will overwrite the initial ``FROM`` to the value used in ``Reply-To`` completely.
de: Diese Einstellung überschreibt den ``Von``-Wert mit dem , der in ``Reply-To`` steht.
sr: Ово подешавање ће потпуно преписати почетно ``From`` са вредношћу која се користи у ``Reply-To``.

source: Option set to ``-`` or ``Take Reply-To header as sender/from of email and use the real name of origin from.``
de: Option gesetzt auf ``-`` oder ``Nutze "Reply-To"-Feld als Absender einer E-Mail, aber den angezeigten Namen des "From"-Feldes.``
sr: Опција је подешена на ``-`` или ``Преузми Reply-To заглавље као од/за поље имејл поруке и користи право име изворног пошиљаоца.``

source: This setting will partially overwrite the initial ``FROM``. It uses the email address from the ``Reply-To`` header and uses the given name of the ``FROM`` header, if given.
de: Diese Einstellung überschreibt ``FROM`` teilweise. Es wird die E-Mail-Adresse des ``Reply-To``-Headers in Kombination mit den Namen aus dem ``FROM``-Header verwendet.
sr: Ово подешавање ће делимично преписати почетно ``From``. Користи имејл адресу поште из ``Reply-To`` заглавља и користи дати назив из ``From`` заглавља, ако је дат.

source: Customer selection based on sender and receiver list: Default value ``yes``
de: Kundenauswahl basierend auf Sender- und Empfängerliste. Standardwert: ``ja``
sr: Избор клијента на основу листе пошиљаоца и примаоца: подразумевана вредност ``да``

source: This option decides how Zammad should react if an agent sends an email to it.
de: Diese Einstellung legt fest, wie mit E-Mails umgegangen wird, die von Agenten an Zammad geschickt werden.
sr: Ова опција одлучује како Zammad треба да реагује ако му оператер пошаље имејл поруку.

source: The first user / email address from the recipient list will be used as the ticket customer.
de: Wenn der Sender ein Agent ist, wird der erste Benutzer in der Empfängerliste als Kunde eingestellt.
sr: Први корисник / имејл адреса у листи прималаца ће се користити као клијент тикета.

source: The agent will be set as ticket customer.
de: Der Agent wird als Kunde gesetzt.
sr: Оператер ће бити постављен као клијент тикета.

source: Block Notifications
de: Benachrichtigungen stoppen
sr: Блокирај обавештења

source: With the regex that can be defined here, you can ensure not to send any notifications to specific systems. By default this especially affects typical system addresses which can't receive emails anyway.
de: Mit dieser Regex kann definiert werden, an welche E-Mail-Adressen keine Benachrichtigungen geschickt werden. Standardmäßig sind hier bereits typische Adressen angelegt, die sowieso keine E-Mails empfangen können.
sr: Са регуларним изразом који се овде може дефинисати, можете осигурати да не шаљете никаква обавештења одређеним системима. Подразумевано ово посебно утиче на типичне системске адресе које ионако не могу да примају имејл поруке.

source: The default value is: ``(mailer-daemon|postmaster|abuse|root|noreply|noreply.+?|no-reply|no-reply.+?)@.+?``
de: Standardwert ist: ``(mailer-daemon|postmaster|abuse|root|noreply|noreply.+?|no-reply|no-reply.+?)@.+?``
sr: Подразумевана вредност је: ``(mailer-daemon|postmaster|abuse|root|noreply|noreply.+?|no-reply|no-reply.+?)@.+?``

source: Sender Format: Default value ``Agent Name + FromSeparator + System Address Display Name``
de: Absender-Format. Standardwert: ``Name des Agenten + Von-Trenner + Anzeigename der Systemadresse``
sr: Формат пошиљаоца: подразумевана вредност ``Назив оператера + сепаратор + назив системске адресе``

source: This configures the display name used in the ``FROM`` header of mails Zammad sends.
de: Diese Einstellung definiert den Anzeigename, der im ``Von``-Header von Zammad in ausgehenden E-Mails verwendet wird.
sr: Ово одређује назив за приказ који се користи у ``From`` заглављу порука које Zammad шаље.

source: This does not affect notification mails (to agents) and password reset mails. Emails that are not sent by agents (e.g. trigger-based notifications) will always fallback to ``System Address Display Name`` if needed.
de: Das betrifft nicht Mailbenachrichtigungen an Agenten und E-Mails zum Zurücksetzen des Passworts. E-Mails, welche nicht von Agenten verschickt werden (z.B. Trigger-basierte Benachrichtigungen), verwenden immer den ``Anzeigename System-Adresse``.
sr: Ово не утиче на имејл поруке обавештења (за оператере) и на поруке за ресетовање лозинке. Имејл поруке које не шаљу оператери (нпр. обавештења заснована на окидачу) увек ће се по потреби вратити на ``Назив системске адресе``.

source: Option set to ``Agent Name + FromSeparator + System Address Display Name``
de: Einstellung auf ``Name des Agenten + Von-Trenner + Anzeigename der Systemadresse`` gesetzt
sr: Опција подешена на ``Назив оператера + сепаратор + назив системске адресе``

source: This will cause Zammad to set the ``FROM`` header to agent name and the channel's display name, divided by a separator (configured below).
de: Zammad setzt damit den Namen des Agenten und den System-Namen in den ``Von`` Header, getrennt durch ein Trennzeichen (siehe folgende Konfiguration).
sr: Ово ће резултовати да Zammad постави ``From`` заглавље на име оператера и назив канала, подељено сепаратором (подешено испод).

source: Example: ``Christopher Miller via Chrispresso Inc.``.
de: Beispiel: ``Christopher Miller via Chrispresso Inc.``.
sr: Пример: ``Christopher Miller via Chrispresso Inc.``.

source: Option set to ``System Address Display Name``
de: Einstellung auf ``Anzeigename der Systemadresse``
sr: Опција је подешена на ``Назив системске адресе``

source: This will cause Zammad to always use the display name of the used channel in the ``FROM`` header.
de: Dadurch wird Zammad immer den Namen des E-Mail-Kanals der jeweiligen Gruppe in den ``Von`` Header eintragen.
sr: Ово ће резултовати да Zammad увек користи назив коришћеног канала у ``From`` заглављу.

source: Example: ``Chrispresso Inc.``
de: Beispiel: ``Chrispresso Inc.``
sr: Пример: ``Chrispresso Inc.``

source: Option set to ``Agent Name``
de: Einstellung auf ``Agenten-Name`` gesetzt
sr: Опција постављена на ``Назив оператера``

source: Zammad will use the agent's name which is very personal.
de: Zammad verwendet dadurch den Agentenname, was persönlicher ist.
sr: Zammad ће користити име оператера које је обично лично.

source: If you want to remove the ticket reference from the subject, you can learn more in :doc:`Settings > Ticket </settings/ticket>`.
de: Wenn Sie die Ticket-Referenz aus dem Betreff entfernen möchten, können Sie in :doc:`Einstellungen > Ticket </settings/ticket>` mehr erfahren.
sr: За уклањање референце тикета из предмета, сазнајте више у одељку :doc:`Подешавања > Тикет </settings/ticket>`.

source: Sender Format Separator: Default value ``via``
de: Sender Format Trenner. Standardwert: ``via``
sr: Сепаратор формата пошиљаоца: подразумевана вредност ``via``

source: This can be a string you can freely choose. It divides the agent's name and the display name of the channel whenever needed.
de: Das kann ein Text Ihrer Wahl sein. Dieser trennt den Namen des Agenten und den Anzeigenamen des Kanals einer Gruppe.
sr: Ово може бити текст слободног избора. Он дели име оператера и назив канала кад год је то потребно.

source: Ticket Subject Forward: Default value ``FWD``
de: Ticket Betreff bei Weiterleitung. Standardwert: ``FWD``
sr: Предмет прослеђених тикета: подразумевана вредност ``FWD``

source: The above string will be used on the subject if you forward an email from Zammad.
de: Die oben genannte Zeichenkette wird beim Weiterleiten einer E-Mail aus Zammad verwendet.
sr: Горњи текст ће се користити за предмет ако проследите имејл поруку из Zammad-а.

source: ``:`` will be automatically appended to the above string.
de: ``:`` wird der Zeichenkette automatisch angehängt.
sr: ``:`` ће аутоматски бити додато на горњи текст.

source: Ticket Subject Reply: Default value ``RE``
de: Ticket Betreff bei Antwort. Standardwert: ``RE``
sr: Предмет одговора тикета: подразумевана вредност ``RE``

source: The above string will be used on the subject if you reply to an email from Zammad.
de: Die oben genannte Zeichenkette wird beim Beantworten einer E-Mail aus Zammad verwendet.
sr: Горњи текст ће се користити за предмет ако одговорите имејл поруку у Zammad-у.

source: Ticket Subject Size: Default value ``110``
de: Ticket Betreff Größe. Standardwert: ``110``
sr: Дужина предмета тикета: подразумевана вредност ``110``

source: This setting enforces a maximum length for subjects when replying. If the subject you're using for your reply is too long, Zammad will automatically truncate the length and insert ``[...]`` to show it has shortened the subject.
de: Diese Einstellung erzwingt eine maximale Länge des Betreffs in E-Mails beim Antworten. Falls der Betreff zu lang ist, wird Zammad diesen automatisch abschneiden und ``[...]`` einfügen, um die Kürzung anzuzeigen.
sr: Ово подешавање намеће максималну дужину предмета приликом одговора. Ако је предмет који користите за свој одговор предугачак, Zammad ће аутоматски скратити дужину и уметнути ``[...]`` да би сигнализирао да је скратио предмет.

source: This does *not* limit ticket titles within the UI, just the subjects when replying to an email.
de: Das betrifft *nicht* den angezeigten Titel des Tickets in Zammad, sondern nur den Betreff in E-Mails.
sr: Ово *не* ограничава наслове тикета унутар корисничког интерфејса, већ само предмете приликом одговора на имејл поруке.

source: Example: ``RE: Test somew[...] [Ticket#123456]``
de: Beispiel: ``RE: Test irgendw[...] [Ticket#123456]``
sr: Пример: ``RE: Test somew[…] [Ticket#123456]``
