Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: :ref:`Is a custom incoming mail folder to blame? <email-experts-folder>`
de: :ref:`Ein Postfach-Unterordner für eingehende E-Mails? <email-experts-folder>`
sr: :ref:`Да ли је крив прилагођени фолдер долазне пошту? <email-experts-folder>`

source: Email Notification
de: Email-Benachrichtigung
sr: Имејл обавештење

source: The notification channel can only be configured on **self-hosted installations**.
de: Der Benachrichtigungs-Kanal kann nur in **selbst gehosteten Installationen** konfiguriert werden.
sr: Канал обавештења може да се подеси само на **инсталацијама које хостујете сами**.

source: For more information, see :doc:`/manage/trigger/system-notifications`.
de: Weitere Informationen finden Sie unter :doc:`/manage/trigger/system-notifications`.
sr: За више информација погледајте :doc:`/manage/trigger/system-notifications`.

source: System notifications are automated emails sent by Zammad for critical system events, such as account changes or SLA violations.
de: System-Benachrichtigungen sind automatisierte Emails, die Zammad für kritische Systemereignisse wie z.B. Accountänderungen oder SLA-Verletzungen versendet.
sr: Системска обавештења су аутоматизоване имејл поруке које Zammad шаље за критичне системске догађаје, као што су измене налога или кршења SLA.

source: Use the **Email Notification** panel to configure how Zammad dispatches these notifications.
de: Benutzen Sie die **E-Mail-Benachrichtigungs-Einstellungen**, um zu konfigurieren, wie Zammad diese Benachrichtigungen versendet.
sr: Користите панел **Имејл обавештење** да бисте подесили како Zammad шаље ова обавештења.

source: Screenshots shows email notification channel editing
de: Screenshot zeigt die Bearbeitung des E-Mail-Benachrichtigungskanals
sr: Снимци екрана који приказују уређивање канала имејл обавештења

source: The “From:” address on system notifications can be configured under :doc:`Channels > Email > Settings > Notification Sender <../settings>`.
de: Die "Von:" Adresse bei System-Benachrichtigungen kann unter :doc:`Channels > Email > Settings > Notification Sender <../settings>` konfiguriert werden.
sr: „Од:“ адреса системских обавештења се може подесити под :doc:`Канали > Имејл > Подешавања > Пошиљалац обавештења <../settings>`.

source: 🤔 **This looks familiar... Where have I seen it before?**
de: 🤔 **Das kommt mir bekannt vor... Wo habe ich das schon einmal gesehen?**
sr: 🤔 **Ово ми изгледа познато... Где сам то раније видео/ла?**

source: This configuration step was part of the Getting Started wizard:
de: Diese Einstellung war Teil des Einrichtungsassistenten:
sr: Овај корак конфигурације је био део чаробњака за почетак:

source: The getting started wizard asking how one wants to send out notifications
de: Der Einrichtungsassistent fragt, wie Sie Benachrichtigungen verschicken möchten
sr: Чаробњак за почетак који пита како желите да шаљете обавештења

source: Managing Accounts
de: Accounts verwalten
sr: Управљање налозима

source: Once an account has been added, use the accounts panel to edit its configuration.
de: Sobald ein Account hinzugefügt wurde können Sie den Konten-Dialog verwenden, um die Einstellungen anzupassen.
sr: Када је налог додат, користите панел налога да бисте изменили његову конфигурацију.

source: Mail Server Settings
de: Mail-Server-Einstellungen
sr: Подешавања сервера поште

source: Click **Edit** on inbound/outbound account details to change your server configuration.
de: Klicken Sie auf **Bearbeiten** bei "Eingehend"/"Ausgehend" in den Kontoeinstellungen, um die Serverkonfiguration zu konfigurieren.
sr: Кликните на **Измени** на детаљима долазног/одлазног налога да бисте променили конфигурацију сервера.

source: See :ref:`New Account Settings <email-new-account-experts>` for a detailed description of each option.
de: Siehe :ref:`Neues Konto einrichten <email-new-account-experts>` für eine detaillierte Beschreibung der einzelnen Optionen.
sr: Погледајте :ref:`Подешавања новог налога <email-new-account-experts>` за детаљан опис сваке опције.

source: Location of account details settings for existing accounts
de: Detaileinstellungen für existierende Konten
sr: Локација подешавања детаља налога за постојеће налоге

source: Destination Group
de: Ziel-Gruppe
sr: Одредишна група

source: Click on the group name to reassign the account.
de: Klicken Sie auf den Gruppennamen, um das Konto neu zuzuordnen.
sr: Кликните на назив групе да бисте доделили налог.

source: Location of "Destination Group" setting for existing accounts
de: Einstellungen der "Empfängergruppe" für existierende Konten
sr: Локација подешавања „Одредишна група“ за постојеће налоге

source: Only **active** groups will be displayed. Changing this setting will not reassign existing tickets to the new group.
de: Es werden nur **aktive** Gruppen angezeigt. Wenn Sie diese Einstellung ändern, werden vorhandene Tickets nicht neu zugewiesen.
sr: Само **активне** групе ће бити приказане. Измена овог подешавања неће преместити постојеће тикете у нову групу.

source: You can assign the related outgoing email address to the new group by choosing the option under **Destination group email address** or leave it as it is. To assign an outgoing email address to a group manually, have a look at the :doc:`group settings </manage/groups/settings>`.
de: Sie können die zugehörige ausgehende E-Mail-Adresse der neuen Gruppe zuordnen, indem Sie die Option unter **E-Mail-Adresse der Zielgruppe** wählen oder sie unverändert lassen. Um einer Gruppe manuell eine ausgehende E-Mail-Adresse zuzuweisen, sehen Sie sich die :doc:`Einstellungen für Gruppen </manage/groups/settings>` an.
sr: Можете доделити одговарајућу одлазну имејл адресу новој групи одабиром опције под **Имејл адреса одредишне групе** или да је оставите. За ручну доделу одлазне имејл адресе групи, погледајте :doc:`подешавања групе </manage/groups/settings>`.

source: Email Address
de: E-Mail-Adresse
sr: Имејл адреса

source: Use the **+ Add** or **Edit** buttons to set up secondary addresses on this account.
de: Benutzen Sie den **Bearbeiten** oder **Hinzufügen** Button, um dem Konto eine weitere Mailadresse hinzuzufügen.
sr: Користите дугмиће **+ Додај** или **Измени** да бисте подесили секундарне адресе овог налога.

source: See :doc:`secondary-addresses` for a detailed description of each option.
de: Siehe :doc:`secondary-addresses` für eine detaillierte Übersicht aller Optionen.
sr: Погледајте :doc:`secondary-addresses` за детаљан опис сваке опције.

source: Location of email address add/edit buttons
de: E-Mail-Adresse hinzufügen / bearbeiten
sr: Локација дугмића за додавање/измену имејл адресе

source: Enabled / Disabled
de: Aktivieren / Deaktivieren
sr: Укључено / искључено

source: Disabling an account temporarily prevents Zammad from importing its messages.
de: Wenn Sie ein Konto vorübergehend deaktivieren wird Zammad keine Nachrichten daraus importieren.
sr: Искључивање налога привремено спречава Zammad да увози поруке.

source: This may be necessary during scheduled maintenance or when migrating your installation to a new host.
de: Das ist bei geplanten Wartungsarbeiten sinnvoll oder wenn Sie Ihre Installation auf einen neuen Host migrieren.
sr: Ово може бити неопходно током планираног одржавања или приликом миграције ваше инсталације на нови сервер.

source: Disabling an account disables *outgoing* messages for it, as well.
de: Wenn Sie ein Konto deaktivieren, werden auch die *ausgehenden* Nachrichten für dieses Konto deaktiviert.
sr: Искључивање налога онемогућава и *одлазне* поруке за њега.

source: Delete
de: Löschen
sr: Избриши

source: Deleting an account removes its configuration from Zammad entirely.
de: Das Löschen eines Kontos löscht dessen gesamte Konfiguration in Zammad.
sr: Брисање налога у потпуности уклања његову конфигурацију из Zammad-а.

source: 🧹 **Additional Steps Required**
de: 🧹 **Zusätzliche Maßnahmen erforderlich**
sr: 🧹 **Неопходни додатни кораци**

source: When an email account is deleted, its :doc:`email aliases <secondary-addresses>` **remain in the system**. Be sure to reassign or delete them manually.
de: Wenn ein E-Mail-Account gelöscht wird, bleiben die E-Mail-Aliase :doc:`E-Mail-Alias <secondary-addresses>` **im System erhalten**. Bitte stellen Sie sich, diese einem Kanal zuzuweisen oder zu löschen.
sr: Када се имејл налог избрише, његови :doc:`имејл алиаси <secondary-addresses>` **остају у систему**. Обавезно их поново доделите или избришите ручно.

source: List of orphaned email addresses
de: Liste der nicht verwendeten E-Mail-Adressen
sr: Листа недодељених имејл адреса

source: Click on the address to assign it to another account, or click ✖ to delete it.
de: Klicken Sie auf die Adresse, um diese einem anderen Account zuzuweisen oder klicken Sie ✖, um sie zu löschen.
sr: Кликните на адресу да бисте је доделили другом налогу или кликните на ✖ да бисте је избрисали.

source: Groups need an assigned an address to send outgoing emails. If you delete a group's assigned address, agents belonging to that group won't be able to send emails until you assign it a new one.
de: Gruppen benötigen eine zugewiesene Adresse, um ausgehende E-Mails zu versenden. Wenn Sie die einer Gruppe zugewiesene Adresse löschen, können die zu dieser Gruppe gehörenden Agenten keine E-Mails senden, bis Sie ihnen eine neue Adresse zuweisen.
sr: Групама је потребна додељена адреса за слање одлазних имејл порука. Ако избришете додељену адресу групи, оператери који припадају тој групи неће моћи да шаљу имејл поруке док јој не доделите нову.

source: Secondary Addresses
de: Zusätzliche Adresse
sr: Секундарне адресе

source: Secondary addresses (also known as *aliases*) allow you to send emails with a different “From:” address than the one from the account.
de: Mit zusätzlichen E-Mail-Adressen (auch *Aliase* genannt) können Sie E-Mails mit einer vom Konto abweichenden "Von:" Adresse verschicken.
sr: Секундарне адресе (познате и као *алиаси*) вам омогућавају да шаљете имејл поруке са различитом „Од:“ адресом од оне на налогу.

source: You can add an additional email address by clicking the ``+ Add`` button in an existing account configuration. This opens a dialog where you can add your address:
de: Sie können eine zusätzliche E-Mail-Adresse hinzufügen, indem Sie in der Konfiguration eines bestehenden Kontos auf die Schaltfläche ``+ Hinzufügen`` klicken. Daraufhin öffnet sich ein Dialog, in dem Sie Ihre Adresse hinzufügen können:
sr: Можете додати додатну имејл адресу кликом на дугме ``+ Додај`` у постојећој конфигурацији налога. Ово ће отворити дијалог нове имејл адресе:

source: Screenshot shows adding a secondary address
de: Screenshot zeigt das Hinzufügen einer sekundären Adresse
sr: Снимак екрана који приказује додавање секундарне адресе

source: Add a secondary address and configure a group to start sending emails with it.
de: Fügen Sie eine sekundäre Adresse hinzu und konfigurieren Sie eine Gruppe, um den Versand von E-Mails mit dieser Adresse zu starten.
sr: Додајте секунтану адресу и подесите групу да може да шаље имејл поруке са ње.

source: **Do not abuse this feature.**
de: **Missbrauchen Sie diese Funktion nicht.**
sr: **Не злоупотребљавајте ову функцију.**

source: If you use aliases to impersonate other parties, your IP can get added to blacklists.
de: Wenn Sie Aliasse verwenden, um sich als andere Parteien auszugeben, kann Ihre IP in Sperrlisten aufgenommen werden.
sr: Ако користите секундарне адресе да бисте се лажно представљали, ваша IP адреса може бити стављена на црну листу нежељене поште.

source: Your email provider may also be set up to *receive incoming messages* for many addresses in the same mailbox. If this is the case, be sure to add your alternate inbox addresses here.
de: Ihr E-Mail-Anbieter unterstützt möglicherweise die Funktion, E-Mails für andere E-Mail-Adressen in einem Postfach zu sammeln. Sofern das der Fall und bei Ihnen eingerichtet ist, fügen Sie bitte die Adressen hier hinzu.
sr: Ваш имејл провајдер може такође бити подешен да *прима долазне поруке* за више адреса у истом поштанском сандучету. Ако је то случај, обавезно додајте своје алтернативне адресе пријемног сандучета овде.

source: Display Name
de: Anzeigename
sr: Назив за приказ

source: The alias address to send outgoing messages as.
de: Die Alias-Adresse, um ausgehende Mails darunter zu versenden.
sr: Алиас адреса за слање одлазних порука.

source: Channel
de: Kanal
sr: Канал

source: The email account to be used when sending outgoing messages from this alias.
de: Der verwendete Mailaccount, der beim Mailversand von diesem Alias verwendet wird.
sr: Имејл налог који ће се користити приликом слања одлазних порука са овог алиаса.

source: Optional. Only visible from this dialog, the REST API, and the Rails console.
de: Optional. Nur in diesem Dialog sowie der REST API und der Rails console sichtbar.
sr: Опционо. Видљиво само из овог дијалога, REST АПИ-ја и Rails конзоле.

source: Watch Your Inbox With Fetchmail
de: Rufen Sie Ihren Posteingang mit Fetchmail ab
sr: Мониторинг пријемног сандучета са Fetchmail-ом

source: Maybe you want to add emails via Fetchmail or Procmail to Zammad.
de: Sie können E-Mails mit Fetchmail oder Procmail in Zammad hinzufügen.
sr: Можда желите да додате имејл поруке путем Fetchmail-а или Procmail-а у Zammad.

source: To get this to work you need to pipe your emails to rails.
de: Um diese Funktion zu nutzen, müssen Sie Ihre Mails an rails weiterleiten.
sr: Да би ово функционисало, морате да проследите своје имејл поруке Rails-у.

source: If you installed Zammad through a package manager (rather than from source), replace ``rails r`` with ``zammad run rails r`` below. To learn more, see :docs:`Administration via Console </admin/console.html>`.
de: Sofern Sie Zammad über einen Paketmanager (keine Source-Installation) installiert haben, ersetzen Sie ``rails r`` mit ``zammad run rails r``. Für weitere Information siehe :docs:`Administration via Console </admin/console.html>`.
sr: Ако сте инсталирали Zammad преко менаџера пакета (а не као изворни код), замените ``rails r`` са ``zammad run rails r`` испод. Да бисте сазнали више, погледајте :docs:`администрација преко конзоле </admin/console.html>`.

source: **Command line**:
de: **Kommandozeile**:
sr: **Команда**:

source: **Create .fetchmailrc**:
de: **Erstellen von .fetchmailrc**:
sr: **Креирајте .fetchmailrc**:

source: **Edit .fetchmailrc**:
de: **Anpassung .fetchmailrc**:
sr: **Уредите .fetchmailrc**:

source: That's it. Emails now will be directly piped into Zammad.
de: Das war's. Mails werden nun direkt zu Zammad weitergeleitet.
sr: То је то. Имејл поруке ће се од сада директно прослеђивати у Zammad.

source: Using Procmail for Advanced Features Like Presorting
de: Verwenden Sie Procmail für erweiterte Funktionen wie Vorsortierung
sr: Коришћење Procmail-а за напредне функције као што је претходно сортирање

source: If you want to do some more with your emails, like presorting to a Zammad group or filtering spam, you can use Procmail.
de: Wenn Sie mit Ihren E-Mails mehr machen wollen, z.B. Vorsortierung oder Spam-Filterung, können Sie dafür Procmail verwenden.
sr: Ако желите да урадите нешто више са својим имејл порукама, као што је претходно сортирање у Zammad групу или филтрирање нежељене поште, можете да користите Procmail.

source: Fetchmail config looks slightly different.
de: Die Fetchmail-Konfiguration weicht ein wenig ab.
sr: Fetchmail конфигурација изгледа мало другачије.

source: **Create .procmailrc**:
de: **Erstellen von .procmailrc**:
sr: **Креирајте .procmailrc**:

source: **Edit .procmailrc**:
de: **Anpassung .procmailrc**::
sr: **Уредите .procmailrc**:

source: Dispatch Messages With Sendmail
de: Verschicken Sie E-Mails mit Sendmail
sr: Шаљите поруке помоћу Sendmail-а

source: If you try to configure **only** an outgoing email account (i.e. you don't want to set up an incoming IMAP/POP3 account at all), you will find that it's simply not possible via the email channel setup wizard. Instead, you will have to create it via the CLI.
de: Falls Sie **nur** ein Konto für ausgehende E-Mails konfigurieren wollen (d.h. Sie möchten überhaupt kein Konto für eingehende E-Mails (IMAP/POP3) einrichten), werden Sie feststellen, dass dies über den Assistenten zur Einrichtung des E-Mail-Kanals nicht möglich ist. Deshalb müssen Sie sowas über die Kommandozeile einrichten.
sr: Ако покушате да подесите **само** налог одлазне поште (нпр. не желите да подесите долазни IMAP/POP3 налог), открићете да то једноставно није могуће преко чаробњака за подешавање имејл канала. Уместо тога, мораћете да га креирате преко CLI.

source: To configure Zammad to use sendmail, run the following command (use rails r [...] if you installed Zammad from source):
de: Um Zammad für die Verwendung von sendmail zu konfigurieren, führen Sie den folgenden Befehl aus (verwenden Sie rails r [...], wenn Sie Zammad als Source-Installation installiert haben):
sr: Да бисте подесили Zammad да користи sendmail, покрените следећу команду (користите rails r [...] ако сте инсталирали Zammad преко изворног кода):

source: Now, you should see a new **Email Account** entry in the admin settings panel:
de: Nun sollten Sie einen neuen Eintrag unter **E-Mail-Konten** in den Admin-Einstellungen sehen:
sr: Сада би требало да видите нови унос **Имејл налог** у администраторском панелу за подешавања:

source: The new, outbound-only email channel appears in the admin settings email panel.
de: Der neue ausgehende E-Mail-Kanal erscheint in den Admin-Einstellungen.
sr: Нови имејл канал само за одлазну пошту појављује се у администраторском панелу имејл подешавања.

source: Use the **Add** button under the **Email Address** heading to add new email addresses to send from.
de: Verwenden Sie den **Hinzufügen** Button unter **E-Mail-Adresse**, um eine neue E-Mail-Adresse zum Versenden hinzuzufügen.
sr: Користите дугме **Додај** испод наслова **Имејл адреса** да бисте додали нове имејл адресе за слање.

source: Header Based Actions
de: Header basierte Aktionen
sr: Радње заглавља

source: With specific email headers, you can make Zammad perform different actions depending on the content of the headers. So, if you create a new email (e.g. from a form on your website) you can set these headers to perform actions or to hand over special information like custom attributes.
de: Mit bestimmten E-Mail-Headern können Sie Zammad dazu bringen, je nach Inhalt der Header unterschiedliche Aktionen auszuführen. Wenn Sie also eine neue E-Mail erstellen (z.B. über ein Formular auf Ihrer Website), können Sie diese Header so einstellen, dass sie Aktionen ausführen oder spezielle Informationen wie benutzerdefinierte Attribute übermitteln.
sr: Са одговарајућим имејл заглављима можете подесити Zammad да обавља различите радње на основу њихових садржаја. Уколико пошаљете нову имејл поруку (нпр. са форме на сајту) можете поставити заглавља да бисте покренули радње или доставили посебне информације као што су прилагођени атрибути.

source: **🛡 Trusted channels required 🛡**
de: **🛡 Vertrauenswürdige Kanäle notwendig 🛡**
sr: **🛡 Потребни су поуздани канали 🛡**

source: This feature is a potential risk with external communication and thus require channels being set to trusted explicitly. You can find instructions about how to set a channel to trusted at the end of this page.
de: Diese Funktion stellt ein potenzielles Risiko bei der externen Kommunikation dar und erfordert daher, dass Kanäle ausdrücklich als vertrauenswürdig eingestuft werden. Eine Anleitung, wie Sie einen Kanal als vertrauenswürdig einstufen können, finden Sie am Ende dieser Seite.
sr: Ова функција представља потенцијални ризик у вези екстерне комуникације и стога захтева да се канали изричито подесе на поуздане. При дну ове стране можете пронаћи упутства како да подесите канал као поуздан.

source: The header names listed below are examples and in our opinion the most relevant ones. However, you can adjust mostly all article or ticket attributes including custom ones if you know the attribute's exact name. Have a look :doc:`here </system/objects>` to find the attribute names.
de: Die unten aufgeführten Header-Namen sind Beispiele und unserer Meinung nach die wichtigsten. Sie können jedoch fast alle Artikel- oder Ticket-Attribute, einschließlich benutzerdefinierter Attribute, anpassen, wenn Sie den genauen Namen des Attributs kennen. Schauen Sie unter :doc:`hier </system/objects>` nach, um die Namen der Attribute zu finden.
sr: Називи заглавља у наставку су примери и по нашем мишљењу најрелевантнији. Међутим, можете прилагодити било који атрибут чланка или тикета (да, чак и прилагођене) ако знате тачан назив атрибута. Погледајте :doc:`овде </system/objects>` како да пронађете називе атрибута.

source: Please note that while header names are case insensitive, header values are not. Make sure to specify values in expected case, otherwise they will not match.
de: Bitte beachten Sie, dass bei den Header-Namen die Groß- und Kleinschreibung nicht beachtet wird, bei den Header-Werten jedoch schon. Stellen Sie sicher, dass Sie die Werte in der korrekten Groß- und Kleinschreibung angeben, da sie sonst nicht die gewünschte Funktion auslösen.
sr: Обратите пажњу да иако називи заглавља нису осетљиви на мала и велика слова, вредности заглавља јесу. Стога, одредите вредности у одговарајућој форми, иначе неће се подударати.

source: Auto Responses
de: Automatische Antworten
sr: Аутоматски одговори

source: Normally, Zammad runs internal checks to see if an incoming email is an automatic response. In such cases Zammad will not send trigger based responses. You can override this with the below mentioned headers:
de: Normalerweise führt Zammad interne Prüfungen durch, um festzustellen, ob eine eingehende E-Mail eine automatische Antwort ist. In solchen Fällen sendet Zammad keine Trigger-basierten Antworten. Sie können dies mit den unten genannten Headern außer Kraft setzen:
sr: Zammad обично извршава интерне провере да види да ли је долазна имејл порука уствари аутоматски одговор. У овим случајевима Zammad неће слати аутоматске одговоре. Ово понашање можете преиначити путем заглавља испод:

source: Set to ``false`` to disable trigger based responses. If set to ``true`` Zammad will send a response.
de: Verwenden Sie ``false``, um Trigger-basierte Antworten zu deaktivieren. Sofern Sie es auf ``true`` setzen, wird Zammad eine Antwort senden.
sr: Поставите на ``false`` да бисте онемогућили аутоматске одговоре. Ако је постављено на ``true``, Zammad ће послати одговор.

source: This option *does not* work if e.g. ``precedence: list`` is set unless you use the auto response header below as well.
de: Diese Option funktioniert *nicht*, wenn z.B. ``precedence: list`` gesetzt ist, es sei denn, Sie verwenden auch den unten stehenden Auto Response-Header.
sr: Ова опција *не функционише* ако је нпр. ``precedence: list`` подешен, осим ако не користите и заглавље аутоматског одговора испод.

source: Providing this header allows you to tell Zammad that the mail in question is an auto generated response (``true``). This will cause email based triggers to be skipped.
de: Wenn Sie diesen Header setzen weiß Zammad, dass die entsprechende E-Mail eine automatisch generierte Antwort ist (``true``). Das verhindert die Ausführung von E-Mail-basierten Triggern.
sr: Пружање овог заглавља вам омогућава да кажете Zammad-у да је дотична пошта аутоматски генерисани одговор (``true``). Ово ће узроковати прескакање слања аутоматских порука.

source: Set this header to ``false`` if you want to generate auto responses.
de: Setzen Sie den Header auf ``false``, wenn eine automatische Antwort generiert werden soll.
sr: Поставите ово заглавље на ``false`` ако желите да шаљете аутоматске одговоре.
