Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: Use the **Import** button to open the CSV import dialog.
de: Über die Schaltfläche **Importieren** öffnen Sie den CSV-Importdialog.
sr: Користите дугме **Увези** да бисте отворили дијалог за CSV увоз.

source: Step 1: Inspect the sample .csv
de: Schritt 1: Überprüfen Sie die Beispiel-CSV-Datei
sr: Корак 1: Прегледајте узорак .csv датотеке

source: Use the link at the bottom of the CSV import dialog (**“Example CSV file for download”**) to see how Zammad expects you to format your organization data.
de: Verwenden Sie den Link unten im CSV-Importdialog (**"Beispiel-CSV-Datei zum Download“**), um zu sehen, in welchem Format Zammad die Daten für den Import erwartet.
sr: Користите везу при дну дијалога за увоз CSV-а (**„Пример CSV датотеке за преузимање“**) да бисте видели како Zammad очекује да форматирате податке своје организације.

source: Step 2: Export Your Organization Data to .csv
de: Schritt 2: Exportieren Sie Ihre Organisationsdaten in eine CSV-Datei
sr: Корак 2: Извезите податке ваше организације у .csv

source: Prepare your .csv file according to the format found in Step 1 above. Note that:
de: Bereiten Sie Ihre CSV-Datei entsprechend dem Format aus Schritt 1 auf. Beachten Sie, dass:
sr: Припремите своју .csv датотеку у складу са форматом који се налази у кораку 1 изнад. Напомињемо да:

source: the ``id`` attribute (column) should be left blank or removed entirely;
de: das Attribut ``id`` (Spalte) leer bleiben oder ganz entfernt werden sollte;
sr: атрибут (колона) ``id`` треба бити остављена празна или у потпуности уклоњена;

source: the ``name`` attribute is **required**; and
de: das Attribut ``name`` **erforderlich** ist und
sr: атрибут ``name`` је **обавезан**; и

source: any other columns may be safely omitted as long as each row has the same number of fields (commas).
de: alle anderen Spalten weggelassen werden können, solange jede Zeile die gleiche Anzahl an Feldern (Kommas) enthält.
sr: било које друге колоне се могу безбедно изоставити све док сваки ред има исти број колона (зареза).

source: For instance:
de: Zum Beispiel:
sr: На пример:

source: Several *organization members* can be added. Separate multiple values for one field with ``~~~`` as above.
de: Es können *mehrere Organisationsmitglieder* hinzugefügt werden. Trennen Sie mehrere Werte für ein Feld mit ``~~~`` wie oben angegeben.
sr: Можете додати неколико *чланова организације*. Одвојите вишестуке вредности истог поља са ``~~~`` као на примеру изнад.

source: Step 3: Import Your .csv to Zammad
de: Schritt 3: Importieren Sie Ihre CSV-Datei in Zammad
sr: Корак 3: Увезите свој .csv у Zammad

source: Once your raw organization data has been submitted, Zammad will perform a test run to compute the number of affected records:
de: Sobald die Daten übermittelt wurden, führt Zammad einen Testlauf durch, um die Anzahl der betroffenen Datensätze zu ermitteln:
sr: Када су ваши необрађени подаци о организацији отпремљени, Zammad ће извршити пробни увоз да би израчунао број записа на које утиче:

source: CSV import test run and confirmation dialog
de: CSV-Import-Testlauf und Bestätigungsdialog
sr: Пробно покретање CSV увоза и дијалог за потврду

source: CSV import always begins with a preview / test run.
de: Der CSV-Import beginnt immer mit einer Vorschau bzw. einem Testlauf.
sr: CSV увоз увек почиње прегледом/пробним радом.

source: 🤔 **How does it know when to create new records and when to update?**
de: 🤔 **Woher weiß Zammad, ob neue Datensätze erstellt oder ob Datensätze aktualisiert werden müssen?**
sr: 🤔 **Како зна када да дода нове записе, а када да их освежи?**

source: Records are updated when the imported data contains a ``name`` that matches an existing organization entry.
de: Datensätze werden aktualisiert, wenn die importierten Daten einen ``name`` Eintrag enthalten, der mit einem bereits vorhandenen Organisationsnamen übereinstimmt.
sr: Записи се освежавају када увезени подаци садрже ``name`` које одговара постојећем уносу организације.

source: Click **Yes, start real import** to proceed. (If you're importing a lot of records, be patient—it may take a minute.)
de: Klicken Sie auf **Ja, den echten Import starten**, um fortzufahren. (Wenn Sie viele Datensätze importieren, haben Sie etwas Geduld - es kann durchaus eine Minute dauern.)
sr: Кликните на **Да, започни прави увоз** да бисте наставили. (Уколико увозите много записа, будите стрпљиви – може потрајати минут.)

source: That's it! 🎉🎉🎉
de: Das war's! 🎉🎉🎉
sr: То је то! 🎉🎉🎉

source: Managing Organizations via the Admin Panel
de: Verwalten von Organisationen über das Admin-Panel
sr: Управљање организацијама преко административног панела

source: The "Organizations" panel provides tools to manually manage organization entries. See :ref:`organization-details-reference` for help with the New/Edit Organization dialog.
de: Der Bereich "Organisationen" bietet Werkzeuge zur manuellen Verwaltung von Organisationen. Siehe :ref:`organization-details-reference` für weiter Infos zum Erstell- und Bearbeitungsdialog.
sr: Панел „Организације” пружа алатке за ручно уређивање организација. Погледајте :ref:`organization-details-reference` за помоћ око дијалога Ново/Измена: Организација.

source: 👥 Creating and editing organizations
de: 👥 Organisationen erstellen und bearbeiten
sr: 👥 Додавање и уређивање организација

source: Click the **New Organization** button to create a new one. Simply click on an existing organization to edit it. You can even clone an organization by using the icon in the "Action" column.
de: Klicken Sie auf die Schaltfläche **Neue Organisation**, um eine neue Organisation zu erstellen. Klicken Sie einfach auf eine bestehende Organisation, um sie zu bearbeiten. Sie können sogar eine Organisation klonen, indem Sie das Symbol in der Spalte "Aktion" verwenden.
sr: Кликните на дугме **Нова организација** да бисте додали нову. Једноставно кликните на постојећу организацију да бисте је изменили. Можете чал и клонирати организацију коришћењем иконице у колони „Радње”.

source: Screenshot shows the organization overview in the admin settings.
de: Screenshot zeigt Übersicht über die Organisation in den Verwaltungseinstellungen.
sr: Снимак екрана који приказује преглед организација у администраторском панелу.

source: 🗑️ Deleting organizations
de: 🗑️ Organisationen löschen
sr: 🗑 Брисање организација

source: Organizations currently can only be removed via data privacy deletion task by deleting the last organization member and then choose ``yes`` for *Delete organization?*.
de: Organisationen können derzeit nur über einen Datenschutz-Löschaufgabe entfernt werden, indem Sie das letzte Organisationsmitglied löschen und dann ``Ja`` für *Organisation löschen?* wählen.
sr: Организације тренутно могу да се уклоне само путем задатка за брисање приватних података тако што ћете избрисати последњег члана организације, а затим изабрати ``да`` за *Избриши организацију?*.

source: Use the ⋮ **Actions** menu in the user overview to open the **Delete User** dialog or create a deletion task in the :doc:`data privacy </system/data-privacy>` section directly.
de: Verwenden Sie das ⋮ **Aktion** Menü in der Benutzerübersicht, um den **Benutzer löschen** Dialog zu öffnen oder erstellen Sie direkt eine Aufgabe zum Löschen im Abschnitt :doc:`Datenschutz </system/data-privacy>`.
sr: Користите падајући мени ⋮ **Радње** у прегледу корисника за дијалог **Брисање корисника** или додавање захтева за брисање директно у одељку :doc:`приватности података </system/data-privacy>` .

source: Screenshot shows deletion task with deletion of user's organization.
de: Screenshot zeigt die Löschaufgabe mit Löschen der Organisation des Benutzers.
sr: Снимак екрана који приказује захтев за брисање организације корисника.

source: 💥 **Deleting a customer destroys all their associated tickets!**
de: 💥 **Durch das Löschen eines Kunden werden alle zugehörigen Tickets gelöscht!**
sr: 💥 **Брисање клијента уништава све његове повезане тикете!**

source: To learn more, see :doc:`/system/data-privacy`.
de: Weitere Informationen finden Sie unter :doc:`/system/data-privacy`.
sr: Да бисте сазнали више, погледајте :doc:`/system/data-privacy`.

source: Overviews
de: Übersichten
sr: Прегледи

source: You can provide overviews to your agents and customers. They can be used as a kind of worklist of tasks that the agent is supposed to work on. You can add new overviews, edit or delete them. They can be used for individual agents or agent groups. Overviews only show tickets for which the user has permissions (group or role based).
de: Sie können Ihren Agenten und Kunden Übersichten zur Verfügung stellen. Diese können als eine Art Arbeitsliste mit Aufgaben verwendet werden, die der Agent bearbeiten soll. Sie können neue Übersichten hinzufügen, sie bearbeiten oder löschen. Übersichten können für einzelne Agenten oder Agentengruppen verwendet werden. In Übersichten werden nur Tickets angezeigt, für die der Benutzer Berechtigungen hat (gruppen- oder rollenbasiert).
sr: Својим оператерима и клијентима можете обезбедити прегледе. Могу се користити као нека врста радне листе задатака које оператер треба да одради. Можете додати нове прегледе, уредити их или избрисати. Прегледи приказују само тикете за које корисник има одговарајуће дозволе.

source: Please note that overviews can cause performance issues leading to no longer or less often refreshing overviews!
de: Bitte beachten Sie, dass Übersichten zu Performance-Beeinträchtigungen führen können. Dadurch kann es vorkommen, dass Übersichten nicht mehr oder seltener aktualisiert werden!
sr: Имајте на уму да прегледи могу да изазову проблеме са перформансама који доводе до тога да се прегледи освежавају ређе или не!

source: Whenever possible, try to use the same overviews for as many agents and groups as possible to keep the number of overviews low. For best results, you should use a maximum of 15-20 overviews. Please note that any overview will only show a maximum of 2100 elements.
de: Versuchen Sie, wenn möglich, dieselben Übersichten für möglichst viele Agenten und Gruppen zu verwenden, um die Anzahl der Übersichten gering zu halten. Die besten Ergebnisse erzielen Sie, wenn Sie maximal 15-20 Übersichten verwenden. Bitte beachten Sie, dass jede Übersicht nur maximal 2100 Elemente anzeigen kann.
sr: Кад год је то могуће, покушајте да користите исте прегледе за што више оператера и група како бисте одржали низак број прегледа. За најбоље резултате, немојте користити више од 15-20 прегледа. Обратите пажњу да ће сваки преглед приказати максимално 2100 тикета.

source: The following attributes can be set when creating or editing overviews. Have a look under the screenshot where you can find an explanation for each field.
de: Die folgenden Attribute können beim Erstellen oder Bearbeiten von Übersichten eingestellt werden. Schauen Sie sich den Bereich unter dem Screenshot an, wo Sie eine Erklärung für jedes Feld finden können.
sr: Следећи атрибути могу бити подешени приликом додавања или уређивања прегледа. Погледајте снимак екрана испод са објашњењем сваког поља.

source: Available for the following roles / Restrict to only the following users
de: Verfügbar für die folgenden Rollen / Auf die folgenden Benutzer beschränkt
sr: Доступно следећим улогама / Ограничи само на следеће кориснике

source: Define :doc:`roles <roles/index>` that are supposed to see and use the overview in question.
de: Legen Sie :doc:`Rollen <roles/index>` fest, die die jeweilige Übersicht sehen und nutzen werden.
sr: Одређује :doc:`улоге <roles/index>` које би требало да виде и користе дотични преглед.

source: If your overview is rather specific for a sub group of users of your role, use the *"Restrict to only the following users"* option to further restrict the visibility of the overview to defined users.
de: Wenn Ihre Übersicht eher spezifisch für eine Untergruppe von Benutzern Ihrer Rolle ist, verwenden Sie die Option *"Auf die folgenden Benutzer beschränkt “*, um die Übersicht nur auf definierte Benutzer einzuschränken.
sr: Ако је ваш преглед прилично специфичан за подгрупу корисника ваше улоге, користите опцију *„Ограничи само на следеће кориснике“* да бисте додатно ограничили видљивост прегледа на те кориснике.

source: The setting "available for the following roles" is mandatory.
de: Das Hinzufügen einer Rolle bei "Verfügbar für die folgenden Rollen “ ist zwingend erforderlich.
sr: Атрибут „Доступно следећим улогама“ је обавезан.

source: Only available for users with shared organization
de: Nur verfügbar für Benutzer mit teilenden Organisationen
sr: Доступно само корисницима заједничких организација

source: This is important if the available role is a customer. Whether you select "Yes" or "No" depends on whether you want one of your customer's contacts to see all of their organization's tickets.
de: Dies ist wichtig, wenn die verfügbare Rolle ein Kunde ist. Bei der Entscheidung, ob "Ja" oder "Nein" ausgewählt wird, muss berücksichtigt werden, ob alle Mitarbeiter der Kundenorganisation gegenseitig Ihre Tickets sehen können sollen.
sr: Ово је важно уколико је одређена улога клијент. Да ли ћете изабрати „да” или „не” зависи од тога да ли желите да један од контаката вашег клијента види све тикете њихове организације.

source: Shared organization is a setting in the organization management. See :doc:`/manage/organizations/index` for more information.
de: Bei der geteilten Organisation handelt es sich um eine Einstellung in der Organisationsverwaltung. Weitere Informationen finden Sie unter :doc:`/manage/organizations/index`.
sr: Заједничка организација је подешавање организације. Погледајте :doc:`/manage/organizations/index` за више информација.

source: "Users" also refers to the customer role in this case.
de: Mit "Benutzer“ ist in diesem Fall auch die Kundenrolle gemeint.
sr: „Корисници” се у овом случају такође односи на улогу клијента.

source: Only available for users which are absence replacements for other users
de: Nur für Benutzer verfügbar, die Abwesenheits-Vertretung für andere Benutzer sind
sr: Доступно само корисницима који су замена за друге кориснике.

source: This selection refers to the setting in the user preferences (profile-picture / initials of agent in the left corner > profile > out of office). If this option is checked, this overview is only displayed for users who have been set as a substitution. See "Out of office function" in the :user-docs:`user documentation </extras/profile-and-settings.html>` for more details.
de: Diese Auswahl bezieht sich auf die Einstellung in den Benutzereinstellungen (Profilbild / Initialen in der linken Ecke > Profil > Abwesenheit). Wenn diese Option aktiviert ist, wird diese Übersicht nur für Benutzer angezeigt, die als Vertretung eingestellt wurden. Siehe "Abwesenheit" in der :user-docs:`Benutzerdokumentation </extras/profile-and-settings.html>` für weitere Details.
sr: Овај избор се односи на атрибут у подешавањима корисника (аватар / иницијали оператера у левом углу > Профил > Ван канцеларије). Ако је ова опција укључена, овај преглед се приказује само корисницима који су унети као замена. Погледајте подешавање „Ван канцеларије” у :user-docs:`корисничкој документацији </extras/profile-and-settings.html>` за више детаља.

source: **For example:** Agent A is on vacation and Agent B will take care of his tickets. Then an overview can be set up, which only shows Agent B all new tickets from Agent A for this period of time, without having to search for them separately.
de: **Zum Beispiel:** Agent A ist im Urlaub und Agent B kümmert sich um dessen Tickets. Dazu kann eine Übersicht eingerichtet werden, die Agent B alle neuen Tickets von Agent A für den Zeitraum der Vertretung anzeigt, ohne dass die Tickets separat gesucht werden müssen.
sr: **На пример:** Оператер А је на одмору и оператер Б ће се побринути за њихове тикете. Тада се може подесити преглед, који оператеру Б приказује само све нове тикете оператера А за овај временски период, без потребе да их посебно траже.

source: Conditions for shown tickets
de: Bedingungen für angezeigte Tickets
sr: Услови за приказане тикете

source: Which tickets should be shown in this overview? The conditions can be seen like a filter. You can add more than one condition. In the preview you have the possibility to double check if your entry of the conditions makes sense by directly displaying tickets that match your filtering.
de: Welche Tickets sollen in dieser Übersicht angezeigt werden? Die Bedingungen können als Filter angesehen werden. Sie können mehr als eine Bedingung hinzufügen und diese kombinieren. In der Vorschau können Sie überprüfen, ob die Eingrenzung sinnvoll ist, da Ihnen direkt die entsprechenden Tickets angezeigt werden.
sr: Које тикете треба приказати у овом прегледу? Услови се могу сматрати врстом филтера. Можете додати више услова. У приказу испод имате могућност да још једном проверите да ли ваш унос услова има смисла тако што ће директно приказати тикете које одговарају вашим филтерима.

source: **👋 Looking for more depth explanation on conditions? 🤓**
de: **👋 Suchen Sie nach ausführlicheren Erläuterungen zu den Bedingungen? 🤓**
sr: **👋 Тражите детаљније објашњење услова? 🤓**

source: Many condition settings in Zammad, no matter if in ticket scope or not, re-appear in several places of Zammad. For this reason we created a dedicated documentation section to avoid duplicate content.
de: Viele Bedingungseinstellungen in Zammad, egal ob im Ticketbereich oder nicht, tauchen an verschiedenen Stellen in Zammad wieder auf. Aus diesem Grund haben wir einen eigenen Dokumentationsbereich geschaffen, um doppelten Inhalt zu vermeiden.
sr: Многа подешавања услова, без обзира да ли су у контексту тикета или не, појављују се на неколико места у Zammad-у. Из тог разлога смо направили наменски одељак документације да смањимо дупли садржај.

source: Have a look at :doc:`/misc/object-conditions/index` to learn even more! 🎉
de: Schauen Sie sich :doc:`/misc/object-conditions/index` an, um weitere Informationen zu erhalten! 🎉
sr: Погледајте :doc:`/misc/object-conditions/index` да бисте сазнали још више! 🎉

source: Attributes
de: Attribute
sr: Атрибути

source: Which attributes (column headers) shall be shown in the overview?
de: Welche Attribute (Spaltenüberschriften) sollen in der Übersicht angezeigt werden?
sr: Који атрибути (заглавља колона) ће бити приказани у прегледу?

source: With this setting you can select the headlines of your overview. Depending on which information is important in this selection, it can be displayed individually. For this example "Unassigned and open", the overview would look like this:
de: Mit dieser Einstellung können Sie auswählen, welche Spalten in der Übersicht angezeigt werden. Für dieses Beispiel "Nicht zugewiesen und offen“ würde die Übersicht wie folgt aussehen:
sr: Помоћу овог подешавања можете да изаберете колоне свог прегледа. У зависности од тога које су информације важне у овом избору, могу се приказати појединачно. За овај пример „Недодељени и отворени“, преглед би изгледао овако:

source: These settings can also be adjusted individually by admins at a later time (in the overview, top right: Options).
de: Diese Einstellungen können nachträglich von Admins individuell angepasst werden (in der Übersicht oben rechts: Optionen).
sr: Ова подешавања такође могу касније појединачно да подесе администратори (у прегледу, горе десно: Опције).

source: Please note that overview column and sort settings are global settings which affect all users seeing those overviews.
de: Bitte beachten Sie, dass es sich bei den Spalten- und Sortiereinstellungen um globale Einstellungen handelt, die sich auf alle Benutzer auswirken, die diese Übersichten sehen.
sr: Имајте на уму да су колона прегледа и подешавања сортирања глобална подешавања која утичу на све кориснике који виде те прегледе.

source: Sorting, Grouping and Active
de: Sortieren, Gruppieren und Aktiv
sr: Сортирање, груписање и активно

source: Sorting by
de: Sortieren nach
sr: Сортирање по

source: In which order should the tickets be displayed? Choose the attribute you want to sort by.
de: In welcher Reihenfolge sollen die Tickets angezeigt werden? Legen Sie das Attribut fest, nach dem sortiert werden soll.
sr: Којим редоследом треба да буду приказани тикети? Одаберите атрибуте по којима желите да сортирате.

source: Sorting order
de: Sortierungs-Reihenfolge
sr: Редослед сортирања

source: The direction of the sorting (ascending or descending).
de: Die Richtung der Sortierung (aufsteigend oder absteigend).
sr: Правац сортирања (растуће или опадајуће).

source: Grouping by
de: Gruppieren mit
sr: Груписано по

source: Should the tickets be grouped by a specific attribute within the list?
de: Sollen die Tickets innerhalb der Liste nach einem bestimmten Attribut gruppiert werden?
sr: Да ли тикети треба да буду груписани према одређеном атрибуту у листи?

source: Grouping order
de: Gruppierreihenfolge
sr: Редослед груписања

source: The direction of the grouping.
de: Gruppierungs-Reihenfolge.
sr: Правац груписања.

source: Should the overview be active or not? Rather than deleting an overview entirely, you can set it to inactive to make it unavailable to your users.
de: Soll die Übersicht angezeigt werden können (aktiv) oder nicht (nicht aktiv)? Anstatt eine Übersicht vollständig zu löschen, können Sie sie auf inaktiv setzen, um sie für Ihre Benutzer zu deaktivieren.
sr: Да ли преглед треба да буде укључен или искључен? Уместо да у потпуности избришете преглед, можете га искључити како бисте га учинили недоступним вашим корисницима.

source: Users can define their own overview order. Renaming or reordering overviews has no effect on custom orders!
de: Benutzer können ihre eigene Reihenfolge der Übersichten definieren. Das Umsortieren von Übersichten hat keine Auswirkung auf individuelle Sortierungen Ihrer Benutzer!
sr: Корисници могу дефинисати сопствени редослед прегледа. Промена назива или редослед прегледа нема утицаја на прилагођене редоследе!

source: You can learn more about this setting :user-docs:`in the user documentation </extras/profile-and-settings.html#user-profile-settings>`.
de: Sie können mehr über diese Einstellung :user-docs:`in der Benutzer Dokumentation </extras/profile-and-settings.html#user-profile-settings>` erfahren.
sr: Више о овој поставци можете сазнати :user-docs:`у корисничкој документацији </extras/profile-and-settings.html#user-profile-settings>`.

source: Public Links
de: Öffentliche Links
sr: Јавни линкови

source: Public links allow you to provide important links at different places within the UI of Zammad. This allows you not just to provide legal information like e.g. data privacy or contact information. You can also provide further useful links to other services if needed.
de: Mit öffentlichen Links können Sie wichtige Links an verschiedenen Stellen innerhalb der Benutzeroberfläche von Zammad bereitstellen. Dadurch können Sie nicht nur rechtliche Informationen wie z.B. Datenschutz- oder Kontaktinformationen einbinden. Bei Bedarf können Sie auch weitere nützliche Links zu anderen Diensten bereitstellen.
sr: Јавне линкови вам омогућавају да обезбедите важне линкове на различитим местима унутар корисничког интерфејса Zammad-а. Ово вам омогућава не само да пружите правне информације као нпр. приватност података или контакт информације. Такође можете обезбедити додатне корисне линкове до других услуга ако је потребно.

source: Screenshot showing the public links management interface within the settings
de: Screenshot zeigt Einstellungen für öffentliche Links
sr: Снимак екрана који приказује интерфејс за управљање јавним линковима унутар подешавања

source: Adding New Public Links
de: Neue öffentliche Links hinzufügen
sr: Додавање нових јавних линкова
