Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: For the OAuth option, you first have to configure the connection to your Exchange app and then add an account you want to use.
de: Für die OAuth-Option müssen Sie zunächst die Verbindung zu Ihrer Exchange-App konfigurieren und dann ein Konto hinzufügen, das Sie verwenden möchten.
sr: За OAuth опцију, прво морате подесити везу ка вашој Exchange апликацији и онда додати налог који жлите да користите.

source: Create an app in Microsoft's `Entra admin center <https://entra.microsoft.com/#home>`_, if not already done.
de: Erstellen Sie eine App im Microsoft `Entra Admin Center <https://entra.microsoft.com/#home>`_, falls noch nicht geschehen.
sr: Креирајте апликацију у Microsoft `Entra admin центру <https://entra.microsoft.com/#home>`_, уколико то нисте већ учинили.

source: In addition to the mandatory information, provide a **Redirect URI**. You can copy it from Zammad's dialog which opens after clicking the **Connect Exchange App** button. Copy the URL from the **Your callback URL** field. Make sure your FQDN is correct, otherwise the setup might fail.
de: Geben Sie zusätzlich zu den erforderlichen Informationen die **Redirect URI** an. Sie können sie aus dem Dialogfeld von Zammad kopieren, das sich nach einem Klick auf die Schaltfläche **Exchange-App verbinden** öffnet. Kopieren Sie die URL aus dem Feld **Ihre Calback-URL**. Vergewissern Sie sich, dass Ihr FQDN korrekt ist, da die Einrichtung sonst fehlschlagen kann.
sr: Уз обавезне податке, приложите и **Redirect URI**. Можете га ископирати из Zammad-овог дијалога који се отвара кликом на дугме **Повежи Exchange апликацију**. Ископирајте URL адресу из поља **Ваш URL повратног позива**. Проверите да ли је ваш FQDN исправан, у супротном поставка можда неће успети.

source: Add the permissions to read address books / folders. The required permissions differ depending on your use case (sync users or contacts, from organization or only one account, etc.). ``Contacts.Read`` or ``Contacts.Read.Shared`` may be a good starting point. Have a look at Microsoft's `Graph permission reference <https://learn.microsoft.com/en-us/graph/permissions-reference>`_ for more information.
de: Fügen Sie die Berechtigungen zum Lesen von Adressbüchern/Ordnern hinzu. Die erforderlichen Berechtigungen hängen von Ihrem Anwendungsfall ab (Synchronisierung von Benutzern oder Kontakten, von einer Organisation oder nur einem Konto, usw.). ``Contacts.Read`` oder ``Contacts.Read.Shared`` können ein guter Ausgangspunkt sein. Werfen Sie einen Blick auf Microsofts ``Graph-Berechtigungsreferenz <https://learn.microsoft.com/de-de/graph/permissions-reference>`_ für weitere Informationen.
sr: Додајте дозволе за читање адресара / фолдера. Обавезне дозволе се разликују у зависности од вашег случаја (синхронизација корисника или контаката, из организације или само једно налога, итд). ``Contacts.Read`` или ``Contacts.Read.Shared`` могу бити добра почетна тачка. Погледајте `Microsoft Graph референцу дозвола <https://learn.microsoft.com/en-us/graph/permissions-reference>`_ за више информација.

source: Now you need to add some information from the app in Zammad:
de: Nun müssen Sie einige Informationen aus der App in Zammad hinzufügen:
sr: Сада морате додати неке информације из апликације у Zammad:

source: In the **Overview** tab in Entra, you can find the values for "Application (client) ID" and "Directory (tenant) ID". Copy and paste both into the corresponding fields in Zammad's app config dialog. If you don't have it open, click the **Connect Exchange App** button.
de: Auf dem Tab **Overview** in Entra finden Sie die Werte für "Application (client) ID" und "Directory (tenant) ID". Kopieren Sie beide und fügen Sie sie in die entsprechenden Felder in Zammads Dialog zur App-Konfiguration ein.. Wenn Sie diesen nicht geöffnet haben, klicken Sie auf die Schaltfläche **Exchange-App verbinden**.
sr: У **Overview** језичку у Entra центру, можете пронаћи вредности за „Application (client) ID” и „Directory (tenant) ID”. Ископирајте и налепите обе вредности у одговарајућа поља у Zammad-овом дијалогу подешавања. Уколико га нисте отворили, кликните на дугме **Повежи Exchange апликацију**.

source: You can create a secret in Entra in the **Certificates & secrets** tab. Select **New client secret**, add a name and choose an expiration time. You can find the created secret now in the **Value** column (**not** the Secret ID). Copy and paste it into the app configuration dialog in Zammad.
de: Sie können ein Secret in Entra im Tab **Certificates & secrets** erstellen. Wählen Sie **New client secret**, fügen Sie einen Namen hinzu und wählen Sie eine Ablaufzeit. Das erstellte Secret finden Sie nun in der Spalte **Value** (**nicht** die Secret ID). Kopieren Sie es und fügen Sie es im Konfigurations-Dialog in Zammad ein.
sr: Можете креирати шифру апликације у Entra центру под **Certificates & secrets** језичком. Одаберите **New client secret**, унесите назив и одаберите време истека. Шофру можете пронаћи у колони **Value** (**не** Secret ID). Ископирајте и налепите вредност у дијалог подешавања апликације у Zammad-у.

source: Finally, click on **Submit** in the app configuration dialog in Zammad and go on with the next section.
de: Klicken Sie abschließend im Konfigurationsdialog der App in Zammad auf **Übermitteln** und fahren Sie mit dem nächsten Abschnitt fort.
sr: На крају, кликните на дугме **Пошаљи** у дијалогу подешавања апликације у Zammad-у и пређите на следећи одељак.

source: Screenshot shows app overview in Microsoft's Entra admin center
de: Screenshot zeigt die App-Übersicht in Microsofts Entra Admin Center
sr: Снимак екрана који приказује приказ апликације у Microsoft Entra admin центру

source: Screenshot shows app secret in Microsoft's Entra admin center
de: Screenshot zeigt App Secret in Microsofts Entra Admin Center
sr: Снимак екрана који приказује шифру апликације у Microsoft Entra admin центру

source: After connecting to your app, simply click the **Add Account** button. You are then redirected to a Microsoft log in page. Log in by providing credentials of a user with proper permissions and confirm the requested permissions by clicking the **Accept** button.
de: Nachdem Sie eine Verbindung zu Ihrer App hergestellt haben, klicken Sie einfach auf die Schaltfläche **Konto hinzufügen**. Sie werden dann auf eine Microsoft-Anmeldeseite weitergeleitet. Melden Sie sich an, indem Sie die Zugangsdaten eines Benutzers mit den richtigen Berechtigungen angeben, und bestätigen Sie die angeforderten Berechtigungen durch Klicken auf die Schaltfläche **Accept**.
sr: Када повежете вашу апликацију, једноставно кликните на дугме **Додај налог**. Бићете преусмерени на Microsoft страницу за пријављивање. Пријавите се са приложеним креденцијалима корисника са неопходним дозволама и потврди захтеване дозволе кликом на дугме **Accept**.

source: This redirects you back to Zammad where you can now configure the address book(s) and how the users should be mapped.
de: Dies leitet Sie zurück in Zammad, wo Sie nun die Adressbücher auswählen und festlegen können, wie die Benutzer zugewiesen werden sollen.
sr: Бићете преусмерени назад у Zammad где сада можете подесити адресар(е) и мапирање корисника.

source: Address Book and User Mapping
de: Adressbuch und Benutzer-Zuordnung
sr: Адресар и мапирање корисника

source: A click on **Configure** opens another configuration dialog. In the first step, choose one or more folders from which users should get synced to Zammad.
de: Ein Klick auf **Konfigurieren** öffnet einen weiteren Konfigurationsdialog. Im ersten Schritt wählen Sie einen oder mehrere Ordner aus, aus denen Benutzer mit Zammad synchronisiert werden sollen.
sr: Кликом на дугме **Подеси** отвара се још један дијалог подешавања. У првом кораку, одаберите један или више фолдера из којих ће корисници бити синхронизовани са Zammad-ом.

source: In the second step, select which Exchange attribute should get mapped on which Zammad attribute. It is recommended to map at least email address, first and last name.
de: Im zweiten Schritt wählen Sie aus, welches Exchange-Attribut auf welches Zammad-Attribut abgebildet werden soll. Es wird empfohlen, mindestens die E-Mail Adresse, den Vor- und Nachnamen zuzuordnen.
sr: У другом кораку, одаберите који Exchange атрибут ће бити мапиран на који Zammad атрибут. Препоручено је мапирање бар имејл адресе, имена и презимена.

source: Screenshot shows Exchange mapping dialog in Zammad
de: Screenshot zeigt den Exchange-Zuordnungsdialog in Zammad
sr: Снимак екрана који приказује Exchange дијалог мапирања у Zammad-у

source: After configuring the mapping, confirm it with a click on the **Continue** button. Zammad analyzes the configuration and the entries then and presents you an overview of your configuration. Confirm it by selecting **Save configuration**.
de: Nachdem Sie die Zuordnung konfiguriert haben, bestätigen Sie diese mit einem Klick auf die Schaltfläche **Fortfahren**. Zammad analysiert daraufhin die Konfiguration und die Eingaben und präsentiert Ihnen eine Übersicht über Ihre Konfiguration. Bestätigen Sie diese, indem Sie **Konfiguration speichern** wählen.
sr: Након подешавања мапирања, потврдите га кликом на дугме **Настави**. Zammad ће анализирати конфигурацију и уносе и онда вам представити преглед ваше конфигурације. Потврдите га кликом на **Сачувај конфигурацију**.

source: Additional information
de: Weitere Informationen
sr: Додатне информације

source: The sync runs hourly - if you need to change mappings or the address book(s), you can change the configuration at any time by using the **Configure app** button.
de: Die Synchronisierung erfolgt stündlich - wenn Sie Zuordnungen oder die Adressbücher ändern müssen, können Sie die Konfiguration jederzeit über die Schaltfläche **Konfigurieren** ändern.
sr: Синхронизација се извршава сваког сата – уколико желите да измените мапирања или адресар(е), можете променити конфигурацију у сваком тренутку кликом на дугме **Подеси апликацију**.

source: After the sync has finished, you can find the new Exchange contacts under "Users". Zammad integrates them just as normal users.
de: Nach Abschluss der Synchronisierung finden Sie die neuen Exchange-Kontakte unter "Benutzer". Zammad integriert sie genauso wie normale Benutzer.
sr: Када се синхронизација заврши, нове Exchange контакте можете пронаћи у одељку „Корисници“. Zammad их приказује баш као и обичне кориснике.

source: In some cases you might see unique IDs as "Login" instead of the email address. This is normal and doesn't affect the login or email mapping for that entry.
de: In einigen Fällen können Sie eindeutige IDs als "Login" anstelle der E-Mail-Adresse sehen. Dies ist normal und hat keinen Einfluss auf die Zuordnung von Login oder E-Mail für diesen Eintrag.
sr: У неким случајевима можда ћете видети јединствене ID корисника као -ове као „Пријава“ уместо имејл адресе. Ово је очекивано и не утиче на пријављивање или мапирање имејл адреса за тај унос.

source: Use GitHub integration to track GitHub issues directly within Zammad tickets. Add links to issues and get meta information like status (open/closed), assignee, labels and more.
de: Verwenden Sie die GitHub-Integration, um GitHub-Issues direkt in Zammad-Tickets zu verfolgen. Fügen Sie Links zu Issues hinzu und erhalten Sie Metainformationen wie Status (offen/geschlossen), Assignees, Labels und mehr.

source: Please note that our GitHub integration does not support pull requests.
de: Bitte beachten Sie, dass unsere GitHub-Integration keine Pull-Requests unterstützt.
sr: Обратите пажњу да наша GitHub интеграција не подржава pull request-ове.

source: Integration page for GitHub
de: Seite GitHub-Integration in Zammad
sr: Страница GitHub интеграције

source: `Create a new API token in your GitHub profile <https://github.com/settings/personal-access-tokens>`_ under *Developer settings > Personal access tokens > Fine-grained tokens*.
de: `Erstellen Sie ein neues API-Token in Ihrem GitHub-Profil <https://github.com/settings/personal-access-tokens>`_ unter *Developer settings > Personal access tokens > Fine-grained tokens*.

source: Add a name, set an expiration date and define the repository access. Don't add additional permissions.
de: Fügen Sie einen Namen hinzu, legen Sie ein Ablaufdatum fest und definieren Sie den Zugriff auf das Repository. Fügen Sie keine zusätzlichen Berechtigungen hinzu.

source: Enter your new API token in Zammad and enable GitHub integration. Use the default API endpoint (``https://api.github.com/graphql``) unless you're using GitHub Enterprise Server.
de: Geben Sie Ihr neues API-Token in Zammad ein und aktivieren Sie die GitHub-Integration. Verwenden Sie den Standard-API-Endpunkt (``https://api.github.com/graphql``), es sei denn, Sie verwenden GitHub Enterprise Server.

source: Once completed, a new GitHub issues tab will appear in the ticket pane. 🎉
de: Sobald Sie das erledigt haben wird eine neue Registerkarte für GitHub-Issues im Ticketbereich angezeigt. 🎉
sr: По завршетку, нови језичак са GitHub извештајима ће се појавити у панелу тикета. 🎉

source: Token verification is taking a long time
de: Die Token-Verifizierung dauert sehr lange
sr: Провера кључа траје дуго

source: Slight delays are normal (<2 min.), especially for systems under heavy load.
de: Leichte Verzögerungen sind normal (<2 Min.), insbesondere bei stark belasteten Systemen.
sr: Мала кашњења су очекивана (<2 мин.), посебно за системе под великим оптерећењем.

source: Self-hosted administrators, please check your network settings to ensure that your Zammad server can reach ``api.github.com``.
de: Administratoren von selbst gehosteten Instanzen sollten Ihre Netzwerkeinstellungen prüfen und sicherstellen, dass Ihr Zammad-Server ``api.github.com`` erreichen kann.
sr: Администратори који сами хостујете, проверите мрежна подешавања да бисте били сигурни да ваш Zammad сервер може да приступи ``api.github.com``.

source: I reloaded the page and now the API token is gone
de: Ich habe die Seite neu geladen, und jetzt ist das API-Token verschwunden
sr: АПИ кључ је нестао по поновном учитавању странице

source: This may indicate that Zammad is still verifying your API token. Try reloading the page again in a couple minutes.
de: Dies kann darauf hindeuten, dass Zammad noch dabei ist, Ihr API-Token zu verifizieren. Versuchen Sie, die Seite in ein paar Minuten noch einmal zu laden.
sr: Ово може да се деси док Zammad још увек проверава ваш API кључ. Покушајте поново да учитате страницу за неколико минута.

source: Use GitLab integration to track GitLab issues directly within Zammad tickets. Add links to issues and get meta information like status (open/closed), assignee, labels and more.
de: Verwenden Sie die GitLab-Integration, um GitLab-Issues direkt in Zammad-Tickets zu verfolgen. Fügen Sie Links zu Issues hinzu und erhalten Sie Metainformationen wie Status (offen/geschlossen), Assignee, Labels und mehr.

source: Please note that our GitLab integration does not support merge requests.
de: Bitte beachten Sie, dass unsere GitLab-Integration keine Merge Requests unterstützt.
sr: Обратите пажњу да наша GitLab интеграција не подржава merge request-ове.

source: Integration page for GitLab
de: Seite GitLab-Integration in Zammad
sr: Страница GitLab интеграције

source: Create a new API token in your GitLab user settings under **Access Tokens**.
de: Erstellen Sie ein neues API-Token in Ihren GitLab-Benutzereinstellungen unter **Access Tokens**.

source: Add a name, set an expiration date and set the permission ``read_api``.
de: Fügen Sie einen Namen hinzu, legen Sie ein Ablaufdatum fest und setzen Sie die Berechtigung ``read_api``.

source: Enter your new API token in Zammad and enable the GitLab integration. Use the default API endpoint (``https://gitlab.com/api/graphql``) unless you're a self-hosted GitLab user.
de: Geben Sie Ihr neues API-Token in Zammad ein und aktivieren Sie die GitLab-Integration. Verwenden Sie den Standard-API-Endpunkt (``https://gitlab.com/api/graphql``), es sei denn, Sie sind ein selbst hostender Benutzer von GitLab.

source: 🔒 **If you wish to link issues on any private repos...**
de: 🔒 **Wenn Sie Issues in privaten Repos verlinken möchten...**
sr: 🔒 **Ако желите да повежете извештаје из било ког приватног репозиторија...**

source: Your API token must belong to an account with access to those repos.
de: Ihr API-Token muss zu einem Konto mit Zugriff auf diese Repos gehören.
sr: Ваш API кључ мора припадати налогу са приступом тим репозиторијумима.

source: Once completed, a new GitLab issues tab will appear in the ticket pane. 🎉
de: Sobald Sie das erledigt haben wird eine neue Registerkarte für GitLab-Issues im Ticketbereich angezeigt. 🎉
sr: По завршетку, нови језичак са GitLab исвештајима ће се појавити у панелу тикета. 🎉

source: Self-hosted administrators, please check your network settings to ensure that your Zammad server can reach ``gitlab.com``.
de: Administratoren von selbst gehosteten Zammad-Instanzen sollten Ihre Netzwerkeinstellungen prüfen und sicherstellen, dass Ihr Zammad-Server ``gitlab.com`` erreichen kann.
sr: Администратори који сами хостујете, проверите мрежна подешавања да бисте били сигурни да ваш Zammad сервер може да приступи ``gitlab.com``.

source: `i-doit <https://www.i-doit.com/>`_ is an open-source CMDB (configuration management database) tool which is capable of managing information about your physical and digital IT infrastructure. If you use tickets to track issues with your IT components, you may want to connect them with your CMDB. With Zammad, you can do that in two ways!
de: `i-doit <https://www.i-doit.com/>`_ ist ein quelloffenes CMDB-Tool (Configuration Management Database), mit dem Sie Informationen über Ihre physische und digitale IT-Infrastruktur verwalten können. Wenn Sie Tickets verwenden, um Probleme mit Ihren IT-Komponenten zu verfolgen, möchten Sie diese vielleicht mit Ihrer CMDB verbinden. Mit Zammad können Sie das auf zwei Arten tun!

source: 1. Add i-doit Links to Zammad Tickets
de: 1. i-doit Links zu Zammad-Tickets hinzufügen
sr: 1. Додавање i-doit веза ка Zammad тикетима

source: What Users See
de: Was die Nutzer sehen
sr: Шта корисници виде

source: i-doit integration in Zammad's ticket pane
de: Integration von i-doit im Zammad Ticketbereich
sr: i-doit интеграција у Zammad-овом панелу тикета

source: The i-doit integration will appear under a new 🖨 tab in the ticket pane.
de: Die i-doit-Integration wird in einem neuen 🖨 Tab im Ticketbereich angezeigt.
sr: i-doit интеграција ће се појавити под новим 🖨 језичком у панелу тикета.

source: i-doit integration puts a new tab in Zammad's ticket pane where you can add links to existing i-doit devices for easy reference. (See our :user-docs:`user documentation </extras/i-doit-track-company-property.html>` to learn how it works in practice).
de: Die i-doit-Integration fügt einen neuen Tab im Ticketbereich von Zammad ein, in dem Sie Links zu vorhandenen i-doit-Geräten hinzufügen können, um sie leichter zu finden. (Siehe unsere :user-docs:`Benutzerdokumentation </extras/i-doit-track-company-property.html>` für weitere Informationen zur Handhabung in der Praxis).
sr: i-doit интеграција омогућава нов језичак у Zammad-овом панелу тикета где можете додати везе на постојеће i-doit уређаје ради лакшег референцирања. (Погледајте нашу :user-docs:`корисничку документацију </extras/i-doit-track-company-property.html>` да бисте сазнали како то функционише у пракси).

source: How to Set it Up
de: Einrichtung
sr: Како подесити

source: It requires i-doit's `API Add-on <https://www.i-doit.com/i-doit/add-ons/api-add-on/>`_. Make sure to have it properly set up. Use the following setting:
de: Das `API Add-on <https://www.i-doit.com/i-doit/add-ons/api-add-on/>`_ von i-doit ist dazu erforderlich. Stellen Sie sicher, dass es richtig eingerichtet ist. Verwenden Sie die folgende Einstellung:
sr: Захтева i-doit `API додатак <https://www.i-doit.com/i-doit/add-ons/api-add-on/>`_. Обавезно проверите да ли је исправно подешен. Користите следећа подешавања:

source: Active: ``Yes``
de: Aktiv: ``Ja``

source: Enforce authentication by username and password: ``No``
de: Authentifizierung mit Benutzername und Passwort erzwingen: ``Nein``

source: To set it up, enable the integration in the Zammad admin panel under *System > Integrations > i-doit*:
de: Um sie einzurichten, aktivieren Sie die Integration im Adminbereich unter *System > Integrationen > i-doit*:

source: i-doit settings within the integration pages
de: i-doit-Einstellungen unter Integrationen
sr: i-doit подешавања у оквиру страница за интеграцију

source: The root URL of your i-doit installation.
de: Die URL Ihrer i-doit-Installation.
sr: Основни URL ваше i-doit инсталације.

source: Found in the i-doit admin panel under *Interfaces / external data > JSON-RPC API > Common Settings*.
de: Zu finden im i-doit Admin Panel unter *Interfaces / external data > JSON-RPC API > Common Settings*.

source: i-doit administration interface with API configuration
de: i-doit Verwaltungsoberfläche mit API-Konfiguration
sr: i-doit административни интерфејс са API конфигурацијом

source: A unique name to identify Zammad within i-doit.
de: Ein eindeutiger Name zur Identifizierung von Zammad innerhalb von i-doit.
sr: Јединствени назив за идентификацију Zammad-а унутар i-doit-а.

source: (Zammad does not require you to enter a value here, but i-doit might!)
de: (Zammad verlangt nicht, dass Sie hier einen Wert eingeben, aber i-doit schon!)
sr: (Zammad не захтева од вас да унесете вредност овде, али i-doit би могао!)

source: Here you can decide if the certificate of your i-doit system has to be verified or not. In case you are using custom certificates, please have a look at :doc:`how to add them to Zammad </settings/security/ssl-certificates>`.
de: Hier können Sie festlegen, ob das Zertifikat Ihres i-doit-Systems überprüft werden soll oder nicht. Falls Sie benutzerdefinierte Zertifikate verwenden, sehen Sie sich bitte an, wie man diese :doc:`in Zammad hinterlegt </settings/security/ssl-certificates>`.
sr: Овде можете одлучити да ли ће сертификат вашег i-doit система бити проверен или не. У случају да користите прилагођене сертификате, молимо погледајте и :doc:`како да их додате у Zammad </settings/security/ssl-certificates>`.

source: 2. List / Create Zammad Tickets in i-doit
de: 2. Zammad-Tickets in i-doit auflisten / erstellen
sr: 2. Излистајте / Додајте Zammad тикете у i-doit

source: Zammad integration in i-doit's device view
de: Zammad-Integration in der Geräteansicht von i-doit
sr: Zammad интеграција у приказу уређаја i-doit-а

source: i-doit's ticket system integration gives you a way to see all the tickets for a given device without ever leaving i-doit. (See our :user-docs:`user documentation </extras/i-doit-track-company-property.html>` to learn how it works in practice).
de: Die Integration des Ticketsystems in i-doit bietet Ihnen die Möglichkeit, alle Tickets für ein bestimmtes Gerät einzusehen, ohne i-doit zu verlassen (siehe :user-docs:`i-doit Benutzerdokumentation </extras/i-doit-track-company-property.html>`, um es im praktischen Einsatz zu sehen).
sr: Интеграција i-doit система тикета даје вам начин да видите све тикете за дати уређај без напуштања i-doit-а. (Погледајте нашу :user-docs:`корисничку документацију </extras/i-doit-track-company-property.html>` да бисте сазнали како то функционише у пракси).

source: Enable this integration in the i-doit admin panel under *Interfaces / external data > Trouble Ticket System (TTS) > Configuration*:
de: Aktivieren Sie diese Integration im i-doit Admin Panel unter *Interfaces / external data > Trouble Ticket System (TTS) > Configuration*:
