Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: The target language will always default to your current language selection. If you need to translate for a different language, simply change the selection before submitting.
de: Als Zielsprache wird immer die von Ihnen gewählte Sprache verwendet. Wenn Sie für eine andere Sprache übersetzen wollen, ändern Sie die Auswahl einfach vor dem Übermitteln.
sr: Циљни језик ће увек подразумевано бити постављен на ваш тренутни језик провила. Уколико вам треба превод за други језик, једноставно га одаберите из селекције пре слања.

source: All your custom translations will show up in the overview table when added. And they will even persist across Zammad updates!
de: Alle Ihre benutzerdefinierten Übersetzungen werden in der Übersichtstabelle angezeigt, wenn sie hinzugefügt werden. Und sie bleiben sogar bei Aktualisierungen von Zammad erhalten!
sr: Сви ваши прилагођени преводи ће бити приказани у табели прегледа по додавању. Чак ће преживети и ажурирање Zammad-а!

source: Make sure to reload your browser if a translated string is not displayed.
de: Aktualisieren Sie die Seite im Browser, falls eine Übersetzung nicht angezeigt wird.
sr: Уколико текст превода не буде приказан, освежите ваш претраживач.

source: Reverting to Original Translations
de: Zurücksetzen auf Originalübersetzungen
sr: Повратак на оригиналне преводе

source: If you want to revert a custom translation to original text, simply use the appropriate action within the row of the overview table.
de: Wenn Sie eine benutzerdefinierte Übersetzung auf die ursprüngliche Übersetzung zurücksetzen möchten, verwenden Sie einfach die entsprechende Aktion in der Zeile der Übersichtstabelle.
sr: Уколико желите да се вратите прилагођени превод на оригинални текст, једноставно користите одговарајућу акцију из реда табеле прегледа.

source: Depending on the type of the translation source, the action has a slightly different name:
de: Je nach Art der Übersetzungsquelle hat die Aktion einen etwas anderen Namen:
sr: Зависно од типа изворног превода, радња може имати мало другачији назив:

source: **Reset** for customized system translations
de: **Zurücksetzen** für angepasste Systemübersetzungen
sr: **Поништи** за прилагођене системске преводе

source: **Remove** for customized local translations
de: **Entfernen** für angepasste lokale Übersetzungen
sr: **Уклони** за прилагођене локалне преводе

source: In both cases, the action will remove the customized translation after a confirmation.
de: In beiden Fällen wird die benutzerdefinierte Übersetzung nach einer Bestätigung entfernt.
sr: У сваком случају, радња ће избрисати прилагођени превод по потврди.

source: Screenshot showing the location of the Remove action
de: Screenshot, der die Aktion "Entfernen" zeigt
sr: Снимак екрана који приказује позицију радње Уклони

source: Inline Translations
de: Inline-Übersetzungen
sr: Непосредни преводи

source: If you prefer a more hands-on approach, you can activate the inline or on-screen translation feature by pressing ``ctrl`` + ``alt`` + ``t`` at any time and on any screen.
de: Wenn Sie es lieber etwas praktischer mögen, können Sie die Inline- oder On-Screen-Übersetzung durch Drücken von ``strg`` + ``alt`` + ``t`` jederzeit und in jeder Ansicht aktivieren.
sr: Уколико вам је дражи практичнији приступ, можете укључити непосредне преводе односно функцију превода на екрану притиском на ``ctrl`` + ``alt`` + ``t`` у било ком тренутку и на било којој страници.

source: All customizable translation texts will be highlighted for you on the screen. Just click into the highlighted area and update the text in place.
de: Alle anpassbaren Übersetzungstexte werden für Sie auf dem Bildschirm hervorgehoben. Klicken Sie einfach in den markierten Bereich und aktualisieren Sie den Text an Ort und Stelle.
sr: Сви преводи који се могу прилагодити ће бити означени на екрану. Само кликните на означену површину и освежите текст на жељену вредност.

source: Inline translation mode activated for the Overview screen
de: Inline-Übersetzungsmodus für die Ansicht "Übersicht"
sr: Непосредни преводи укључени на екрану прегледа

source: When finished editing, simply press ``ctrl`` + ``alt`` + ``t`` again to deactivate.
de: Wenn Sie mit der Bearbeitung fertig sind, drücken Sie einfach wieder ``strg`` + ``alt`` + ``t``, um die Bearbeitung zu deaktivieren.
sr: По завршетку уређивања, једноставно притисните ``ctrl`` + ``alt`` + ``t`` поново за искључивање.

source: Even though it's available on any screen, the inline translation feature requires admin permissions. It works only for the current language selection. If you need to translate a different language, first change the language in your :user-docs:`profile settings </extras/profile-and-settings.html>`.
de: Obwohl die Inline-Übersetzungsfunktion auf jeder Ansicht verfügbar ist, erfordert sie Administratorrechte. Sie funktioniert nur für die aktuelle Sprachauswahl. Wenn Sie eine andere Sprache übersetzen müssen, ändern Sie zunächst die Sprache in Ihren :user-docs:`Profileinstellungen </extras/profile-and-settings.html>`.
sr: Иако су доступни за сваку страницу, непосредни преводи захтевају администраторске дозволе. Функционишу само за тренутни одабир језика. Ако желите да преведете на други језик, прво промените језик у вашим :user-docs:`подешавањима профила </extras/profile-and-settings.html>.

source: Shows which version is currently being used on your Zammad-instance.
de: Zeigt an, welche Version derzeit auf Ihrer Zammad-Instanz verwendet wird.
sr: Приказује која верзија се користи тренутно на вашој Zammad инстанци.

source: Provider
sr: Провајдер

source: Chat
sr: Ћаскање

source: Email
sr: Имејл

source: Host
sr: Сервер

source: Port
sr: Порт

source: This this Zammad ensures that your email account is capable of sending internal and external - once this is verified the setup process is complete! 🎉
sr: Ово обезбеђује да ваш имејл налог може да шаље интерно и екстерно - када ово буде потврђено, процес подешавања је завршен! 🎉

source: ``X-Zammad-Ticket-Priority`` & ``X-Zammad-Ticket-FollowUp-Priority``
sr: ``X-Zammad-Ticket-Priority`` и ``X-Zammad-Ticket-FollowUp-Priority``

source: ``X-Zammad-Ticket-Group`` & ``X-Zammad-Ticket-FollowUp-Group``
sr: ``X-Zammad-Ticket-Group`` и ``X-Zammad-Ticket-FollowUp-Group``

source: ``X-Zammad-Ticket-Owner`` & ``X-Zammad-Ticket-FollowUp-Owner``
sr: ``X-Zammad-Ticket-Owner`` и ``X-Zammad-Ticket-FollowUp-Owner``

source: Body
sr: Садржај

source: Name
sr: Назив

source: Designer
sr: Дизајнер

source: Option
sr: Опција

source: Google Email
sr: Google имејл

source: Microsoft 365 Graph Email
sr: Microsoft 365 Graph имејл

source: **Error message:** Retrieval using the IMAP4 protocol failed for the following message: [...]
sr: **Порука грешке:** Retrieval using the IMAP4 protocol failed for the following message: [...]

source: Microsoft 365 IMAP Email
sr: Microsoft 365 IMAP имејл

source: Web
sr: Веб

source: audio: 16 MB
sr: аудио: 16 MB

source: video: 16 MB
sr: видео: 16 MB

source: WhatsApp Business Account ID
sr: WhatsApp Business ID налога

source: App Secret
sr: Шифра апликације

source: Callback URL
sr: Адреса повратног позива

source: Webhook dialog
sr: Дијалог повратног позива

source: System
sr: Систем

source: Don't need the group anymore? If you can't or don't want to recycle (rename) the group, you can also set it to inactive. Agents will no longer be able to see or edit tickets in this group. However, customers can still interact with their existing tickets in an inactive group.
sr: Група вам више није потребна? Ако не можете или не желите да рециклирате групу (промените назив), можете је искључити. Оператери више неће моћи да виде или освежавају тикете у овој групи. Међутим, клијенти и даље могу да комуницирају преко својих постојећих тикета у искљученој групи.

source: Knowledge Base
sr: База знања

source: Features
sr: Функције

source: Icon Set
sr: Сет иконица

source: Knowledge Base: Icons
sr: База знања: иконице

source: Tags
sr: Ознаке

source: 🌐 Domain
sr: 🌐 Домен

source: Link
sr: Веза

source: Report Profiles and Reporting
sr: Профили извештаја и извештавање

source: The reporting is useful to view statistics, get an overview of the number of tickets (e.g. tickets of a specific customer) and to download ticket data from Zammad. In the following section you will find an instruction on how to create and change report profiles. In a separate section you can find information on basic usage of the reporting UI itself. If the reporting options in Zammad are not enough for you, we added a section about external reporting tools you can use.
sr: Извештавање је корисно за преглед статистика, увид у број тикета (нпр. тикете одређеног клијента) и за преузимање података тикета из Zammad-а. У следећем одељку ћете наћи упутства како да додате и уредите профиле извештаја. У посебној секцији можете наћи информације о основног употреби корисничког интерфејса извештавања. Уколико могућности извештавања у Zammad-у нису довољни за вас, објаснили смо и начин коришћења екстерних алата за извештавање које можете пробати.

source: Using the Reporting
sr: Коришћење извештавања

source: The reporting screen is separated in different sections, which we describe below:
sr: Страна извештавања је подељена у различите области, које описујемо испод:

source: Screenshot showing different sections in the reporting screen
sr: Снимак екрана који приказује различите области стране извештавања

source: **Additional filtering** based on the selected profile (see 2). You can filter by status ("Ticket Count"), "Creation Channels" and "Communication" types based on your channels.
sr: **Додатно филтрирање** на основу одабраног профила (видите под 2). Можете филитрирати по стању („Број тикета”), „Каналима отварања” и типовима „Комуникације” на основу ваших канала.

source: **Profile switcher**: here you can easily switch between the different profiles, which were created in the admin panel under "Report Profiles". The shown tickets and numbers are always limited to the current profile you have selected here.
sr: **Одабир профила**: овде се можете једноставно пребацити између различитих профила, који су додати путем администраторског панела под ”„Профили извештаја”. Приказани тикети и бројеви су увек ограничени на тренутно одабрани профил.

source: **Time interval/period switcher** and **graph** area: here you can define the interval you want to see (e.g. "Month") as well as the time period (e.g. "Jul").
sr: **Временски интервал/одабир периода** и област **графика**: овде можете одредити интервал који желите да прегледате (нпр. „Месец”) као и временски период (нпр. „Јул”).

source: **Preview and download** section: here you can find a preview of tickets and a download button based on the report profile and your filtering. The download feature provides the tickets in a ``.xlsx`` spreadsheet.
sr: Област **приказа и преузимања**: овде можете наћи приказ тикета и дугме за преузимање на основу профила извештаја и вашег филтера. Функција преузимања обезбеђује табелу тикета у ``.xlsx`` датотеци.

source: The ticket preview and download button are only showing up if you selected a filter based on "Ticket Count" (see 1).
sr: Приказ тикета и дугме за преузимање ће бити приказани само ако одаберете филтер на основу „Броја тикета” (видите под 1).

source: Due to technical reasons, the download is limited to 6.000 entries.
sr: Услед техничких разлога, преузимање је ограничено на 6.000 уноса.

source: :docs:`System > API </api/intro.html>`
sr: :docs:`Систем > API </api/intro.html>`

source: :doc:`System > Core Workflows </system/core-workflows>`
sr: :doc:`Систем > Радни токови </system/core-workflows>`

source: :doc:`System > Monitoring </system/monitoring>`
sr: :doc:`Систем > Надгледање </system/monitoring>`

source: :doc:`🛡️ Admin <admin-permissions>`
sr: :doc:`🛡 администраторске <admin-permissions>`

source: :doc:`🕵️ Agent <agent-permissions>`
sr: :doc:`🕵 оператерске <agent-permissions>`

source: SLAs
sr: SLA

source: Bronze
sr: Бронзана

source: Gold
sr: Златна

source: Ticket
sr: Тикет

source: How Do Trigger Work
sr: Како окидачи уствари раде

source: Webhook
sr: Повратни позив

source: _`HTTP Basic Authentication Username`
sr: _`HTTP basic auth корисник`

source: _`HTTP Basic Authentication Password`
sr: _`HTTP basic auth лозинка`

source: _`Custom Payload`
sr: _`Прилагођени подаци`

source: Time event
sr: Временски догађај

source: Microsoft Teams Webhook Payload
sr: Садржај Microsoft Teams повратног позива

source: Webhook Payload
sr: Подаци повратног позива

source: Branding
sr: Брендинг

source: ticket
sr: тикет

source: service.
sr: језика.

source: tickets
sr: тикети

source: Ticket,
sr: Тикет,

source: Agent
sr: Оператер

source: Regex
sr: Регуларни израз

source: Parameter
sr: Параметар

source: name
sr: назив

source: variable
sr: променљива

source: Ticket > ID
sr: Тикет > ID

source: Logo
sr: Лого

source: **Application type**: Web application
sr: **Aplication type**: Web application

source: Name:
sr: Назив:

source: Redirect URI (optional):
sr: URI адреса преусмерења (опционо):

source: App ID:
sr: ID апликације:

source: App secret:
sr: Шифра апликације:

source: App Tenant ID:
sr: ID корисника апликације:

source: General settings
sr: Општа подешавања

source: Client type: OpenID Connect
sr: Врста клијента: OpenID Connect

source: Capability config
sr: Подешавање могућности

source: Client authentication: Off
sr: Аутентификација клијента: искључена

source: Authentication flow: Standard flow
sr: Ток аутентификације: стандардни

source: Login settings
sr: Подешавања пријаве

source: Valid redirect URIs: ``https://your.zammad.domain/auth/openid_connect/callback``
sr: Важеће URL адресе редирекције: ``https://your.zammad.domain/auth/openid_connect/callback``

source: Valid post logout redirect URIs: ``https://your.zammad.domain/*``
sr: Важеће URL адресе редирекције за одјаву: ``https://your.zammad.domain/*``

source: Web origins: ``+``
sr: Web порекла: ``+``

source: Identifier
sr: Идентификатор

source: Issuer
sr: Издавач

source: Scopes
sr: Опсези

source: Name identifier format
sr: Формат идентификатора назива

source: **SAML Attribute Name**
sr: **Назив SAML атрибута**

source: **SAML Attribute NameFormat**
sr: **Формат назива SAML атрибута**

source: Name Identifier Format: ``urn:oasis:names:tc:SAML:1.1:nameid-format:emailAddress``
sr: Формат идентификатора назива: ``urn:oasis:names:tc:SAML:1.1:nameid-format:emailAddress``

source: Fully Qualified Domain Name
sr: Квалификовани назив домена

source: Frontend
sr: Интерфејс

source: Geo IP Service
sr: Услуга географског IP

source: Ticket Hook Position
sr: Положај прикључка тикета

source: Core Workflows
sr: Радни токови

source: Operator
sr: Оператор

source: Trigger
sr: Окидач

source: Avatar
sr: Аватар

source: API Token
sr: API кључ

source: Sipgate has no english web interface which is why this documentation page is mixing up languages badly.
sr: Sipgate нема кориснички интерфејс на енглеском језику због чега ова страница лоше меша језике.

source: Software
sr: Софтвер

source: API token
sr: API кључ

source: Client ID
sr: Клијент ID

source: @Login
sr: @Пријави се

source: Monitoring API
sr: API надгледања

source: Name: *product*
sr: Назив: *product*

source: Display: *Product*
sr: Прикажи: *Производ*

source: When you're ready, submit your changes to save the object attribute.
sr: Када сте спремни, пошаљите своје измене да бисте сачували атрибут објекта.

source: Screencast showing how to re-position values on tree select like fields
sr: Снимак екрана који показује како да измените положај вредности у пољима избора стабла

source: Text
sr: Текст

source: Provides a select-like field with up to 6 layers of options. Does not allow setting a default value.
sr: Приказује поље избора са до 6 нивоа опција. Не омогућава постављање подразумеване вредности.

source: Provides a select-like field with up to 6 layers of options allowing the selection of multiple values. Does not allow setting a default value.
sr: Приказује поље избора са до 6 нивоа опција омогућавајући избор вишеструких вредности. Не омогућава постављање подразумеване вредности.

source: Browser
sr: Претраживач

source: FAQ
sr: Често постављана питања

source: Version
sr: Верзија
