Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: Action
de: Aktion
sr: Радња

source: An action based trigger always requires a ticket update to run. This can be an update by an agent or even internal system updates like updated SLA times. See the explanation below for more details.
de: Ein aktionsbasierter Trigger erfordert immer eine Ticket-Aktualisierung, um ausgeführt zu werden. Dies kann eine Aktualisierung durch einen Agent oder sogar interne Systemaktualisierungen wie aktualisierte SLA-Zeiten sein. Weitere Einzelheiten finden Sie in der nachstehenden Erklärung.
sr: Окидач радњи увек захтева освежавање тикета пре покретања. Ово може бити освежавање од стране оператера или чак интерно системско освежавање као ново SLA време. Погледајте објашњење испод за више детаља.

source: Selective
de: Selektiv
sr: Селективно

source: Checks if any attribute from the condition was updated. If yes, the trigger runs. If the attributes from the condition weren't touched, the trigger doesn't run.
de: Prüft, ob ein Attribut der Bedingung aktualisiert wurde. Wenn ja, wird der Trigger ausgeführt. Wenn die Attribute der Bedingung nicht berührt wurden, wird der Trigger nicht ausgeführt.
sr: Проверава да ли је атрибут из услова освежен. Уколико јесте, окидач ће бити покренут. Уколико атрибути из услова нису измењени, окидач неће бити покренут.

source: **Example:** A trigger with a condition for priority **1 low** will run if the ticket was changed to **1 low**.
de: **Beispiel:** Ein Trigger mit einer Bedingung für die Priorität **1 niedrig** wird ausgeführt, wenn das Ticket auf **1 niedrig** geändert wurde.
sr: **Пример:** Окидач са условом за приоритетом подешеним на **1 низак** ће бити покренут ако је приоритет тикета измењен на **1 низак**.

source: Always
de: Immer
sr: Увек

source: Checks if the current state of the ticket matches the condition. This means: the trigger always runs when the ticket is updated, no matter what was changed. This can lead to executing such a trigger more often.
de: Überprüft, ob der aktuelle Status des Tickets der Bedingung entspricht. Das bedeutet: Der Trigger wird immer dann ausgeführt, wenn das Ticket aktualisiert wird, unabhängig davon, was geändert wurde. Dies kann dazu führen, dass ein solcher Trigger häufiger ausgeführt wird.
sr: Проверава да ли се тренутно стање тикета подудара са условом. Ово значи да ће окидач увек бити покренут када је тикет освежен, без обзира на врсту измене. Ово може довести до честог извршавања таквог окидача.

source: **Example:** A trigger with a condition for priority **1 low** will run if the ticket was moved to another group while priority was set **1 low**.
de: **Beispiel:** Ein Trigger mit einer Bedingung für die Priorität **1 niedrig** wird ausgeführt, wenn das Ticket in eine andere Gruppe verschoben wurde, während die Priorität **1 niedrig** eingestellt war.
sr: **Пример:** Окидач са условом за приоритетом подешеним на **1 низак** ће бити покренут ако је тикет премештен у другу групу док је приоритет подешен на **1 низак**.

source: If in doubt, use **Selective**. The **Always** action activator can lead to unexpected behavior, e.g. the trigger runs after internal system changes of the ticket, which aren't visible in the ticket history.
de: Verwenden Sie im Zweifelsfall **Selektiv**. Die Aktions-Ausführung **Immer** kann zu unerwartetem Verhalten führen, z.B. wenn der Trigger nach systeminternen Änderungen des Tickets ausgeführt wird, die in der Ticket-Historie nicht sichtbar sind.
sr: Уколико нисте сигурни, користите **Селективно**. Активатор радњи **Увек** може довести до неочекиваног понашања, нпр. окидач ће бити покренут након интерних системских измена тикета, које нису видљиве у историјату тикета.

source: Time Event
de: Zeitereignis
sr: Временски догађај

source: The execution is triggered at a specific time when a certain event is reached, e.g. ticket pending time.
de: Das **Zeitereignis** wird ausgelöst, wenn ein bestimmtes Ereignis erreicht wird, z.B. die Wartezeit für ein Ticket.
sr: Извршавање се покреће у одређено време када се достигне одређени догађај, нпр. време чекања тикета.

source: This activator simply checks if **conditions** match. This is the same behavior as action-based activator's "always" mode.
de: Dieser Aktivator prüft lediglich, ob die **Bedingungen** zutreffen. Dies ist das gleiche Verhalten wie der "Immer"-Modus der aktionsbasierten Ausführung.
sr: Извршилац **временског догађаја** једноставно проверава да ли се **услови** подударају. Ово је исто понашање као и режим извршења „Увек“ заснованог на радњи.

source: When creating a trigger, choose activator here:
de: Wenn Sie einen Trigger erstellen, wählen Sie hier die Aktivierung:
sr: Када додате окидач, изаберите активацију овде:

source: Conditions
de: Bedingungen
sr: Услови

source: When creating a trigger, define your conditions here:
de: Wenn Sie einen Trigger erstellen, definieren Sie hier Ihre Bedingungen:
sr: Када додате окидач, одредите своје услове овде:

source: Trigger conditions must match as configured for the trigger to fire.
de: Die Trigger-Bedingungen müssen wie konfiguriert übereinstimmen, damit der Trigger ausgelöst wird.
sr: Подешени услови окидача морају да се подударају да би се окидач извршио.

source: When creating a trigger, define your changes here:
de: Wenn Sie einen Trigger erstellen, definieren Sie hier Ihre Änderungen:
sr: Када правите окидач, дефинишите своје измене овде:

source: Certain actions (such as *email*, *SMS* and *notes*) support :doc:`/misc/variables`, which can be used to build highly-customized message templates.
de: Bestimmte Aktionen (z.B. *E-Mail*, *SMS* und *Notizen*) unterstützen :doc:`/misc/variables`, die zur Erstellung individueller Nachrichten verwendet werden können.
sr: Одређене радње (као што су *имејл*, *SMS* и *напомена*) подржавају :doc:`променљиве </misc/variables>`, које се могу користити за израду високо прилагођених шаблона порука.

source: A trigger can do the following things once its conditions have been met:
de: Ein Trigger kann folgende Änderungen vornehmen, wenn seine Bedingungen erfüllt sind:
sr: Окидач може да уради следеће ствари када се испуне његови услови:

source: Modify the ticket
de: Ändern des Tickets
sr: Измена тикета

source: Examples: escalate its priority, close it, reassign it, rename it, add tags, subscribe and unsubscribe specific/all users, etc.
de: Beispiele: seine Priorität erhöhen, es schließen, es neu zuweisen, es umbenennen, Tags hinzufügen, abonnieren und abbestellen von Benachrichtigungen für einzelne/alle Benutzer usw.
sr: Примери: ескалирајте приоритет, затворите га, поново доделите, промените назив, додајте ознаке, претплатите и откажите претплату за одређене/све кориснике, итд.

source: Date & time attributes (like **Pending till**) can be specified in *absolute* or *relative* terms.
de: Datums- und Zeitattribute (wie **warten auf Erinnerung**) können *absolut* oder *relativ* angegeben werden.
sr: Атрибути датума и времена (као што је **На чекању до**) се могу навести у *апсолутним* или *релативним* терминима.

source: You can also combine static text with placeholders for text fields. Remember that the placeholders' values have to be known during trigger runtime. Learn more about :doc:`/misc/variables`.
de: Sie können auch statischen Text mit Platzhaltern für Textfelder kombinieren. Beachten Sie, dass die Werte der Platzhalter zum Ausführungszeitpunkt des Triggers bekannt sein müssen. Erfahren Sie mehr über :doc:`/misc/variables`.
sr: Такође можете комбиновати статички текст са предефинисаним вредностима за текстуална поља. Запамтите да предефинисане вредности морају бити познате током времена извршавања окидача. Сазнајте више о :doc:`/misc/variables`.

source: Send an email or SMS
de: Eine E-Mail oder SMS senden
sr: Пошаљите имејл или SMS

source: Either to the customer, the agent who owns the ticket, or every agent in the system.
de: Entweder an den Kunden, den Agent, dem das Ticket gehört, oder an alle Agenten im System.
sr: Клијенту, оператеру који поседује карту или сваком оператеру у систему.

source: Sending emails allows you to include the attachments of the triggering article if required.
de: Beim Versenden von E-Mails können Sie bei Bedarf die Anhänge des auslösenden Artikels einfügen.
sr: Слање имејла вам омогућава да по потреби укључите прилоге окидајућег чланка.

source: In order to send emails with triggers, you need to configure an email address for the group, the trigger is working in. If you don't, Zammad will skip the trigger completely.
de: Um E-Mails mit Triggern zu versenden, müssen Sie eine E-Mail-Adresse für die Gruppe konfigurieren, in der der Trigger arbeitet. Wenn Sie das nicht tun, überspringt Zammad die Ausführung des Triggers.
sr: Да бисте слали имејл поруке окидачима, морате да подесите имејл адресу за групу у којој окидач ради. Ако то не учините, Zammad ће у потпуности прескочити окидач.

source: :doc:`Fire a webhook </manage/webhook>`
de: :doc:`Einen Webhook auslösen </manage/webhook>`
sr: :doc:`Покрените повратни позив </manage/webhook>`

source: Connect Zammad to another web service or application to give it live updates about new tickets.
de: Verbinden Sie Zammad mit einem anderen Webdienst oder einer Anwendung, um Live-Updates über neue Tickets zu erhalten.
sr: Повежите Zammad са другим веб сервисом или апликацијом да бисте га обавестили о новим тикетима уживо.

source: Add internal or public notes to the ticket
de: Interne oder öffentliche Notizen zu Tickets hinzufügen
sr: Додајте интерне или јавне напомене у тикет

source: This allows you to help your agents with specific information if needed. (e.g. automated changes a trigger applied to the ticket)
de: So können Sie Ihre Mitarbeiter bei Bedarf mit spezifischen Informationen unterstützen (z.B. automatische Änderungen, die ein Trigger ausgeführt hat).
sr: Ово вам омогућава да својим оператерима помогнете са одређеним информацијама ако је потребно (нпр. аутоматске промене примењеног окидача на тикет).

source: :doc:`Run an AI agent </ai/ai-agents>`
de: doc:`Ausführen eines KI-Agenten </ai/ai-agents>`

source: Trigger an AI agent to run using triggers.
de: Starten Sie einen KI-Agenten mit Hilfe von Triggern.

source: Localization of Execution Changes
de: Sprache für ausgeführte Aktionen
sr: Локализација при извршавању радње

source: The system locale and timezone predefines a default format of date and timestamp replacement variables. These settings are customizable for triggers.
de: Die Sprache und die Zeitzone legen ein Format für Datums- und Zeitstempel fest, die bei Verwendung von Zeit-/Datums-Variablen ausgegeben werden. Diese Einstellungen sind für Trigger anpassbar.
sr: Језик и временска зона система одређују подразумевани формат датума и времена приликом замене вредности променљивих. Ова подешавања могу бити прилагођена за окидаче.

source: Screenshot showing localization section of trigger dialog
de: Screenshot zeigt Sprachanpassung im Trigger-Dialog
sr: Снимак екрана који приказује одељак локализација дијалога окидача

source: Best practice is to create single separated localized triggers for each language/timezone and execute them based on user or organization attributes.
de: Es empfiehlt sich, für jede Sprache/Zeitzone einen eigenen angepassten Trigger zu erstellen und diesen auf der Grundlage von Benutzer- oder Organisationsattributen auszuführen.
sr: Најбоља пракса је да се додају појединачни окидачи за сваки језик/временску зону и да се извршавају на основу атрибута корисника или организације.

source: The format and timezone of date and timestamp replacement variables is customizable by the use of the ``dt()`` method. Further on the ``t()`` method can be used to translated string replacement variables according to the selected locale language.
de: Das Format und die Zeitzone von Datums- und Zeitstempel-Variablen ist durch die Verwendung der Methode ``dt()`` anpassbar. Außerdem kann die Methode ``t()`` verwendet werden, um Text-Variablen entsprechend der gewählten Sprache zu übersetzen.
sr: Формат и временска зона вредности променљивих датума и временских ознака може да се прилагоди коришћењем ``dt()`` функције. Додатно, коришћењем ``t()`` функције може се превести вредност променљиве према одабраном језику.

source: For usage of the ``t()`` and ``dt()`` method, please follow the instructions in the :ref:`variables section <variable_localization>`.
de: Für die Verwendung der ``t()`` und ``dt()`` Methoden folgen Sie bitte den Anweisungen im Bereich :ref:`Variablen <variable_localization>``.
sr: За пример коришћења ``t()`` и``dt()`` функције, пратите упутства у :ref:`одељку о променљивама <variable_localization>`.

source: Trigger Examples
de: Trigger-Beispiele
sr: Примери окидача

source: To get you up and running quickly, here are some examples of the kinds of automation tasks you can set up with triggers.
de: Damit Sie schnell loslegen können, finden Sie hier einige Beispiele für Automatisierungen, die Sie mithilfe von Triggern einrichten können.
sr: Да бисмо вам брзо помогли, ево неколико примера врста задатака аутоматизације које можете подесити помоћу окидача.

source: To learn about triggers in detail, first go to :doc:`/manage/trigger/how-do-they-work`.
de: Um mehr über Trigger im Detail zu erfahren, schauen Sie sich zuerst :doc:`/manage/trigger/how-do-they-work` an.
sr: Да бисте сазнали више о окидачима, прво посетите :doc:`/manage/trigger/how-do-they-work`.

source: Any time Jacob Smith creates a ticket, assign it to the Sales group:
de: Jedes Mal, wenn Jacob Smith ein Ticket erstellt, soll es der Gruppe "Sales" zugewiesen werden:
sr: Сваки пут када Jacob Smith отвори тикет, додели је Sales групи:

source: Emma Taylor is responsible for all sales internally, so if a new ticket has the word "order" in the subject, assign it to her and make sure it's set with a high priority:
de: Emma Taylor ist intern für alle Verkäufe zuständig. Wenn also ein neues Ticket das Wort "Order" im Betreff hat, soll es ihr zugewiesen und mit hoher Priorität versehen werden:
sr: Emma Taylor је одговорна за сву продају интерно, па ако нов тикет има реч „order“ у теми, доделите јој га и уверите се да је постављен на високи приоритет:

source: Send an auto-reply email to any customer who creates a ticket via web, if the detected language is English:
de: Senden Sie eine E-Mail mit einer automatischen Antwort an jeden Kunden, der ein Ticket über das Internet erstellt, wenn die erkannte Sprache Englisch ist:
sr: Пошаљите имејл са аутоматским одговором *сваком клијенту* који отвори тикет преко веб канала, уколико је откривени језик енглески:

source: 📨 **Not all automated messages come from triggers!**
de: 📨 **Nicht alle automatischen Emails kommen von Triggern!**
sr: 📨 **Не долазе све аутоматске поруке од окидача!**

source: For instance, when *agents* receive a system email about a newly created ticket, that's built into the system itself. If you need to customize those, you will have to :doc:`manually edit files on your server </manage/trigger/system-notifications>`.
de: Wenn z.B. *Agenten* eine System-E-Mail über ein neu erstelltes Ticket erhalten, ist das im System selbst eingebaut. Wenn Sie diese anpassen möchten, müssen Sie :doc:`Dateien auf Ihrem Server manuell bearbeiten </manage/trigger/system-notifications>`.
sr: На пример, када *оператери* добију системско обавештење о новоотвореном тикету, механизам је уграђен у сам систем. Ако треба да их прилагодите, мораћете да :doc:`ручно уредите датотеке на свом серверу </manage/trigger/system-notifications>`.

source: Triggers are one way of automated actions. In addition, there are also :doc:`scheduler </manage/scheduler>` and :doc:`postmaster filter </channels/email/filters>` based automation. Make sure to have a look at those, too. They can be more suitable, depending on your use case.
de: Trigger sind eine Möglichkeit zur Automatisierung von Aktionen. Darüber hinaus gibt es auch :doc:`automatisierungs- </manage/scheduler>` und :doc:`E-Mail-Filter </channels/email/filters>` basierte Aktionen. Werfen Sie auch einen Blick darauf, sie können je nach Anwendungsfall besser geeignet sein.
sr: Окидачи су један начин аутоматизованих радњи. Додатно, постоји и аутоматизација на основу :doc:`планера </manage/scheduler>` и :doc:`постмастер филтера </channels/email/filters>`. У зависности од ваших потреба, могу бити корисније.

source: Limitations of triggers:
de: Einschränkungen von Triggern:
sr: Ограничења окидача:

source: Triggers are executed when a ticket is updated via clicking the "Update" button. Changing a value without updating the ticket (e.g. setting a tag) will not execute the trigger.
de: Trigger werden ausgeführt, wenn ein Ticket durch Klicken auf die Schaltfläche "Aktualisieren" aktualisiert wird. Das Ändern eines Wertes ohne Aktualisierung des Tickets (z.B. das Setzen eines Tags) führt den Trigger nicht aus.
sr: Окидачи се извршавају када је тикет освежен кликом на дугме „Освежи”. Птомена вредности без освежавања тикета (нпр. додавање ознаке) неће извршити окидач.

source: Triggers are always affecting the last article of a ticket. This means you can't run triggers based on older articles.
de: Trigger wirken sich immer auf den letzten Artikel eines Tickets aus. Das bedeutet, dass Sie keine Trigger basierend auf älteren Artikeln ausführen können.
sr: Окидачи се увек односе на последњи чланак тикета. Ово значи да не можете извршити окидаче на основу старијих чланака.

source: Triggers always handle the current ticket attributes and the article (if applicable) that causes the trigger to fire. A related object context might not be available for performing changes.
de: Trigger betreffen immer die aktuellen Ticket-Attribute und den Artikel (falls zutreffend), der den Trigger auslöst. Ein verwandter Objektkontext ist möglicherweise nicht für die Durchführung von Änderungen verfügbar.
sr: Окидачи увек обрађују тренутне атрибуте тикета и чланка (уколико постоји) који покрећу извршавање окидача. Контекст повезаног објекта можда неће бити доступан приликом извршавања измена.

source: System Notifications
de: System-Benachrichtigungen
sr: Системска обавештења

source: System notifications can only be customized on **self-hosted installations**.
de: Systembenachrichtigungen können nur bei **selbst gehosteten Installationen** angepasst werden.
sr: Системска обавештења могу да се прилагођавају само на **инсталацијама које сами хостујете**.

source: Unlike the automated emails you can set up using :doc:`/manage/trigger` or the :doc:`/manage/scheduler`, these notifications are built into Zammad itself: if you need to customize them, you will have to modify some of the files on your server.
de: Im Gegensatz zu den automatischen E-Mails, die Sie mit :doc:`/manage/trigger` oder :doc:`/manage/scheduler` einrichten können, sind diese Benachrichtigungen in Zammad selbst eingebaut: Wenn Sie sie anpassen möchten, müssen Sie einige Dateien auf Ihrem Server ändern.
sr: За разлику од аутоматизованих имејл порука које можете да подесите помоћу :doc:`окидача </manage/trigger>` или :doc:`планера </manage/scheduler>`, ова обавештења су уграђена у сам Zammad: ако треба да их прилагодите, мораћете да измените неке од датотека на вашем серверу.

source: When Are They Sent?
de: Wann werden sie gesendet?
sr: Када се шаљу?

source: **All users** are notified about:
de: **Alle Benutzer** werden über folgendes benachrichtigt:
sr: **Сви корисници** се обавештавају о:

source: Password change requests
de: Anfragen zum Ändern des Passworts
sr: Захтевима за промену лозинке

source: :ref:`automatic-account-linking-notification` on initial login
de: :ref:`automatic-account-linking-notification` bei der ersten Anmeldung
sr: :ref:`аутоматском повезивању налога <automatic-account-linking-notification>` при првој пријави

source: **Staff (admins & agents)** are notified of:
de: **Mitarbeiter (Admins & Agenten)** werden benachrichtigt:
sr: **Особље (администратори и оператери)** добијају обавештења о:

source: Logins from a new device
de: Logins von neuen Geräten
sr: Пријавама са новог уређаја

source: Logins from a new country
de: Logins von neuen Ländern
sr: Пријавама из нове земље

source: **Agents** are notified about:
de: **Agenten** werden benachrichtigt über:
sr: **Оператери** се обавештавају о:

source: New tickets
de: Neue Tickets
sr: Новим тикетима

source: Ticket updates
de: Ticket-Aktualisierungen
sr: Освежавању тикета

source: "Ticket pending" reminders
de: "Warten auf ..." Erinnerungen
sr: Достизању подсетника за „тикете на чекању“

source: SLA violations (before and after the deadline)
de: SLA-Verstöße (vor und nach der Frist)
sr: Кршења SLA (пре и после рока)

source: Agents can change their notification settings in their :user-docs:`user profile </extras/profile-and-settings.html>`.
de: Agenten können ihre Benachrichtigungseinstellungen in ihrem :user-docs:`Benutzerprofil </extras/profile-and-settings.html>` ändern.
sr: Оператери могу да промене подешавања обавештења преко њиховог :user-docs:`корисничког профила </extras/profile-and-settings.html>`.

source: Daily reminder emails are sent at midnight (of the Zammad system timezone) for all unresolved "ticket pending" reminders and SLA violations.
de: Tägliche Erinnerungs-E-Mails werden um Mitternacht (in der Zeitzone des Zammad-Systems) für alle "Warten auf ..."-Erinnerungen und SLA-Verstöße gesendet.
sr: Дневне имејл поруке са подсетницима се шаљу у поноћ (Zammad системске временске зоне) за све нерешене подсетнике „тикета на чекању“ и кршења SLA.

source: How Can I Customize Them?
de: Wie kann ich sie anpassen?
sr: Како могу да их прилагодим?

source: Inside your Zammad directory (usually ``/opt/zammad``), email templates for various events are stored inside the ``/app/views/mailer`` directory, named according to the language they're written in. Thus, ::
de: Innerhalb Ihres Zammad-Verzeichnisses (normalerweise ``/opt/zammad``) werden E-Mail-Vorlagen für verschiedene Ereignisse im Verzeichnis ``/app/views/mailer`` gespeichert, benannt nach der Sprache, in der sie geschrieben sind. Also ::
sr: Унутар вашег Zammad директоријума (обично ``/opt/zammad``), шаблони имејл порука за различите догађаје се чувају у директоријуму ``/app/views/mailer``, названи према језику на којем су написани::

source: is the German-language template used to notify agents whenever a new ticket is created. To modify this template, create another file with the same name and add a ``.custom`` suffix::
de: ist die deutschsprachige Vorlage, die verwendet wird, um Agenten zu benachrichtigen, wenn ein neues Ticket erstellt wird. Um diese Vorlage zu ändern, erstellen Sie eine weitere Datei mit demselben Namen und fügen Sie die Endung ``.custom`` hinzu::
sr: је шаблон на немачком језику који се користи за обавештавање оператера кад год се отвори нов тикет. Да бисте изменили овај шаблон, направите другу датотеку са истим именом и додајте ``.custom`` суфикс::

source: Now, this file will be used instead of the original when sending notification emails in German.
de: Diese Datei wird nun beim Versand von Benachrichtigungs-E-Mails auf Deutsch anstelle der Originaldatei verwendet.
sr: Сада ће се ова датотека користити уместо оригиналне приликом слања имејл порука са обавештењима на немачком.

source: Users
de: Benutzer
sr: Корисници

source: Users can be managed individually via UI, via API or even synchronized with third-party directory services.
de: Benutzer können individuell über die Benutzeroberfläche, über die API oder sogar per Synchronisierung mit Verzeichnisdiensten von Drittanbietern verwaltet werden.
sr: Корисницима се може управљати појединачно путем корисничког интерфејса, преко API-ја или чак синхронизовати са услугама директоријума трећег лица.
