Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: :doc:`Manage > Groups </manage/groups/index>`
de: :doc:`Verwalten > Gruppen </manage/groups/index>`
sr: :doc:`Управљање > Групе </manage/groups/index>`

source: :doc:`System > Integrations </system/integrations/index>`
de: :doc:`System > Integrationen </system/integrations/index>`
sr: :doc:`Систем > Интеграције </system/integrations/index>`

source: :doc:`Manage > Knowledge Base </manage/knowledge-base>`
de: :doc:`Verwalten > Knowledge Base </manage/knowledge-base>`
sr: :doc:`Управљање > База знања </manage/knowledge-base>`

source: Accessing knowledge base to read/edit articles: ``knowledge_base.reader``
de: Zugriff auf die Knowledge Base zum Lesen/Bearbeiten von Artikeln: ``knowledge_base.reader``
sr: Приступ бази знања за читање/уређивање чланака: ``knowledge_base.reader``

source: and ``knowledge_base.editor``
de: und ``knowledge_base.editor``
sr: и ``knowledge_base.editor``

source: Make sure to double-check the answer's :user-docs:`visibility </extras/knowledge-base.html#editing-answers>`.
de: Stellen Sie sicher, dass Sie die :user-docs:`Sichtbarkeit </extras/knowledge-base.html#editing-answers>` in der Antwort überprüfen.
sr: Проверите још једном :user-docs:`видљивост чланака </extras/knowledge-base.html#editing-answers>`.

source: :doc:`Manage > Macros </manage/macros>`
de: :doc:`Verwalten > Makros</manage/macros>`
sr: :doc:`Управљање > Макрои </manage/macros>`

source: In some cases, macros may also require ``admin.tag``
de: In einigen Fällen erfordern Makros möglicherweise auch die Berechtigung ``admin.tag``
sr: У неким случајевима, макрои могу такође захтевати ``admin.tag``

source: :doc:`System > Maintenance </system/maintenance>`
de: :doc:`System > Wartung </system/maintenance>`
sr: :doc:`Систем > Одржавање </system/maintenance>`

source: :doc:`System > Objects </system/objects>`
de: :doc:`System > Objekte </system/objects>`
sr: :doc:`Систем > Објекти </system/objects>`

source: :doc:`Manage > Organizations </manage/organizations/index>`
de: :doc:`Verwalten > Organisationen </manage/organizations/index>`
sr: :doc:`Управљање > Организације </manage/organizations/index>`

source: Agents can access existing organizations
de: Agenten können auf bestehende Organisationen zugreifen
sr: Оператери могу приступити постојећим организацијама

source: from the search bar, even without this permission.
de: über die Suchleiste, auch ohne diese Erlaubnis.
sr: из траке за претрагу, чак и без ове дозволе.

source: They can even edit an organization's name, domain, and notes!
de: Sie können sogar den Namen, die Domain und die Notizen einer Organisation bearbeiten!
sr: Могу чак изменити назив, домен и напомену организације!

source: :doc:`Manage > Overviews</manage/overviews>`
de: :doc:`Verwalten > Übersichten </manage/overviews>`
sr: :doc:`Управљање > Прегледи </manage/overviews>`

source: :doc:`System > Packages </system/packages>`
de: :doc:`System > Pakete </system/packages>`
sr: :doc:`Систем > Пакети </system/packages>`

source: :doc:`Manage > Public Links </manage/public-links>`
de: doc:`Verwalten > Öffentliche Links </manage/public-links>`
sr: :doc:`Управљање > Јавни линкови </manage/public-links>`

source: :doc:`Manage > Report Profiles </manage/report-profiles>`
de: :doc:`Verwalten > Report-Profile </manage/report-profiles>`
sr: :doc:`Управљање > Профили извештаја </manage/report-profiles>`

source: Access to view reports: ``report``
de: Zugang zu Berichten: ``report``
sr: Приступ за преглед извештаја: ``report``

source: :doc:`Manage > Roles </manage/roles/index>`
de: doc:`Verwalten > Rollen </manage/roles/index>`
sr: :doc:`Управљање > Улоге </manage/roles/index>`

source: :doc:`Manage > Scheduler </manage/scheduler>`
de: doc:`Verwalten > Automatisierung </manage/scheduler>`
sr: :doc:`Управљање > Планер </manage/scheduler>`

source: For automation on tickets
de: Für die Automatisierung von Tickets
sr: За аутоматизацију тикета

source: :doc:`Settings > Security </settings/security>`
de: :doc:`Einstellungen > Sicherheit </settings/security>`
sr: :doc:`Подешавања > Безбедност </settings/security>`

source: Settings of Zammad. This also covers third party authentications.
de: Einstellungen von Zammad. Dies gilt auch für die Authentifizierung über Drittanbietern.
sr: подешавања Zammad-а. Ово такође покрива аутентификацију преко трећег лица.

source: :doc:`System > Sessions </system/sessions>`
de: :doc:`System > Sitzungen </system/sessions>`
sr: :doc:`Систем > Сесије </system/sessions>`

source: :doc:`Manage > SLAs </manage/slas/index>`
de: :doc:`Verwalten > SLAs </manage/slas/index>`
sr: :doc:`Управљање > SLA </manage/slas/index>`

source: :doc:`Settings > System </settings/system/index>`
de: :doc:`Einstellungen > System </settings/system/index>`
sr: :doc:`Подешавања > Систем </settings/system/index>`

source: :doc:`System > System Report </system/system-report>`
de: :doc:`System > System-Bericht </system/system-report>`
sr: :doc:`Систем > Системски извештај </system/system-report>`

source: :doc:`Manage > Tags </manage/tags>`
de: :doc:`Verwalten > Tags </manage/tags>`
sr: :doc:`Управљање > Ознаке </manage/tags>`

source: :doc:`Manage > Templates </manage/templates>`
de: :doc:`Verwalten > Textbausteine </manage/templates>`
sr: :doc:`Управљање > Шаблони </manage/templates>`

source: :doc:`Manage > Text Modules </manage/text-modules>`
de: :doc:`Verwalten > Textbausteine </manage/text-modules>`
sr: :doc:`Управљање > Текстуални исечци </manage/text-modules>`

source: :doc:`Settings > Tickets </settings/ticket>`
de: :doc:`Einstellungen > Tickets </settings/ticket>`
sr: :doc:`Подешавања > Тикети </settings/ticket>`

source: Does not grant access to :doc:`/misc/composer`
de: Gewährt keinen Zugriff auf :doc:`/misc/composer`
sr: Не дозвољава приступ :doc:`/misc/composer`

source: :ref:`Settings > Ticket > Auto Assignment <auto_assignment>`
de: :ref:`Einstellungen > Ticket > Automatische Zuweisung <auto_assignment>`
sr: :ref:`Подешавања > Тикет > Аутоматска додела тикета <auto_assignment>`

source: :ref:`Settings > Ticket > Duplicate Detection <duplicate_detection>`
de: :ref:`Einstellungen > Ticket > Duplikaterkennung <duplicate_detection>`
sr: :ref:`Подешавања > Тикет > Откривање дупликата <duplicate_detection>`

source: :ref:`System > Objects >Ticket Priority <ticket-priority-reference>`
de: :ref:`System > Objekte >Ticket-Priorität <ticket-priority-reference>`
sr: :ref:`Систем > Објекти >Приоритет тикета <ticket-priority-reference>`

source: :ref:`System > Objects >Ticket State <ticket-state-reference>`
de: :ref:`System > Objekte >Ticket-Status <ticket-state-reference>`
sr: :ref:`Систем > Објекти > Стање тикета <ticket-state-reference>`

source: :doc:`Manage > Time Accounting </manage/time-accounting>`
de: :doc:`Verwalten > Zeiterfassung </manage/time-accounting>`
sr: :doc:`Управљање > Обрачун времена </manage/time-accounting>`

source: Also allows the export of timekeeping records.
de: Ermöglicht auch den Export von Zeiterfassungsdaten.
sr: Такоће омогућује извоз уноса обрачуна времена.

source: :doc:`System > Translations </system/translations>`
de: :doc:`System > Übersetzungen </system/translations>`
sr: :doc:`Систем > Преводи </system/translations>`

source: Also enables inline translation
de: Ermöglicht auch Inline-Übersetzung
sr: Такође омогућује непосредне преводе

source: :doc:`Manage > Triggers </manage/trigger>`
de: :doc:`Verwalten > Trigger </manage/trigger>`
sr: :doc:`Управљање > Окидачи </manage/trigger>`

source: :doc:`Manage > Users </manage/users/index>`
de: :doc:`Verwalten > Benutzer </manage/users/index>`
sr: :doc:`Управљање > Корисници </manage/users/index>`

source: Independent from this permission, agents can create and edit
de: Unabhängig von dieser Berechtigung können Agenten
sr: Независно од ове дозволе, оператери могу додавати и уређивати

source: customers, but they can't modify permission etc.
de: Kunden erstellen und ändern, aber keine Berechtigungen, etc.
sr: клијенте, али не могу мењати њихове дозволе и сл.

source: 🏴‍☠️ This permission allows users to :ref:`hijack other user sessions <view-from-users-perspective>` .
de: 🏴‍☠️ Mit dieser Berechtigung können Benutzer :ref:`die Sitzungen anderer Benutzer übernehmen <view-from-users-perspective>` .
sr: 🏴‍☠ Ова дозвола омогућава корисницима :ref:`преотму сесије других корисника <view-from-users-perspective>`.

source: :doc:`Manage > Webhook </manage/webhook>`
de: doc:`Verwalten > Webhook </manage/webhook>`
sr: :doc:`Управљање > Повратни позив </manage/webhook>`

source: Agent Permissions
de: Agenten-Berechtigungen
sr: Дозволе оператера

source: The permissions listed on this page grant access to features that have to be enabled or configured system-wide in the Admin Panel first.
de: Die auf dieser Seite aufgeführten Berechtigungen gewähren Zugriff auf Funktionen, die zunächst systemweit im Admin-Panel aktiviert oder konfiguriert werden müssen.
sr: Дозволе наведене на овој страници дају приступ функцијама које прво морају бити укључене или подешене на целом систему путем административног панела.

source: Agent permissions in the New Role dialog
de: Agentenberechtigungen im Dialogfeld "Neue Rolle“
sr: Дозволе оператера у дијалогу нове улоге

source: Agent permissions are shown in the middle of the New Role dialog...
de: Agenten-Berechtigungen werden in der Mitte im Dialogfeld "Neue Rolle“ angezeigt ...
sr: Дозволе оператера су приказане при средини дијалога нове улоге…

source: Sidebar tabs: Overviews, Knowledge Base, Customer Chat, Phone
de: Tabs in der Seitenleiste: Übersichten, Knowledge Base, Kundenchat, Telefon
sr: Језичци на бочној траци: Прегледи, База знања, Клијент ћаскање, Позив

source: ...and give users access to new sidebar tabs for communicating with customers.
de: ...und geben Benutzern Zugriff auf neue Seitenleisten-Tabs für die Kommunikation mit Kunden.
sr: ...и даје корисницима приступ новим језичцима бочне траке за комуникацију са клијентима.

source: :user-docs:`Customer Chat </extras/chat.html>`
de: :user-docs:`Kunden-Chat </extras/chat.html>`
sr: :user-docs:`Клијент ћаскање </extras/chat.html>`

source: Requires configuration of :doc:`Chat Channel </channels/chat>`
de: Erfordert die Konfiguration des :doc:`Chat-Kanals </channels/chat>`
sr: Захтева подешавање :doc:`канала за ћаскање </channels/chat>`

source: :user-docs:`Caller Log </extras/caller-log.html>`
de: :user-docs:`Anruferprotokoll </extras/caller-log.html>`
sr: :user-docs:`Евиденција позива </extras/caller-log.html>`

source: Configuration of a CTI integration is required
de: Konfiguration einer CTI-Integration ist erforderlich
sr: Захтева подешену CTI интеграцију

source: Create/edit privileges
de: Berechtigungen zum Erstellen/Bearbeiten
sr: Дозволе додавања/уређивања

source: Editor permissions always include reader permissions.
de: Die Editor-Berechtigung beinhaltet immer auch die Lese-Berechtigungen.
sr: Дозволе уредника увек укључују дозволе читаоца.

source: Read privileges for internal content
de: Leserechte für interne Inhalte
sr: Дозволе прегледа интерног садржаја

source: Public articles are always visible.
de: Öffentliche Artikel sind immer sichtbar.
sr: Јавни чланци су увек видљиви.

source: See :user-docs:`here </extras/knowledge-base.html#granular-category-permissions>` how to set up granular reader permissions for the knowledge base.
de: Siehe :user-docs:`hier </extras/knowledge-base.html#granular-category-permissions>`, wie man granulare Leseberechtigungen für die Knowledge Base einrichtet.
sr: Прочитајте :user-docs:`овде </extras/knowledge-base.html#granular-category-permissions>` како да подесите грануларне дозволе читаоца за базу знања.

source: Keep in mind that this may be dangerous, as reader permission provides
de: Denken Sie daran, dass dies gefährlich sein kann, da die Leseberechtigung
sr: Имајте на уму да ово може бити опасно, јер дозвола читаоца омогућава

source: access to internal answers!
de: Zugriff auf interne Antworten beinhalten!
sr: приступ интерним чланцима!

source: :doc:`Reporting </manage/report-profiles>`
de: doc:`Berichte </manage/report-profiles>`
sr: :doc:`Извештавање </manage/report-profiles>`

source: Make sure to never grant this permission to your customers!
de: Stellen Sie sicher, dass Sie Ihren Kunden diese Erlaubnis nicht erteilen!
sr: Никада не дајте ову дозволу својим клијентима!

source: Giving customers access to reporting constitutes a serious data breach, as
de: Den Kunden die Berechtigung für Berichte zu geben stellt einen Datenschutzverstoß dar, da
sr: Давање приступа корисницима извештавању представља озбиљну повреду сигурности података, јер

source: it includes **all ticket and user information across the entire system**!
de: dadurch **alle Ticket- und Benutzerinformationen** eingesehen werden können !
sr: укључује **све информације о тикетима и корисницима из целог система**!

source: Please also note:
de: Bitte beachten Sie auch:
sr: Такође имајте на уму:

source: 1. the feature it enables is not for communicating with customers;
de: 1. Die Funktion dient nicht der Kommunikation mit Kunden;
sr: 1. функција коју омогућава није за комуникацију са клијентима;

source: 2. the button appears at the *bottom* of the sidebar; and
de: 2. die Schaltfläche erscheint am *unteren* Rand der Seitenleiste; und
sr: 2. дугме се појављује при *дну* бочне траке; и

source: 3. it is typically reserved for admins and supervisors.
de: 3. Sie ist in der Regel Admins und Teamleitern vorbehalten.
sr: 3. обично је резервисана за администраторе и супервизоре.

source: :user-docs:`(Agent) Overviews </basics/find-ticket/browse.html>`
de: :user-docs:`(Agenten) Übersichten </basics/find-ticket/browse.html>`
sr: :user-docs:`Прегледи (оператера) </basics/find-ticket/browse.html>`

source: See notes below
de: Siehe Anmerkungen unten
sr: Погледајте напомене испод

source: 🤔 **What about this table under the permissions tree?**
de: 🤔 **Was ist mit dieser Tabelle unter dem Berechtigungsbaum?**
sr: 🤔 **Шта ова табела тражи овде испод стабла дозвола?**

source: Group permission table in Edit Role dialog
de: Tabelle mit Gruppenberechtigung im Rollenbearbeitungsdialog
sr: Табела групних дозвола у дијалогу уређивања улоге

source: Roles can also include :doc:`group permissions </manage/groups/access-levels>`! The group permission table is shown when there is **more than one active group** in the system and ``ticket.agent`` permission **is selected**.
de: Rollen können auch :doc:`Gruppenberechtigungen </manage/groups/access-levels>` enthalten! Die Tabelle der Gruppenberechtigungen wird angezeigt, wenn **mehr als eine aktive Gruppe** im System vorhanden ist und die Berechtigung ``ticket.agent`` **ausgewählt ist**.
sr: Улоге такође укључују :doc:`групне дозволе </manage/groups/access-levels>`! Табела групних дозвола је приказана ако постоји **више од једне активне групе** у систему и **одабрана је** дозвола ``ticket.agent``.

source: You can assign both agent and customer roles to the same user — but you **can't** assign both ``ticket.agent`` and ``ticket.customer`` *permissions* to the same *role!*
de: Sie können demselben Benutzer sowohl die Rolle "Agent" als auch die Rolle "Kunde" zuweisen - aber Sie **können nicht** der gleichen Rolle gleichzeitig die *Berechtigungen* für "Ticket.agent" und "Ticket.customer" zuweisen!
sr: Можете доделити улоге и оператера и клијента истом кориснику — али **не можете** доделити и ``ticket.agent`` и ``ticket.customer`` *дозволе* истој *улози!*

source: To make it work, you need two separate roles: one with ``ticket.agent`` and the other with ``ticket.customer``.
de: Damit das funktioniert, brauchen Sie zwei getrennte Rollen: eine mit ``ticket.agent`` und die andere mit ``ticket.customer``.
sr: Да бисте то постигли, потребне су вам две одвојене улоге: једна са ``ticket.agent`` и друга са ``ticket.customer``.

source: Roles
de: Rollen
sr: Улоге

source: If you're already using Zammad, you'll know that users can be **admins**, **agents**, or **customers**. These are Zammad's built-in roles, and they're the tip of the iceberg of its powerful, flexible, and fine-grained permission system.
de: Wenn Sie Zammad bereits benutzen, werden Sie wissen, dass Benutzer **Administratoren**, **Agenten** oder **Kunden** sein können. Dies sind die eingebauten Rollen von Zammad, das mit einem leistungsstarken, flexiblen und feinkörnigen Berechtigungssystem ausgestattet ist.
sr: Ако већ користите Zammad, знате да корисници могу бити **администратори**, **оператери** или **клијенти**. Ово су Zammad-ове подразумеване улоге, и оне су врх леденог брега његовог моћног, флексибилног и прецизног система дозвола.

source: Role overview within Zammad's admin settings.
de: Rollenübersicht in den Einstellungen von Zammad.
sr: Преглед улога у оквиру Zammad-ових администраторских подешавања.

source: Assign user privileges in the Admin Panel, under **Manage > Roles**.
de: Vergeben Sie Benutzerrechte im Admin Panel unter **Verwalten > Rollen**.
sr: Доделите привилегије корисника преко административног панела, под **Управљање > Улоге**.

source: 💡 **LDAP/Active Directory users:**
de: 💡 **LDAP/Active Directory-Benutzer:**
sr: 💡 **Корисници LDAP/активног директоријума:**

source: Syncing your LDAP "groups" to Zammad roles can make access management *way* easier. To learn more, see :doc:`/system/integrations/ldap/index`.
de: Die Synchronisierung Ihrer LDAP-"Gruppen" mit Zammad-Rollen kann die Zugriffsverwaltung *sehr* vereinfachen. Um mehr zu erfahren, siehe :doc:`/system/integrations/ldap/index`.
sr: Синхронизација ваших LDAP „група” са Zammad улогама може да олакша *начин* управљања приступом. Да бисте сазнали више, погледајте :doc:`/system/integrations/ldap/index`.

source: What Is a Role?
de: Was ist eine Rolle?
sr: Шта је то улога?

source: Some users can do things others can't (like close a ticket). Users have roles, roles have permissions, and permissions are what make those actions possible. You can think of roles as a kind of a collection of permissions.
de: Einige Benutzer können Dinge tun, die andere nicht können (z.B. ein Ticket schließen). Benutzer haben Rollen, Rollen haben Berechtigungen, und die Berechtigungen erlauben diese Aktionen. Sie können sich die Rollen als eine Art Sammlung von Berechtigungen vorstellen.
sr: Неки корисници могу да раде ствари које други не могу (као што је затварање тикета). Корисници имају улоге, улоге имају дозволе, а дозволе су оно што чини те радње могућим. Можете посматрати улоге као колекцију дозвола.

source: So what exactly are permissions, then?
de: Was genau sind denn nun Berechtigungen?
sr: Дакле, шта су то тачно дозволе?

source: List of permissions in the New Role dialog
de: Liste der Berechtigungen im Dialogfeld "Neue Rolle“
sr: Листа дозвола у дијалогу нове улоге

source: The ``admin.calendar`` permission gives you access to the **Manage > Calendars** admin panel.
de: Mit der Berechtigung ``admin.calendar`` haben Sie Zugriff auf den Bereich **Verwalten > Kalender**.
sr: Дозвола ``admin.calendar`` вам даје приступ административном панелу **Управљање > Календари**.

source: Simply put, permissions are names for all the different things users might want to do throughout the system, such as:
de: Einfach ausgedrückt, sind Berechtigungen Namen für all die verschiedenen Dinge, die Benutzer im System tun möchten, wie z.B.:
sr: Једноставно речено, дозволе су називи за све различите ствари које корисници желе да раде у целом систему, као што су:

source: ``chat.agent``: respond to live chat messages
de: ``chat.agent``: Antwort auf Live-Chat-Nachrichten
sr: ``chat.agent``: одговорање на поруке ћаскања

source: ``ticket.agent``: update tickets
de: ``ticket.agent``: Tickets aktualisieren
sr: ``ticket.agent``: освежавање тикета

source: ``admin.user``: access the **Manage > Users** admin panel
de: ``admin.user``: Zugriff auf **Verwalten > Benutzer**
sr: ``admin.user``: приступ административном панелу **Управљање > Корисници**

source: ``knowledge_base.editor``: create/edit knowledge base articles
de: ``knowledge_base.editor``: Erstellen/Bearbeiten von Knowledge Base Artikeln
sr: ``knowledge_base.editor``: додавање/уређивање чланака базе знања

source: Zammad has dozens of these permissions, which is a lot to keep track of. So instead of assigning a bunch of permissions to different users, the idea is to assign permissions to roles. And each user has an assigned role.
de: Zammad hat Dutzende dieser Berechtigungen, und das ist eine Menge, die man im Auge behalten muss. Anstatt also verschiedenen Benutzern eine Reihe von Berechtigungen zuzuweisen, besteht die Idee darin, den Rollen Berechtigungen zuzuweisen. Und jeder Benutzer hat eine zugewiesene Rolle.
sr: Zammad има на десетине ових дозвола, што је превише за памћење. Дакле, уместо доделе гомиле дозвола различитим корисницима, приступ је да се доделе дозволе улогама. А сваки корисник има додељену улогу.

source: This makes creating user accounts for new agents a whole lot simpler, and it also makes it easier to assign a new permission to a role and say "All existing agents can do *that* now, too."
de: Dadurch wird das Anlegen von Benutzerkonten für neue Agenten sehr viel einfacher, und es ist auch einfacher, einer Rolle eine neue Berechtigung zuzuweisen und zu sagen: "Alle vorhandenen Agenten können *das* jetzt auch."
sr: Ово чини додавање корисничких налога за нове оператере много једноставнијим, а такође олакшава додавање нове дозволе улози ради остваривања следеће реченице: „Сви постојећи оператери такође могу да ураде *ово* сада.“

source: In short, roles are just collections of permissions that you can give to a user. The built-in admin, agent, and customer roles are enough for many teams, but Zammad gives you the freedom to custom-build your own.
de: Kurz gesagt, sind Rollen nur Sammlungen von Berechtigungen, die Sie einem Benutzer geben können. Die eingebauten Admin-, Agenten- und Kundenrollen sind für viele Teams ausreichend, aber Zammad gibt Ihnen die Freiheit, Ihre eigenen Rollen zu erstellen.
sr: Укратко, улоге су само колекције дозвола које можете дати кориснику. Подразумеване улоге администратора, оператера и клијента довољне су за многе тимове, али Zammad вам даје слободу да дефинишете сопствене.

source: And to do that, you'll need to know what each permission does.
de: Und dazu müssen Sie wissen, was die einzelnen Berechtigungen bewirken.
sr: А да бисте то урадили, мораћете да знате шта свака дозвола ради.

source: Users can have both "agent" and "customer" roles at the same time!
de: Benutzer können gleichzeitig die Rollen "Agent" und "Kunde" haben!
sr: Корисници могу имати и улоге „оператера” и „клијента” у исто време!

source: Why would you want this? Agents get :doc:`overviews </manage/overviews>` of all the tickets they're *assigned to* (among others), while customers get an overview of all the tickets they've *opened*. But some teams use Zammad for both internal and public communication, so their agents need both.
de: Warum sollten Sie das wollen? Agenten erhalten :doc:`Übersichten </manage/overviews>` über alle Tickets, denen sie *zugewiesen* sind (neben anderen), während Kunden einen Überblick über alle Tickets erhalten, die sie *erstellt* haben. Einige Teams verwenden Zammad jedoch sowohl für die interne als auch für die öffentliche Kommunikation, so dass deren Mitarbeiter beides benötigen.
sr: Зашто ми ово треба? Оператери имају приступ :doc:`прегледима </manage/overviews>` свих тикета којима су *додељени* (између осталог), док клијенти имају приступ прегледу свих тикета које су *отворили*. Али, неки тимови користе Zammad и за интерну и за јавну комуникацију, тако да њиховим оператерима требају оба.
