Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: i-doit administration interface with TTS configuration
de: i-doit Verwaltungsoberfläche mit TTS-Konfiguration
sr: i-doit административни интерфејс са TTS конфигурацијом

source: TTS-Type
de: TTS-Typ

source: Username / Password
de: Benutzername/Passwort
sr: Корисничко име / лозинка

source: Login credentials for a Zammad agent.
de: Anmeldedaten für einen Zammad-Agenten.
sr: Креденцијали за пријаву Zammad оператера.

source: This agent must have **read permission** for all :doc:`groups </manage/groups/index>` that plan on using the i-doit integration.
de: Dieser Agent muss **Leseberechtigung** für alle :doc:`Gruppen </manage/groups/index>` haben, die die i-doit-Integration nutzen wollen.
sr: Овај оператер мора имати **дозволу за читање** за све :doc:`групе </manage/groups/index>` које планирају да користе i-doit интеграцију.

source: You may even wish to create a dedicated agent account just for this integration (otherwise, if the agent ever changes her password, you will have to remember to update it here).
de: Möglicherweise möchten Sie sogar ein eigenes Konto für den Agenten einrichten (andernfalls müssen Sie daran denken, das Passwort zu aktualisieren, wenn der Agent sein Passwort ändert).
sr: Можда ћете чак желети да направите наменски налог оператера само за ову интеграцију (у супротном, ако оператер икада промени своју лозинку, мораћете да се сетите да је освежите и овде).

source: URL incl. protocol
de: URL mit Protokoll
sr: URL адреса укључујући и протокол

source: ``https://your.zammad.domain``
de: ``https://ihre.zammad.domain``

source: Integrations
de: Integrationen
sr: Интеграције

source: Zammad offers numerous integrations that add rich features to your instance.
de: Zammad bietet zahlreiche Integrationen, die Ihre Instanz um umfangreiche Funktionen erweitern.
sr: Zammad нуди бројне интеграције које додају богате функције вашој инстанци.

source: Integrations for Phone Systems
de: Integrationen für Telefonanlagen
sr: Интеграције за телефонске централе

source: Your VoIP provider or telephony system is not listed? Possibly your provider supports Zammad by using the generic CTI - if you're unsure ask your provider.
de: Ihr VoIP-Anbieter oder Ihre Telefonanlage ist nicht aufgeführt? Möglicherweise unterstützt Ihr Anbieter Zammad durch die Verwendung der generischen CTI - wenn Sie unsicher sind, fragen Sie Ihren Anbieter.
sr: Ваш VoIP провајдер или телефонски систем није наведен? Можда ваш провајдер подржава Zammad користећи генерички CTI - ако нисте сигурни питајте свог провајдера.

source: Provider does not support Zammad? Consider creating a `feature request in the Zammad Community <https://community.zammad.org/c/stuff-you-like-zammad-to-have-feel-free-to-discuss-and-add-proposals/6>`_.
de: Der Anbieter unterstützt Zammad nicht? Sie können gerne ein `Feature Request in der Zammad Community <https://community.zammad.org/c/stuff-you-like-zammad-to-have-feel-free-to-discuss-and-add-proposals/6>`_ erstellen.
sr: Провајдер не подржава Zammad? Размислите о слању `захтева за нову функцију на Zammad Community форуму <https://community.zammad.org/c/stuff-you-like-zammad-to-have-feel-free-to-discuss-and-add-proposals/6>`_.

source: Integrations for Authentication and Customers
de: Integrationen für Authentifizierung und Kunden
sr: Интеграције за аутентификацију и клијенте

source: Integrations for Monitoring Systems
de: Integrationen für Monitoring-Systeme
sr: Интеграције за системе за надзор

source: The documentation currently doesn't cover the following integrations:
de: Die Dokumentation deckt derzeit die folgenden Integrationen nicht ab:

source: For a guide about how to create tickets from Zabbix, head over to the :doc:`configuration guide </misc/zabbix>` outside of this integrations section.
de: Eine Anleitung zum Erstellen von Tickets über Zabbix finden Sie in der :doc:`Konfigurationsanleitung </misc/zabbix>` außerhalb dieses Bereichs.

source: Integrations for Issue Trackers
de: Integrationen für Issue-Tracker
sr: Интеграције за праћење проблема

source: Other Integrations
de: Andere Integrationen
sr: Додатне интеграције

source: This section will hold any other integration that can't be grouped up (yet).
de: In diesem Abschnitt werden alle anderen Integrationen aufgeführt, die (noch) nicht in Gruppen zusammengefasst werden können.
sr: Овај одељак садржи све додатне интеграције које се (још увек) не могу груписати заједно.

source: Zammad comes with a powerful LDAP integration that allows you to have a single source of truth. Using this integration reduces the number of login credentials your users have to remember.
de: Zammad verfügt über eine leistungsstarke LDAP-Integration, die es Ihnen ermöglicht, eine einzige Quelle der Wahrheit zu haben. Durch die Verwendung dieser Integration wird die Anzahl der Zugangsdaten, die sich Ihre Benutzer merken müssen, reduziert.

source: The LDAP source is also a perfect candidate for Zammad's :docs:`Kerberos Single Sign-On </appendix/single-sign-on.html>` but also works as addition to other :doc:`/settings/security/third-party`.
de: Die LDAP-Quelle ist auch ein perfekter Kandidat für Zammads :docs:`Kerberos Single Sign-On </appendix/single-sign-on.html>`, funktioniert aber auch als Ergänzung zu anderen :doc:`/settings/security/third-party`.
sr: LDAP извор је такође савршен кандидат за Zammad-ову :docs:`јединствену пријаву путем Kerberos </appendix/single-sign-on.html>`, али такође функционише и као додатак другим :doc:`аутентификацијама путем трећег лица </settings/security/third-party>`.

source: Screenshot shows Zammad's LDAP settings.
de: Screenshot zeigt die LDAP-Einstellungen von Zammad.
sr: Снимак екрана који приказује Zammad-овa LDAP подешавања.

source: Before you continue, please note the following limitations:
de: Bevor Sie fortfahren, beachten Sie bitte die folgenden Einschränkungen:
sr: Пре него што наставите, имајте на уму следећа ограничења:

source: Mapping / synchronizing organizations is not possible
de: Mapping / Synchronisation von Organisationen ist nicht möglich

source: You may want to consider using domain based assignments to overcome this issue. Learn more on :doc:`/manage/organizations/index`.
de: Um dieses Problem zu umgehen können Sie die Verwendung der domainbasierten Zuweisungen in Betracht ziehen. Erfahren Sie mehr unter :doc:`/manage/organizations/index`.
sr: Можда бисте желели да размислите о коришћењу доделе на основу домена да бисте превазишли овај проблем. Сазнајте више у одељку о :doc:`организацијама </manage/organizations/index>`.

source: Zammad's LDAP sync is one way. Edited user settings or permissions may be overwritten upon the next sync depending on your configuration.
de: Die LDAP-Synchronisierung von Zammad funktioniert nur in eine Richtung. Die Bearbeitung von Benutzereinstellungen oder Berechtigungen können bei der nächsten Synchronisierung überschrieben werden, abhängig von Ihrer Konfiguration.

source: Synchronizing user avatars from LDAP is not supported.
de: Die Synchronisierung von Benutzeravataren aus LDAP wird nicht unterstützt.
sr: Синхронизовање аватар сличица корисника путем LDAP-а није подржано.

source: Unlike user filters, group filters cannot be changed.
de: Im Gegensatz zu den Benutzerfiltern können die Gruppenfilter nicht geändert werden.
sr: За разлику од корисничких филтера, групни филтери се не могу мењати.

source: When a user originates from an LDAP server, Zammad will try to verify the login credentials against LDAP first - if this fails Zammad will check its local database.
de: Wenn ein Benutzer von einem LDAP-Server stammt, versucht Zammad zunächst, die Anmeldedaten anhand von LDAP zu überprüfen - wenn dies fehlschlägt, prüft Zammad seine lokale Datenbank.
sr: Када корисник долази са LDAP сервера, Zammad ће прво покушати да провери креденцијале за пријаву путем LDAP - ако ово не успе, Zammad ће проверити и своју локалну базу података.

source: Users can have local passwords even if they're LDAP users! You can learn more about user accounts in general on :doc:`/manage/users/index`.
de: Benutzer können lokale Passwörter haben, auch wenn sie LDAP-Benutzer sind! Sie können mehr über Benutzerkonten im Allgemeinen unter :doc:`/manage/users/index` erfahren.
sr: Корисници могу имати локалне лозинке чак и ако су LDAP корисници! Можете сазнати више о корисничким налозима уопште у одељку о :doc:`корисницима </manage/users/index>`.

source: When several LDAP sources contain the same user (meaning the same email address), the user in question will be updated with every source configured. The **last** LDAP source will win. See `Issue 4109 <https://github.com/zammad/zammad/issues/4109>`_ for more details.
de: Wenn mehrere LDAP-Quellen denselben Benutzer (d.h. dieselbe E-Mail-Adresse) enthalten, wird der betreffende Benutzer mit jeder konfigurierten Quelle aktualisiert. Die **letzte** LDAP-Quelle gewinnt. Siehe `Issue 4109 <https://github.com/zammad/zammad/issues/4109>`_ für weitere Details.

source: Synchronization statistics currently affect *all* configured LDAP sources. This also applies for newly added or updated sources. See `Issue 4108 <https://github.com/zammad/zammad/issues/4108>`_ for more details.
de: Die Synchronisationsstatistiken betreffen derzeit *alle* konfigurierten LDAP-Quellen. Dies gilt auch für neu hinzugefügte oder aktualisierte Quellen. Siehe `Issue 4108 <https://github.com/zammad/zammad/issues/4108>`_ für weitere Details.

source: Zammad currently has limited fallback server support. You can workaround this by providing several sources - however, ensure to have the exact same configuration on your fallback. See `Issue 4107 <https://github.com/zammad/zammad/issues/4107>`_ for more information.
de: Zammad bietet derzeit nur begrenzte Unterstützung für Fallback-Server. Sie können dies umgehen, indem Sie mehrere Quellen einrichten - stellen Sie jedoch sicher, dass Sie die exakt gleiche Konfiguration auf Ihrem Fallback-Server haben. Siehe `Issue 4107 <https://github.com/zammad/zammad/issues/4107>`_ für weitere Details.

source: Manage LDAP-Sources
de: Verwalten von LDAP-Quellen
sr: Подешавање LDAP извора

source: Add a New Source
de: Eine neue Quelle hinzufügen

source: Using the *New Source* button allows you to add new LDAP sources to your installation. You're not limited in the number of sources, however, keep in mind that many sources will also take more time to synchronize.
de: Über die Schaltfläche *Neue Quelle* können Sie neue LDAP-Quellen zu Ihrer Installation hinzufügen. Sie sind in der Anzahl der Quellen nicht beschränkt, bedenken Sie jedoch, dass viele Quellen auch mehr Zeit für die Synchronisierung benötigen.
sr: Коришћење дугмета *Нови извор* омогућава вам да додате нове LDAP изворе у вашим инсталацијама. Нисте ограничени у броју извора, међутим, имајте на уму да ће великом броју извора такође бити потребно више времена за синхронизацију.

source: You can choose between different encryption types, namely *SSL* and *STARTTLS* or none of them ("*No SSL*"). If you choose *SSL* or *STARTTLS*, Zammad will display an additional *SSL verification* option that allows you to disable the verification, e.g. for self-signed SSL certificates. You can also tell Zammad to use a different port by appending ``:<port number>`` to your hostname/IP.
de: Sie können zwischen verschiedenen Verschlüsselungsarten wählen, nämlich *SSL* und *STARTTLS* oder keine von beiden ("*kein SSL*"). Wenn Sie sich für *SSL* oder *STARTTLS* entscheiden, zeigt Zammad eine zusätzliche Option *SSL-Verifizierung* an, mit der Sie die Überprüfung deaktivieren können, z.B. für selbst signierte SSL-Zertifikate. Sie können Zammad auch anweisen, einen anderen Port zu verwenden, indem Sie ``:<Portnummer>`` an Ihren Hostnamen/IP anhängen.
sr: Можете одабрати између различитих типова шифровања, тј. *SSL* и *STARTTLS* или ниједан („*No SSL*”). Ако изаберете *SSL* или *STARTTLS*, Zammad ће приказати додатну опцију *SSL провера* која вам омогућава да искључите верификацију, нпр. за прилагођене SSL сертификате. Такође можете рећи Zammad-у да користи другачији порт додатком ``:<број порта>`` вашем називу сервера/IP-у.

source: Screenshot of configuring a new LDAP source with SSL encryption and SSL verification
de: Screenshot der Konfiguration einer neuen LDAP-Quelle mit SSL-Verschlüsselung und SSL-Verifizierung
sr: Снимак екрана подешавања новог LDAP извора са SSL шифровањем и SSL провером

source: New Source with SSL transport security enabled and certificate verification
de: Neue Quelle mit aktivierter SSL-Verschlüsselung und Zertifikatsüberprüfung
sr: Нови извор са SSL укљученим протоколом и провером сертификата

source: Using a user filter can be a good idea if you only require a small subset of your LDAP users in Zammad. Because Active Directories are quite specific on how to filter for active users only, please see `Microsoft's documentation <https://blogs.msdn.microsoft.com/muaddib/2008/10/08/how-to-query-individual-properties-of-the-useraccountcontrol-active-directory-user-property-using-ldap/>`_ for more information.
de: Die Verwendung eines Benutzerfilters kann eine gute Idee sein, wenn Sie nur eine Teilmenge Ihrer LDAP-Benutzer in Zammad benötigen. Da Active Directories ziemlich spezifisch hinsichtlich der Filterung nach aktiven Benutzern sind, finden Sie weitere Informationen in der `Dokumentation von Microsoft <https://blogs.msdn.microsoft.com/muaddib/2008/10/08/how-to-query-individual-properties-of-the-useraccountcontrol-active-directory-user-property-using-ldap/>`_.

source: As every LDAP behaves differently on which attributes and how they are set, Zammad doesn't care about any flags.
de: Da sich jedes LDAP anders verhält, welche Attribute wie gesetzt werden, kümmert sich Zammad nicht um irgendwelche Flags.
sr: Како се сваки LDAP понаша другачије на основу тога који атрибути се користе и како су подешени, Zammad неће уважити било какве ознаке.

source: Users that no longer are returned by your LDAP source will automatically be set to inactive. Zammad assumes that the user was deactivated.
de: Benutzer, die nicht mehr von Ihrer LDAP-Quelle zurückgegeben werden, werden automatisch auf inaktiv gesetzt. Zammad geht davon aus, dass der Benutzer deaktiviert wurde.
sr: Корисници које ваш LDAP извор више не враћа аутоматски ће бити подешени на неактивне. Zammad претпоставља да је корисник деактивиран.

source: Users will never be removed automatically! If you want to remove obsolete users, use :doc:`/system/data-privacy`.
de: Benutzer werden niemals automatisch entfernt! Wenn Sie veraltete Benutzer entfernen wollen, verwenden Sie :doc:`/system/data-privacy`.
sr: Корисници никада неће бити аутоматски уклоњени! Ако желите да уклоните застареле кориснике, користите :doc:`захтеве приватности података </system/data-privacy>`.

source: *Do not* manually write paths of either LDAP attributes or groups. If Zammad does not display them, it either cannot find them or you have a lot of users that don't have the attributes populated.
de: Editieren Sie *keine* Pfade von LDAP-Attributen oder Gruppen manuell. Wenn Zammad sie nicht anzeigt, kann es sie entweder nicht finden oder Sie haben viele Benutzer, bei denen die Attribute nicht ausgefüllt sind.
sr: *Немојте* ручно писати путање било LDAP атрибута или група. Ако их Zammad не прикаже, или не може да их пронађе или имате много корисника који немају попуњене атрибуте.

source: Zammad will always only return attributes that are filled - this reduces the returned list of attributes greatly.
de: Zammad wird immer nur Attribute zurückgeben, die ausgefüllt sind - dies reduziert die Liste der zurückgegebenen Attribute erheblich.
sr: Zammad ће увек враћати само попуњене атрибуте - ово у великој мери смањује враћену листу атрибута.

source: Screenshot showing adding of a new sample LDAP source
de: Screenshot zeigt das Hinzufügen einer neuen Beispiel-LDAP-Quelle
sr: Снимак екрана који приказује пример додавања новог LDAP извора

source: If your LDAP system doesn't allow anonymous bind, Zammad detects it and provides you an editable "Base DN" *text* field instead of a prefilled *select* field.
de: Wenn Ihr LDAP-System keine anonyme Verbindung zulässt, erkennt Zammad dies und stellt Ihnen ein editierbares *Text*-Feld "Basis-DN" anstelle eines vorausgefüllten *Auswahl*-Feldes zur Verfügung.
sr: Ако ваш LDAP систем не подржава анонимни приступ, Zammad ће то детектовати и омогућити вам поље *текста* „Основни DN” уместо попуњеног поља *избора*.

source: In case your LDAP groups follow a hierarchy, you can choose to assign Zammad roles to all members of nested groups.
de: Falls Ihre LDAP-Gruppen einer Hierarchie folgen, können Sie allen Mitgliedern der verschachtelten Gruppen Zammad-Rollen zuweisen.
sr: У случају да ваше LDAP групе имају хијерархију, можете одабрати доделу Zammad улога свим члановима подређених група.

source: Simply set *Include nested* dropdown to *Yes* and all members of child groups will be considered for the role assignment.
de: Setzen Sie das Dropdown-Menü *Verschachtelte einbeziehen* einfach auf *Ja*, und alle Mitglieder der untergeordneten Gruppen werden bei der Rollenzuweisung berücksichtigt.
sr: Једноставно одаберите *Да* за поље *Укључи подређене* и сви чланови подређених група ће бити узети у обзир приликом доделе улога.

source: Screenshot showing the nested groups option for the role assignment
de: Screenshot zeigt Option "Verschachtelte Gruppen" für die Rollenzuweisung
sr: Снимак екрана који приказује опцију подређених група приликом доделе улога

source: Review or Edit Existing Source
de: Vorhandene Quelle überprüfen oder bearbeiten

source: Clicking on a LDAP source will provide a configuration and mapping overview.
de: Wenn Sie auf eine LDAP-Quelle klicken, erhalten Sie eine Übersicht über die Konfiguration und das Mapping.
sr: Кликом на LDAP извор добићете преглед конфигурације и мапирања.

source: If needed you can then use the *Change* button to update either the name, active state or the whole configuration. If you're changing the whole configuration, the dialogue will be identical to the source creation.
de: Bei Bedarf können Sie dann die Schaltfläche *Ändern* verwenden, um entweder den Namen, den Status (aktiv oder nicht) oder die gesamte Konfiguration zu aktualisieren. Wenn Sie die gesamte Konfiguration ändern, ist der Dialog identisch mit dem bei der Erstellung der Quelle.
sr: Ако је потребно, можете користити дугме *Измени* да освежите назив, активно стање или целу конфигурацију. Ако мењате целу конфигурацију, дијалог ће бити идентичан оном приликом додавања извора.

source: Did your LDAP server change? Different LDAP servers have different structures and default attributes. This causes the LDAP synchronization to likely fail. Consider removing the affected source and re-add it.
de: Hat sich Ihr LDAP-Server geändert? Verschiedene LDAP-Server haben unterschiedliche Strukturen und Standardattribute. Dies führt dazu, dass die LDAP-Synchronisierung wahrscheinlich fehlschlägt. Entfernen Sie die betroffene Quelle und fügen Sie sie erneut hinzu.
sr: Да ли се ваш LDAP сервер променио? Различити LDAP сервери имају различите структуре и подразумеване атрибуте. Ово може узроковати да LDAP синхронизација не успе. Размислите о брисању дотичног извора и поново га додајте.

source: Change Order of LDAP Sources
de: Reihenfolge der LDAP-Quellen ändern

source: You can change the synchronization order for each source at any time. Zammad will synchronize the sources from top to bottom. To change the order, simply drag & drop the sources with the ≣ handle.
de: Sie können die Reihenfolge der Synchronisierung jederzeit ändern. Zammad wird die Quellen von oben nach unten synchronisieren. Um die Reihenfolge zu ändern, ziehen Sie die Quellen einfach per Drag & Drop mit dem ≣-Griff.

source: Remove a Source
de: Eine Quelle entfernen

source: If you no longer need an LDAP source or simply want to start over, you can remove it at any time. This will not remove synchronized users, synchronized data or permissions.
de: Wenn Sie eine LDAP-Quelle nicht mehr benötigen oder einfach neu beginnen möchten, können Sie sie jederzeit entfernen. Synchronisierte Benutzer, synchronisierte Daten oder Berechtigungen werden dabei nicht entfernt.
sr: Ако вам више није потребан LDAP извор или једноставно желите да почнете изнова, можете их обрисати у било ком тренутку. Ова радња неће уклонити синхронизоване кориснике, њихове податке или дозволе.

source: If you are not sure if you'd need the source later on, set it to inactive instead.
de: Wenn Sie nicht sicher sind, ob Sie die Quelle später noch benötigen, setzen Sie sie stattdessen auf inaktiv.

source: This section holds all requests Zammad handled for all LDAP sources. These entries can either contain synchronization information or logins (authentication attempts via Zammad's login interface).
de: Dieser Abschnitt enthält alle Anfragen an alle LDAP-Quellen. Diese Einträge können entweder Synchronisationsinformationen oder Logins (Authentifizierungsversuche über die Login-Schnittstelle von Zammad) enthalten.
sr: Овај одељак садржи све захтеве које је Zammad обрадио за све LDAP изворе. Ови уноси могу да садрже информације о синхронизацији или пријави (покушаји аутентификације преко Zammad-овог интерфејса за пријаву).

source: By clicking on any request, Zammad will provide even more information. The provided information can be useful when something does not work as expected.
de: Wenn Sie auf eine Anfrage klicken, stellt Zammad weitere Informationen zur Verfügung. Die bereitgestellten Informationen können nützlich sein, wenn etwas nicht wie erwartet funktioniert.
sr: Кликом на било који захтев, Zammad ће пружити још више информација. Представљене информације могу бити корисне када нешто не функционише на начин како се очекује.

source: Especially a LDAP synchronization can cause many log entries. The web interface will always limit the number of shown entries to the last 50 entries.
de: LDAP-Synchronisationen können viele Log-Einträge verursachen. Das Webinterface beschränkt die Anzahl der angezeigten Einträge immer auf die letzten 50 Einträge.
sr: Нарочито LDAP синхронизација може проузроковати много уноса евиденције. Кориснички интерфејс ће увек ограничити број приказаних уноса на последњих 50.

source: Screencast showing LDAP integration log entries and a detail view on an entry.
de: Screencast mit LDAP-Protokollen und Detailansicht eines Eintrags.
sr: Снимак екрана који приказује уносе евиденције LDAP интеграције и детаљан приказ уноса.

source: Pretty Good Privacy (PGP) is another method for secure email communication. With PGP, you can exchange **signed** and **encrypted** messages with others.
de: Pretty Good Privacy (PGP) ist eine weitere Methode zur sicheren E-Mail-Kommunikation. Mit PGP können Sie **signierte** und **verschlüsselte** Nachrichten mit anderen austauschen.
sr: Pretty Good Privacy (PGP) је још један метод за безбедну комуникацију путем имејла. Са PGP, можете да размењујете **потписане** и **шифроване** поруке са другима.

source: Signing
de: Signieren
sr: Потписивање

source: is a proof that a message hasn't been manipulated on its way.
de: ist der Beweis, dass eine Nachricht auf dem Weg nicht manipuliert wurde.
sr: је доказ да порука није мењана на свом путу.

source: In other words, it guarantees message **integrity** and **authenticity**.
de: Mit anderen Worten, es garantiert die **Integrität** und **Authentizität**.
sr: Другим речима, гарантује **интегритет** и **аутентичност** поруке.

source: Encryption
de: Verschlüsselung
sr: Шифровање

source: scrambles a message so that it can only be unscrambled by the intended recipient.
de: verschlüsselt eine Nachricht so, dass sie nur vom gewünschten Empfänger entschlüsselt werden kann.
sr: шифрује поруку тако да може да је дешифрује само прималац коме је намењена.
