Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: Available operators for matching:
de: Verfügbare Operatoren für die Prüfung:
sr: Доступни оператори за подударање:

source: **contains**: Matches if text contains a specific string.
de: **enthält**: Trifft zu, wenn der Text eine bestimmte Zeichenkette enthält.
sr: **садржи**: Одговара ако текст садржи одређени низ.

source: **contains not**:
de: **enthält nicht**:
sr: **не садржи**:

source: Matches if text does not contain a specific string.
de: Trifft zu, wenn der Text eine bestimmte Zeichenfolge nicht enthält.
sr: Одговара ако текст не садржи одређени низ.

source: **is any of**:
de: **ist eins von**:
sr: **је један од**:

source: Matches if text is equal to any of given tokens.
de: Trifft zu, wenn der Text mit einem der angegebenen Wörter übereinstimmt.
sr: Одговара ако је текст једнак било којој од датих значки.

source: **is none of**:
de: **ist keins von**:
sr: **није ниједан од**:

source: Matches if text is not equal to all of given tokens.
de: Trifft zu, wenn der Text nicht mit allen angegebenen Wörtern übereinstimmt.
sr: Одговара ако текст није једнак свим датим значкама.

source: **starts with one of**:
de: **beginnt mit eins von**:
sr: **почиње са једним од**:

source: Matches if text starts with one of given tokens.
de: Trifft zu, wenn der Text mit einem der angegebenen Wörter beginnt.
sr: Одговара ако текст почиње са једном од датих значки.

source: **ends with one of**:
de: **endet auf eins von**:
sr: **завршава се са једним од**:

source: Matches if text ends with one of given tokens.
de: Trifft zu, wenn der Text mit einem der angegebenen Wörter endet.
sr: Одговара ако се текст завршава једном од датих значки.

source: **matches regex**:
de: **passt auf regex**:
sr: **задовољава регуларни израз**:

source: Evaluates if text matches provided regular expression (see also :ref:`remarks <regex>`).
de: Prüft, ob der Text mit dem angegebenen regulären Ausdruck übereinstimmt (siehe auch :ref:`remarks <regex>`).
sr: Процењује да ли текст задовољава дати регуларни израз (погледајте и :ref:`напомене <regex>`).

source: **does not match regex**:
de: **passt nicht auf regex**:
sr: **не задовољава регуларни израз**:

source: Evaluates if text does not match provided regular expression.
de: Prüft, ob der Text nicht mit dem angegebenen regulären Ausdruck übereinstimmt.
sr: Процењује да ли текст не задовољава дати регуларни израз.

source: Textarea Field
de: Textbereich-Feld
sr: Текстуално поље

source: Checks if any field of type textarea contains a specific string.
de: Prüft, ob ein Feld vom Typ Textbereich eine bestimmte Zeichenkette enthält.
sr: Проверава да ли неко текстуално поље садржи одређени низ.

source: **contains**
de: **enthält**
sr: **садржи**

source: **contains not**
de: **enthält nicht**
sr: **не садржи**

source: **has changed**
de: **wurde verändert**
sr: **је измењено**

source: Boolean Field
de: Boolean-Feld
sr: Логичко поље

source: Checks if any field of type boolean is true.
de: Prüft, ob ein Feld vom Typ Boolean wahr ist.
sr: Проверава да ли је неко логичко поље истинито.

source: **is**
de: **ist**
sr: **је**

source: **is not**
de: **ist nicht**
sr: **није**

source: Integer Field
de: Zahlen-Feld
sr: Целобројно поље

source: Checks if any field of type integer has a specific value.
de: Prüft, ob ein Zahlenfeld einen bestimmten Wert enthält oder nicht.
sr: Проверава да ли неко целобројно поље има одређену вредност.

source: **is less than**
de: **ist kleiner als**
sr: **је мање од**

source: **is less than or equal to**
de: **ist kleiner als oder gleich**
sr: **је мање од или једнако**

source: **is greater than**
de: **ist größer als**
sr: **је веће од**

source: **is greater than or equal to**
de: ist größer als oder gleich
sr: **је веће од или једнако**

source: Date Field
de: Datumsfeld
sr: Поље датума

source: Checks if a date is before or past (both absolute or relative) a specific point in time or time period. Relative operators allow you to define a time period in seconds, minutes, hours, days, weeks, months or years.
de: Prüft, ob ein Datum vor oder nach einem bestimmten Zeitpunkt oder Zeitraum liegt (sowohl absolut als auch relativ). Mit relativen Operatoren können Sie eine Zeitspanne in Sekunden, Minuten, Stunden, Tagen, Wochen, Monaten oder Jahren definieren.
sr: Проверава да ли је датум пре или након (апсолутног или релативног) тренутка у времену или временског периода. Релативни оператори вам омогућавају да одредите временски период у секундама, минутама, сатима, данима, недељама, месецима или годинама.

source: **before (absolute)**:
de: **vor (absolut)**:
sr: **пре (апсолутно)**:

source: If the date field's value is before the configured date, the condition will be met.
de: Liegt der Wert des Datumsfelds vor dem konfigurierten Datum, wird die Bedingung erfüllt.
sr: Ако је вредност поља датума пре подешеног датума, услов ће бити испуњен.

source: **after (absolute)**:
de: **nach (absolut)**:
sr: **након (апсолутно)**:

source: If the date field's value is after the configured date, the condition will be met.
de: Liegt der Wert des Datumsfelds nach dem konfigurierten Datum, wird die Bedingung erfüllt.
sr: Ако је вредност поља датума после подешеног датума, услов ће бити испуњен.

source: **before (relative)**:
de: **vor (relativ)**:
sr: **пре (релативно)**:

source: Matches the date field's value if the value is before the current date minus the selected time period.
de: Liegt der Wert des Datumsfelds auf dem aktuellen Datum minus dem ausgewählten Zeitraum, ist diese Bedingung erfüllt.
sr: Одговара вредности поља датума ако је вредност пре текућег датума минус изабрани временски период.

source: **after (relative)**:
de: **nach (relativ)**:
sr: **након (релативно)**:

source: Matches the date field's value if the value is after the current date plus the selected time period.
de: Liegt der Wert des Datumsfelds auf dem aktuellen Datum plus dem ausgewählten Zeitraum, ist diese Bedingung erfüllt.
sr: Одговара вредности поља датума ако је вредност после текућег датума плус изабрани временски период.

source: **within last (relative)**:
de: **innerhalb letzter (relativ)**:
sr: **у последњих (релативно)**:

source: Matches the date field's value if the value is in between the current date and the current date minus the selected time period.
de: Liegt der Wert des Datumsfelds zwischen dem aktuellen Datum und dem aktuellen Datum minus dem ausgewählten Zeitraum, ist diese Bedingung erfüllt.
sr: Одговара вредности поља датума ако је вредност између текућег датума и текућег датума минус изабрани временски период.

source: **within next (relative)**:
de: **innerhalb nächster (relativ)**:
sr: **у следећих (релативно)**:

source: Matches the date field's value if the value is in between the current date and the current date plus the selected time period.
de: Liegt der Wert des Datumsfelds zwischen dem aktuellen Datum und dem aktuellen Datum plus dem ausgewählten Zeitraum, ist diese Bedingung erfüllt.
sr: Одговара вредности поља датума ако је вредност између текућег датума и текућег датума плус изабрани временски период.

source: **till (relative)**:
de: **bis in (relativ)**:
sr: **до (релативно)**:

source: Matches the date field's value if the value is before the current date plus the selected time period.
de: Liegt der Wert des Datumsfelds auf dem aktuellen Datum plus dem ausgewählten Zeitraum, ist diese Bedingung erfüllt.
sr: Одговара вредности поља датума ако је вредност пре текућег датума плус изабрани временски период.

source: **from (relative)**:
de: **von vor (relativ)**:
sr: **од (релативно)**:

source: Matches the date field's value if the value is after the current date minus the selected time period.
de: Liegt der Wert des Datumsfelds auf dem aktuellen Datum minus dem ausgewählten Zeitraum, ist diese Bedingung erfüllt.
sr: Одговара вредности поља датума ако је вредност после текућег датума минус изабрани временски период.

source: **has changed**:
de: **wurde verändert**:
sr: **је измењено**:

source: The field has been changed during a ticket update.
de: Das Feld wurde während einer Ticketaktualisierung geändert.
sr: Поље је измењено током освежавања тикета.

source: To help you understand the time conditions of Zammad better, below diagram might also be helpful to you.
de: Damit Sie die zeitlichen Bedingungen von Zammad besser verstehen, könnte Sie sich das folgende Diagramm anschauen.
sr: Да бисмо вам помогли да боље разумете временске услове Zammad-а, прилажемо дијаграм испод.

source: Date & Time Field
de: Datum & Zeit-Feld
sr: Поље датума и времена

source: Checks if a date and time is before or past (both absolute or relative) a specific point in time or time period. Relative operators allow you to define a time period in seconds, minutes, hours, days, weeks, months or years.
de: Prüft, ob ein Datum und Uhrzeit vor oder nach einem bestimmten Zeitpunkt oder Zeitraum liegt (sowohl absolut als auch relativ). Mit relativen Operatoren können Sie eine Zeitspanne in Sekunden, Minuten, Stunden, Tagen, Wochen, Monaten oder Jahren definieren.
sr: Проверава да ли је датум и време пре или након (апсолутног или релативног) тренутка у времену или временског периода. Релативни оператори вам омогућавају да одредите временски период у секундама, минутама, сатима, данима, недељама, месецима или годинама.

source: If the date & time field's value is before the configured date and time, the condition will be met.
de: Liegt der Wert des Datums-/Zeitfelds vor dem konfigurierten Datum und der Zeit, wird die Bedingung erfüllt.
sr: Ако је вредност поља датума и времена пре подешеног датума и времена, услов ће бити испуњен.

source: If the date & time field's value is after the configured date and time, the condition will be met.
de: Liegt der Wert des Datums-/Zeitfelds nach dem konfigurierten Datum und der Zeit, wird die Bedingung erfüllt.
sr: Ако је вредност поља датума и времена после подешеног датума и времена, услов ће бити испуњен.

source: Matches the date & time field's value if the value is before the current date and time minus the selected time period.
de: Liegt der Wert des Datums-/Zeitfelds auf dem aktuellen Datum und Uhrzeit minus dem ausgewählten Zeitraum, ist diese Bedingung erfüllt.
sr: Одговара вредности поља датума и времена ако је вредност пре текућег датума и времена минус изабрани временски период.

source: Matches the date & time field's value if the value is after the current date and time plus the selected time period.
de: Liegt der Wert des Datums-/Zeitfelds auf dem aktuellen Datum und Uhrzeit plus dem ausgewählten Zeitraum, ist diese Bedingung erfüllt.
sr: Одговара вредности поља датума и времена ако је вредност после текућег датума и времена плус изабрани временски период.

source: Matches the date & time field's value if the value is in between the current time and the current time minus the selected time period.
de: Liegt der Wert des Datums-/Zeitfelds zwischen dem aktuellen Datum und Uhrzeit und dem aktuellen Datum und Uhrzeit minus dem ausgewählten Zeitraum, ist diese Bedingung erfüllt.
sr: Подудара се са вредношћу поља датума и времена ако је вредност између текућег времена и текућег времена минус изабрани временски период.

source: Matches the date & time field's value if the value is in between the current time and the current time plus the selected time period.
de: Liegt der Wert des Datums-/Zeitfelds zwischen dem aktuellen Datum und Uhrzeit und dem aktuellen Datum und Uhrzeit plus dem ausgewählten Zeitraum, ist diese Bedingung erfüllt.
sr: Подудара се са вредношћу поља датума и времена ако је вредност између текућег времена и текућег времена плус изабрани временски период.

source: Matches the date & time field's value if the value is before the current date and time plus the selected time period.
de: Liegt der Wert des Datums-/Zeitfelds auf dem aktuellen Datum und Uhrzeit plus dem ausgewählten Zeitraum, ist diese Bedingung erfüllt.
sr: Одговара вредности поља датума и времена ако је вредност пре текућег датума и времена плус изабрани временски период.

source: Matches the date & time field's value if the value is after the current date and time minus the selected time period.
de: Liegt der Wert des Datums-/Zeitfelds auf dem aktuellen Datum und Uhrzeit minus dem ausgewählten Zeitraum, ist diese Bedingung erfüllt.
sr: Одговара вредности поља за датум и време ако је вредност после текућег датума и времена минус изабрани временски период.

source: **has reached**:
de: **wurde erreicht**:
sr: **је достигнуто**:

source: Checks if the time set in this field was reached.
de: Prüft, ob die in diesem Feld eingestellte Zeit erreicht wurde.
sr: Проверава да ли је време подешено у овом пољу достигнуто.

source: Only available for Pending time and Escalation time in Trigger conditions.
de: Nur verfügbar für Wartezeit und Eskalationszeit in Trigger-Bedingungen.
sr: Доступно само за време чекања тикета и време ескалације у условима окидача.

source: **has reached warning**:
de: **Warnung wurde erreicht**:
sr: **је достигло упозорење**:

source: The time set in this field will be reached in less than 15 minutes.
de: Trifft zu, wenn die in diesem Feld eingestellte Zeit in weniger als 15 Minuten erreicht wird.
sr: Време подешено у овом пољу биће достигнуто за мање од 15 минута.

source: Only available for Ticket's Escalation time in Trigger conditions.
de: Diese Option ist nur für die Ticket-Eskalationszeit in Trigger-Bedingungen verfügbar.
sr: Доступно само за време ескалације тикета у условима окидача.

source: Have a look at the diagram above. It applies also for date & time but you additionally have hours and minutes on top to use.
de: Sehen Sie sich das Diagramm oben an. Es gilt auch für Datum und Uhrzeit, aber Sie können zusätzlich Stunden und Minuten verwenden.
sr: Погледајте дијаграм изнад. Такође се односи на датум и време, али у том случају додатно имате сате и минуте на располагању.

source: Single Selection Field
de: Einfachauswahl-Feld
sr: Поље за једноструки избор

source: Checks if selected field values match the attribute value. It allows you to select one or more values of the attribute in question. Selecting more than one value in the condition will act like an "OR" clause.
de: Prüft, ob die ausgewählten Feldwerte mit dem Attributwert übereinstimmen. Sie können einen oder mehrere Werte für das betreffende Attribut auswählen. Die Auswahl von mehr als einem Wert in der Bedingung wirkt wie eine "ODER"-Verknüpfung.
sr: Проверава да ли се одабрана вредност поља подудара са вредношћу атрибута. Омогућава вам да изаберете једну или више вредности дотичног атрибута. Одабир више од једне вредности у услову ће деловати као дисјункција (клаузула „OR“).

source: Multiple Selection Field
de: Mehrfachauswahl-Feld
sr: Поље за вишеструки избор

source: Checks if selected field values match the attribute value(s).
de: Prüft, ob die Werte des ausgewählten Feldes mit dem/den Attribut(en) übereinstimmen.
sr: Проверава да ли одабране вредности поља одговарају стварној вредности атрибута.

source: **contains all**:
de: **enthält alle**:
sr: **садржи све**:

source: Matches if all given field values are selected.
de: Trifft zu, wenn alle angegebenen Feldwerte vorhanden sind.
sr: Одговара ако су изабране све дате вредности поља.

source: **contains one**:
de: **enthält eins**:
sr: **садржи једно**:

source: Matches if one specific given field value is selected.
de: Trifft zu, wenn ein bestimmter Feldwert vorhanden ist.
sr: Одговара ако је изабрана одређена вредност поља.

source: **contains all not**:
de: **enthält alle nicht**:
sr: **не садржи све**:

source: Matches if all given field values are not selected.
de: Trifft zu, wenn alle angegebenen Feldwerte nicht vorhanden sind.
sr: Одговара ако све дате вредности поља нису изабране.

source: **contains one not**:
de: **enthält eins nicht**:
sr: **не садржи једно**:

source: Matches if one specific given field value is not selected.
de: Trifft zu, wenn ein bestimmter Feldwert nicht vorhanden ist.
sr: Одговара ако једна одређена вредност поља није изабрана.

source: Single Tree Selection Field
de: Einfach-Baumauswahl-Feld
sr: Поље за једноструки избор стабла

source: Checks if a selected field value match the attribute value. Selecting more than one value in the condition will act like an "OR" clause.
de: Prüft, ob ein ausgewählter Feldwert mit dem Attributwert übereinstimmt. Die Auswahl von mehr als einem Wert in der Bedingung wirkt wie eine "ODER"-Verknüpfung.
sr: Проверава да ли се одабрана вредност поља подудара са вредношћу атрибута. Одабир више од једне вредности у услову ће деловати као дисјункција (клаузула „OR“).

source: Multiple Tree Selection Field
de: Mehrfach-Baumauswahl-Feld
sr: Поље за вишеструки избор стабла

source: Checks if selected field value(s) match the attribute value(s).
de: Prüft, ob der/die ausgewählte(n) Feldwert(e) mit dem/den Attributwert(en) übereinstimmen.
sr: Проверава да ли одабране вредности поља одговарају стварној вредности атрибута.

source: **contains all**
de: **enthält alle**
sr: **садржи све**

source: **contains one**
de: **enthält eins**
sr: **садржи једно**

source: **contains all not**
de: **enthält alle nicht**
sr: **не садржи све**

source: **contains one not**
de: **enthält eins nicht**
sr: **не садржи једно**

source: Additional Information and Remarks
de: Zusätzliche Informationen und Bemerkungen
sr: Додатне информације и напомене

source: Ticket context conditions do not support:
de: Bedingungen im Ticket-Kontext unterstützen nicht:
sr: Контекст услова тикета не подржава следеће:

source: regular expressions
de: reguläre Ausdrücke
sr: регуларне изразе

source: case sensitive string conditions
de: Groß- und Kleinschreibung bei Zeichenketten
sr: услове који су осетљиви на велика и мала слова

source: Basic conditions do not support the same attribute to be selected more than once
de: Die Standard-Bedingungen erlauben es nicht, dass dasselbe Attribut mehrmals ausgewählt werden kann
sr: Основни услови не подржавају да се исти атрибут бира више пута

source: *has changed* conditions:
de: *wurde verändert* Bedingungen:
sr: услове *је измењено*:

source: Are only available for ticket attributes and don't affect:
de: Sind nur für Ticket-Attribute verfügbar und haben keine Auswirkung auf:
sr: Доступно само за атрибуте тикета и не утиче на:

source: Ticket articles attributes
de: Ticket Artikel-Attribute
sr: атрибуте чланака тикета

source: Organization attributes
de: Organisationsattribute
sr: атрибуте организације

source: User attributes
de: Benutzerattribute
sr: атрибуте корисника

source: Group attributes
de: Gruppenattribute
sr: атрибуте група

source: Differences in input fields:
de: Unterschiede in den Eingabefeldern:
sr: Разлике у пољима за унос:

source: Please note that the input field for tokens doesn't support the comma as separator (as in the input field for tags). If you use the comma in the token input field, the comma is included in you token.
de: Bitte beachten Sie, dass im Eingabefeld für Token das Komma als Trennzeichen nicht unterstützt (wie im Eingabefeld für Tags). Wenn Sie das Komma im Token-Eingabefeld verwenden, ist das Komma in Ihrem Token enthalten.
sr: Имајте на уму да поље за унос значки не подржава зарез као сепаратор (као у пољу за унос за ознаке). Ако користите зарез у пољу за унос значки, зарез ће бити укључен у вашу значку.

source: **Example**:
de: **Beispiel**:
sr: **Пример**:

source: Example of comma usage in token input field
de: Beispiel für die Verwendung eines Kommas im Token-Eingabefeld
sr: Пример употребе зареза у пољу за унос значки

source: ``A`` added with enter/tab, ``B`` and ``C`` separated with comma (resulting in one token).
de: ``A`` mit Enter/Tab hinzugefügt, ``B`` und ``C`` mit Komma getrennt (ergibt ein Token/Wort).
sr: ``A`` додато са ентером/табом, ``B`` и ``C`` одвојени зарезом (што резултира једном значком).

source: Regex support
de: Regex-Unterstützung
sr: Подршка регуларних израза

source: *matches regex* and *does not match regex* are supported only in Triggers, Time Accounting selector, Postmaster Filters, Automatic ticket assignment and Core Workflow.
de: *passt auf regex* und *passt nicht auf regex* werden nur in Triggern, der Zeiterfassungs-Auswahl, in E-Mail-Filtern, der Auswahl zur automatischen Ticketzuweisung und den Core Workflows unterstützt.
sr: *задовољава регуларни израз* и *не задовољава регуларни израз* су подржани само у окидачима, бирачу временског обрачуна, postmaster филтерима, аутоматском додељивању тикета и радном току.

source: "Old" style ``regex:...`` conditions
de: "Alte" ``regex:...`` Bedingungen
sr: Услови са „старим” стилом ``regex:…``

source: If you update your Zammad from 6.0 or prior and you have already conditions with *contains* or *contains not* including a regex filter (i.e. ``regex:^(foo|bar)$``), Zammad tries to migrate them to the new *matches regex* and *does not match regex* operators.
de: Wenn Sie Ihr Zammad von 6.0 oder älter aktualisieren und Sie haben bereits Bedingungen mit *enthält* oder *enthält nicht*, die einen Regex-Filter enthalten (z.B. ``regex:^(foo|bar)$``), versucht Zammad, sie beim Update auf die neuen Operatoren *passt auf regex* und *passt nicht auf regex* zu migrieren.
sr: Ако ажурирате свој Zammad са верзије 6.0 или раније и већ имате услове са *садржи* или *не садржи* укључујући филтер регуларних израза (нпр. ``regex:^(foo|bar)$``), Zammad ће покушати да их мигрира на нове *задовољава регуларни израз* и *не задовољава регуларни израз* операторе.

source: Expert Mode
de: Experten-Modus
sr: Стручни режим

source: This function is only available in self hosted instances and for cloud users with a **Plus** package.
de: Diese Funktion ist nur in selbst gehosteten Instanzen und für Benutzer mit einem **Plus**-Paket verfügbar.
sr: Ова функција је доступна само на инстанцама које **сами хостујете** и за кориснике са **Plus** пакетом.

source: Up to three layers of conditions are supported.
de: Es werden bis zu drei Ebenen von Bedingungen unterstützt.
sr: Подржано је до три нивоа услова.

source: Enabling the *expert mode* within your ticket conditions allows you to use **AND / OR / NOT** operators for any supported method. You can decide which workflow requires this enhanced configuration individually. This section expects that you had a look at :doc:`basics` already.
de: Wenn Sie den *Expertenmodus* in Ihren Ticket-Bedingungen aktivieren, können Sie **UND / ODER / NICHT**-Operatoren für jede unterstützte Methode verwenden. Sie können individuell entscheiden, wo Sie diese erweiterte Konfiguration benötigen. Dieser Abschnitt setzt voraus, dass Sie bereits einen Blick auf :doc:`basics` geworfen haben.
sr: Омогућавање *стручног режима* у оквиру услова тикета омогућава вам да користите услове конкукције **AND**, дисјункције **OR** и негације **NOT** за било који подржани метод. Можете одлучити који радни ток захтева ову напредну конфигурацију појединачно. Овај одељак подразумева да сте већ погледали :doc:`basics`.

source: Switching to Expert Mode
de: Umschalten in den Expertenmodus
sr: Прелазак на стручни режим

source: You can enable or disable *expert mode* in any supported condition screen. To do so, simply use the *expert mode* toggle on the lower right below the *conditions for affected objects* area.
de: Sie können den *Experten-Modus* in jedem unterstützten Konditions-Dialog aktivieren oder deaktivieren. Verwenden Sie dazu einfach den Schalter *Experten-Modus* unten rechts unter dem Bereich *Bedingungen für zu verarbeitende Objekte*.
sr: Можете да укључите или искључите *стручни режим* на било ком подржаном екрану са условима. Да бисте то урадили, једноставно користите прекидач за *стручни режим* у доњем десном углу испод области *услови за захваћене објекте*.
