Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: Currently text messages, documents, images, audio, videos and stickers are supported.
de: Derzeit werden Textnachrichten, Dokumente, Bilder, Audio, Videos und Sticker unterstützt.
sr: Тренутно су подржане поруке текста, документа, слике, аудио, видео и стикера.

source: One attachment per article
de: Ein Anhang pro Artikel
sr: Један прилог по чланку

source: Currently, it's only possible to attach one file per outgoing message. It has to be one of the supported media types (see above).
de: Derzeit ist es nur möglich, eine Datei pro ausgehender Nachricht anzuhängen. Es muss sich um einen der unterstützten Medientypen handeln (siehe oben).
sr: Тренутно је могуће приложити једну датотеку по одлазној поруци. Неопходно је да буде једна од подржаних типова медија (погледајте изнад).

source: File size for attachments
de: Dateigröße für Anhänge
sr: Дозвољене величине прилога

source: There are different maximum file sizes for different media types. To pick the most important ones:
de: Für die verschiedenen Medientypen gibt es unterschiedliche maximale Dateigrößen. Die wichtigsten davon sind:
sr: Различите величине прилога су у оптицају за различите типове медија. Излиставамо најбитније:

source: document: 100 MB
de: Dokument: 100 MB
sr: документ: 100 MB

source: image: 5 MB
de: Bild: 5 MB
sr: слика: 5 MB

source: sticker: 100/500 KB (static/animated)
de: Sticker: 100/500 KB (statisch/animiert)
sr: стикер: 100/500 KB (статилни/анимирани)

source: To read more in detail, have a look at their `documentation of supported media types <https://developers.facebook.com/docs/whatsapp/cloud-api/reference/media#supported-media-types>`_.
de: Weitere Informationen finden Sie in der `Dokumentation der unterstützten Medientypen <https://developers.facebook.com/docs/whatsapp/cloud-api/reference/media#supported-media-types>`_.
sr: За више детаља, погледајте њихову `документацију у вези подржаних типова медија <https://developers.facebook.com/docs/whatsapp/cloud-api/reference/media#supported-media-types>`_.

source: One phone number per app
de: Eine Telefonnummer pro App
sr: Један број телефона по апликацији

source: If you want to use more than one phone number, you have to create a business app for each number you want to use and add it as a separate channel in Zammad.
de: Wenn Sie mehr als eine Rufnummer verwenden möchten, müssen Sie für jede Nummer, die Sie verwenden möchten, eine eigene Business App erstellen und diese als separaten Kanal in Zammad hinzufügen.
sr: Уколико желите да користите више од једног броја телефона, мораћете да креирате по једну апликацију за сваки број који желите да користите и додате је као посебан канал у Zammad-у.

source: Here you can find instructions for the required steps you need to take before you can use the WhatsApp channel in Zammad.
de: Hier finden Sie eine Anleitung für die erforderlichen Schritte, die Sie durchführen müssen, bevor Sie den WhatsApp-Kanal in Zammad nutzen können.
sr: Овде можете пронаћи упутства за неопходне кораке које морате да предузмете пре него што можете користити WhatsApp канал у Zammad-у.

source: Please note that these steps may change in the future, depending on changes on Meta's side. You should also consider to read their docs if you have issues:
de: Bitte beachten Sie, dass sich diese Schritte in Zukunft ändern können, je nach Änderungen auf Meta-Seite. Sie sollten auch deren Dokumente lesen, wenn Sie Probleme haben:
sr: Напомињемо да се ови кораци могу променити у будућности, у зависности од измена од стране Meta-е. Такође узмите у обзир и њихову документацију у случају да имате проблема:

source: `WhatsApp Business Platform <https://developers.facebook.com/docs/whatsapp>`_
de: `WhatsApp Business-Plattform <https://developers.facebook.com/docs/whatsapp>`_
sr: `WhatsApp Business платформа <https://developers.facebook.com/docs/whatsapp>`_

source: Create a Meta Business Account
de: Erstellen Sie ein Meta Business Konto
sr: Креирање Meta Business налога

source: If you don't already have a business account, visit https://business.facebook.com/overview and click on "Create an account":
de: Wenn Sie noch keinen Business-Account haben, besuchen Sie https://business.facebook.com/overview und klicken Sie auf "Konto erstellen":
sr: Уколико још увек немате Business налог, посетите https://business.facebook.com/overview и кликните на "Create an account":

source: Meta business account starting page
de: Meta-Business-Account-Startseite
sr: Почетна страница Meta Business налога

source: Have a look at `Meta's documentation <https://www.facebook.com/business/help/1710077379203657?id=180505742745347>`_ if you have problems.
de: Schauen Sie in die `Dokumentation von Meta <https://www.facebook.com/business/help/1710077379203657?id=180505742745347>`_, wenn Sie Probleme haben.
sr: Погледајте `Meta документацију <https://www.facebook.com/business/help/1710077379203657?id=180505742745347>`_ у случају проблема.

source: Create a Meta Developer Account
de: Erstellen Sie ein Meta-Entwickler-Konto
sr: Креирање Meta Developer налога

source: If you don't have a developer account already, go to https://developers.facebook.com/docs/development/register and register a new account.
de: Wenn Sie noch kein Entwicklerkonto haben, gehen Sie zu https://developers.facebook.com/docs/development/register und erstellen Sie ein neues Konto.
sr: Уколико још увек немате Developer налог, посетите https://developers.facebook.com/docs/development/register и региструјте нов налог.

source: Create a Meta Developer App
de: Erstellen Sie eine Meta-Entwickler-App
sr: Креирање Meta Developer апликације

source: While already logged in with your developer account, go to https://developers.facebook.com/apps/.
de: Wenn Sie bereits mit Ihrem Entwickleraccount eingeloggt sind, gehen Sie zu https://developers.facebook.com/apps/.
sr: Док сте пријављени вашим Developer налогом, посетите https://developers.facebook.com/apps/.

source: You will see a screen like the following screenshot. Click on "Create App" and follow the steps below.
de: Es wird ein Bildschirm wie in folgender Abbildung angezeigt. Klicken Sie auf "App erstellen" und folgen Sie den nachstehenden Schritten.
sr: Видећете прозор као на следећем снимку екрана. Кликните на "Create App" и пратите кораке испод.

source: Meta developer app overview
de: Übersicht Meta-Entwickler-App
sr: Преглед Meta Developer апликације

source: Choose "Other" when you are asked what you want to do with your app:
de: Wählen Sie "Andere", wenn Sie gefragt werden, was Sie mit Ihrer App machen wollen:
sr: Изаберите "Other" као одговор на питање шта желите да урадите помоћу ваше апликације:

source: Meta app creation step 1
de: Meta-App-Erstellung Schritt 1
sr: Корак 1 креирања Meta апликације

source: Choose "Business" as app type:
de: Wählen Sie "Business" als App-Typ:
sr: Изаберите "Business" као врсту апликације:

source: Meta app creation step 2
de: Meta-App-Erstellung Schritt 2
sr: Корак 2 креирања Meta апликације

source: Enter a name for the app, a contact email address and a business account. Please note that the name may not contain specific product names from Meta, as you can see in the screenshot below.
de: Geben Sie einen Namen für die App, eine Kontakt-E-Mail-Adresse und einen Business-Account ein. Bitte beachten Sie, dass der Name keine spezifischen Produktnamen von Meta enthalten darf, wie Sie auf dem Screenshot unten sehen können.
sr: Унесите назив апликације, контакт имејл адресу и Business налог. Обратите пажњу да назив не може садржати специфичне називе Meta производа, као што се види на снимку екрана испод.

source: If you already have a business account, you should assign it. In this step, this is optional, but later it is required anyway. Click on "Create App" to finish this step.
de: Wenn Sie bereits einen Business Account haben, sollten Sie es zuweisen. In diesem Schritt ist dies optional, aber später ist es trotzdem erforderlich. Klicken Sie auf "App erstellen", um diesen Schritt abzuschließen.
sr: Уколико већ имате Business налог, доделите га апликацији. У овом кораку ово је опционо, али накнадно ће свакако бити захтевано. Кликните на "Create App" да бисте завршили овај корак.

source: Add WhatsApp Product to Your App
de: WhatsApp-Product zu Ihrer App hinzufügen
sr: Додавање WhatsApp производа вашој апликацији

source: Now you have to add a product to your app. In our case, this is WhatsApp. Search for it and click on "Set up":
de: Nun müssen Sie ein Produkt zu Ihrer App hinzufügen. In unserem Fall ist dies WhatsApp. Suchen Sie danach und klicken Sie auf "Einrichten":
sr: Сада је неопходно да додате производ у вашу апликацију. У вашем случају, ово је WhatsApp. Потражите га и кликните на "Set up":

source: In the next step, you have to add a "Meta Business Account". This guide assumes that you already have one. If not, go to the :ref:`instructions above <create-meta-business-account>` and create one.
de: Im nächsten Schritt müssen Sie ein "Meta Business Konto" hinzufügen. In dieser Anleitung wird davon ausgegangen, dass Sie bereits eines haben. Falls nicht, gehen Sie zu den :ref:`Anweisungen oben <create-meta-business-account>` und erstellen Sie eines.
sr: У следећем кораку, мораћете да доделите „Meta Business налог”. Овај водич подразумева да га већ поседујете. Уколико то није случај, идите на :ref:`упутство изнад <create-meta-business-account>` и отворите га.

source: Add the product WhatsApp to your app
de: Fügen Sie das Produkt WhatsApp zu Ihrer App hinzu
sr: Додавање WhatsApp производа у вашу апликацију

source: Create a System User
de: Erstellen Sie einen System-Benutzer
sr: Креирање системског корисника

source: Go to `Users > System users <https://business.facebook.com/settings/system-users/>`_ and add a system user. This is required to get a permanent API token. Make sure the user has admin permissions.
de: Gehen Sie zu `Benutzer > Systembenutzer <https://business.facebook.com/settings/system-users/>`_ und fügen Sie einen Systembenutzer hinzu. Dies ist erforderlich, um ein dauerhaftes API-Token zu erhalten. Stellen Sie sicher, dass der Benutzer über Administratorrechte verfügt.
sr: Идите на `Users > System users <https://business.facebook.com/settings/system-users/>`_ и креирајте системског корисника. Ово је неопходно ради издавања трајног API кључа. Водите рачуна да корисник има администраторске дозволе.

source: After creating a system user, you should see a screen similar to the one below. Here you can assign assets and (re-)generate an access token.
de: Nachdem Sie einen Benutzer angelegt haben, sollten Sie eine ähnliche Ansicht wie die folgende sehen. Hier können Sie Assets zuweisen und ein Token für den Zugang (neu) generieren.
sr: По креирању системског корисника, видећете прозор сличан снимку екрана испод. Овде можете доделити апликацију и (ре)генерисати приступни кључ.

source: For now we just assign assets to this user. The creation of the token is covered in the :doc:`Zammad setup section </channels/whatsapp/index>` because the token is only displayed once and then you can copy and paste it directly.
de: Im Moment ordnen wir diesem Benutzer nur Assets zu. Die Erstellung des Tokens wird in der :doc:`WhatsApp-Einrichtung in Zammad </channels/whatsapp/index>` behandelt, da das Token nur einmal angezeigt wird und Sie es dann direkt kopieren und einfügen können.
sr: За сада ћемо само доделити апликацију овом кориснику. Генерација кључа је покривена у :doc:`одељку подешавања Zammad-а </channels/whatsapp/index>` с обзиром да је кључ приказан само једанпут и онда га директно копирате и налепљујете.

source: System user overview
de: Übersicht über Systembenutzer
sr: Преглед системских корисника

source: You now have to assign assets to this user. Choose your app and "Manage app" permissions:
de: Sie müssen diesem Benutzer nun Assets zuweisen. Wählen Sie Ihre App und die Berechtigung "App verwalten":
sr: Сада је неопходно да доделите апликацију овом кориснику. Одаберите своју апликацију и "Manage app" дозволе:

source: Assign assets to system user
de: Zuweisung von Assets zum User
sr: Додељивање апликације системском кориснику

source: Configure Your WhatsApp Business Platform
de: Konfigurieren Sie Ihre WhatsApp Business-Plattform
sr: Подешавање ваше WhatsApp Business платформе

source: After adding a "Meta Business Account" to your app, the "App Dashboard" is presented to you. Click on "Start using the API":
de: Nachdem Sie ein "Meta Business Account" zu Ihrer App hinzugefügt haben, wird Ihnen das "App Dashboard" präsentiert. Klicken Sie auf "Start using the API":
sr: По додели „Meta Business налога” вашој апликацији, приказаће вам се контролна табла апликације. Кликните на „Start using the API”:

source: App dashboard overview
de: App-Dashboard Übersicht
sr: Контролна табла апликације

source: Assign an Unused Phone Number
de: Zuweisen einer unbenutzten Rufnummer
sr: Додељивање неискоришћеног броја телефона

source: Please note: this number may not be used in a WhatsApp app already!
de: Bitte beachten Sie: Diese Nummer darf nicht bereits in einer WhatsApp-App verwendet werden!
sr: Напомена: овај број не сме већ употребљен у WhatsApp апликацији!

source: Adding a new phone number to your app
de: Hinzufügen einer neuen Telefonnummer zu Ihrer App
sr: Додавање новог броја телефона вашој апликацији

source: Click through the steps adding your information. You have to verify your number by receiving a security code and repeating it when asked.
de: Klicken Sie sich durch die Schritte zur Eingabe Ihrer Daten. Sie müssen Ihre Nummer verifizieren, indem Sie einen Sicherheitscode erhalten und diesen bei Aufforderung wiederholen.
sr: Идите кроз кораке и додајте ваше информације. Биће неопходно да потврдите свој број примањем сигурносног кода и понављањем истог када буде затражен.

source: After you successfully performed these steps, you are now good to go with the :doc:`setup on Zammad side <index>`. 🎉
de: Nachdem Sie diese Schritte erfolgreich durchgeführt haben, können Sie nun mit der :doc:`Einrichtung auf der Zammad-Seite <index>` beginnen. 🎉
sr: По успешном извршавању ових корака, спремни сте да наставите са :doc:`поставком на Zammad страни <index>`. 🎉

source: We promise it will become easier! 🤓
de: Wir versprechen, es wird einfacher! 🤓
sr: Обећавамо да ће од сада постати лакше! 🤓

source: First, make sure you have followed our :doc:`preparation guide<preparation>`.
de: Stellen Sie zunächst sicher, dass Sie die :doc:`Vorbereitungsschritte <preparation>` erledigt haben.
sr: Прво, уверите се да сте испратили наш :doc:`припремни водич <preparation>`.

source: Then, check if you meet the following requirements:
de: Prüfen Sie dann, ob Sie die folgenden Voraussetzungen erfüllen:
sr: Затим, проверите да ли сте обезбедили следеће услове:

source: Make sure your system is accessible from the internet because WhatsApp sends messages via webhooks to your system.
de: Stellen Sie sicher, dass Ihr System über das Internet erreichbar ist, da WhatsApp Nachrichten über Webhooks an Ihr System sendet.
sr: Обезбедите да је ваш систем доступан преко интернета зато што WhatsApp шаље поруке на ваш систем путем повратних позива.

source: Make sure to have properly setup your :doc:`FQDN in Settings > System </settings/system/base>` (for the callback URL Meta will use to deliver new messages).
de: Stellen Sie sicher, dass Sie Ihren :doc:`FQDN in Einstellungen > System </settings/system/base>` richtig eingerichtet haben (für die Callback URL, die Meta für die Zustellung neuer Nachrichten verwenden wird).
sr: Обезбедите да сте исправно подесили ваш :doc:`FQDN у Подешавања > Систем </settings/system/base>` (ради генерисања адресе повратног позива који ће Meta користити за доставу нових порука).

source: Setup
de: Einrichtung
sr: Подешавање

source: First of all, make sure to match the prerequisites and to read the limitations above. If you did not setup your Meta Developer account, Meta Business account and Meta Developer app, first go to our :doc:`preparation page <preparation>` and come back here after finishing it.
de: Stellen Sie zunächst sicher, dass die Voraussetzungen erfüllt sind und lesen Sie die oben genannten Einschränkungen. Wenn Sie Ihren Meta Developer Account, Ihren Meta Business Account und Ihre Developer App noch nicht eingerichtet haben, gehen Sie zuerst auf unsere :doc:`Seite mit den Vorbereitungen <preparation>` und fahren Sie dann hier fort.
sr: Пре свега, уверите се да задовољавате све услове и да сте прочитали ограничења изнад. Уколико нисте подесили ваш Meta Developer налог, Meta Business налог и вашу Developer апликацију, погледајте прво нашу :doc:`страницу за припрему <preparation>` и вратите се овде да наставите.

source: Then head over to Zammad's admin panel to add the WhatsApp channel under "Channels > WhatsApp > Add Account" and follow the steps which are described below.
de: Gehen Sie dann zum Einstellungsbereich von Zammad, um den WhatsApp-Kanal unter "Kanäle > WhatsApp > Konto hinzufügen" hinzuzufügen und befolgen Sie die unten beschriebenen Schritte.
sr: Након тога идите у Zammad-ов панел администратора и додајте WhatsApp канал под „Канали > WhatsApp > Додај налог” и пратите кораке описане испод.

source: Step 1
de: Schritt 1
sr: Корак 1

source: In the first step you have to provide credentials of your account/app:
de: Im ersten Schritt müssen Sie die Zugangsdaten für Ihr Konto/Ihre App angeben:
sr: У првом кораку морате обезбедити креденцијале вашег налога/апликације:

source: Step 1 of adding a WhatsApp account
de: Schritt 1 des Hinzufügens eines WhatsApp Kontos
sr: Корак 1 приликом додавања WhatsApp налога

source: Enter your WhatsApp Business Account ID. You can find it in your app under "WhatsApp > API Setup":
de: Geben Sie die ID Ihres WhatsApp Business Accounts ein. Sie finden diese in Ihrer App unter "WhatsApp > API Setup":
sr: Унесите ваш WhatsApp Business ID налога. Можете га пронаћи у вашој апликацији под „WhatsApp > API Setup”:

source: App dashboard with business account ID
de: App-Dashboard mit ID des Business Accounts
sr: Контролна табле апликације са ID business налога

source: Access Token
de: Zugangstoken
sr: Приступни кључ

source: Enter the access token from your app. You can create it in the `business settings <https://business.facebook.com/settings/system-users>`_ under "System Users". The system user has to have "Admin access". Be aware that you have to copy the token, it is just displayed once!
de: Geben Sie das Token für den Zugang zu Ihrer Anwendung ein. Sie können es in den `Business Einstellungen <https://business.facebook.com/settings/system-users>`_ unter "System Benutzer" erstellen. Der Benutzer muss über "Admin-Zugang" verfügen. Achten Sie darauf, dass Sie das Token kopieren müssen, es wird nur einmal angezeigt!
sr: Унесите приступни кључ из ваше апликације. Можете га креирати у `business подешавањима <https://business.facebook.com/settings/system-users>`_ под „System Users”. Системски корисник мора имати „Admin access”. Обратите пажњу да морате ископирати кључ, биће приказан само једанпут!

source: Get your app token from the system user
de: Holen Sie sich das Token für Ihre App vom Systembenutzer
sr: Преузмите приступни кључ из системског корисника

source: Choose your created app, an expiration date of the token (we recommend "Never") and the permissions ``whatsapp_business_management`` and ``whatsapp_business_messaging``:
de: Wählen Sie Ihre erstellte App, ein Ablaufdatum des Tokens (wir empfehlen "Nie") und die Berechtigungen ``whatsapp_business_management`` und ``whatsapp_business_messaging``:
sr: Одаберите вашу апликацију, датум истека кључа (предлажемо „Never”) и ``whatsapp_business_management`` и ``whatsapp_business_messaging`` дозволе:

source: Create your app token
de: Erstellen Sie Ihr App-Token
sr: Креирајте ваш приступни кључ

source: Enter your app secret. You can find it in your `app dashboard <https://developers.facebook.com/apps/>`_ under "App settings > Basic" by clicking on the "Show" button:
de: Geben Sie Ihr App-Secret ein. Sie finden es in Ihrem "App-Dashboard <https://developers.facebook.com/apps/>`_" unter "App-Einstellungen > Basis", indem Sie auf die Schaltfläche "Anzeigen" klicken:
sr: Унесите вашу шифру апликације. Можете је пронаћи у вашој `контролној табли апликације <https://developers.facebook.com/apps/>`_ под „App settings > Basic” кликом на дугме „Show”:

source: App dashboard with app secret
de: App-Dashboard mit App-Secret
sr: Контролна табла апликације са шифром апликације

source: After entering your data, click on **Next**. In the background, Zammad tries to fetch your assigned phone number, which you can select in the next step.
de: Nachdem Sie Ihre Daten eingegeben haben, klicken Sie auf **Weiter**. Im Hintergrund versucht Zammad, die zugewiesene Telefonnummer abzurufen, die Sie im nächsten Schritt auswählen können.
sr: По уносу података, кликните на **Следеће**. У позадини, Zammad ће покушати да презгме ваше додељен број телефона, који можете потврдити у следећем кораку.

source: Step 2
de: Schritt 2
sr: Корак 2

source: The second step is about your phone number and messaging details:
de: Im zweiten Schritt geht es um Ihre Telefonnummer und um Angaben zur Kommunikation:
sr: Други корак је у вези вашег броја телефона и комуникације:

source: Step 2 of adding a WhatsApp account
de: Schritt 2 des Hinzufügens eines WhatsApp Kontos
sr: Корак 2 приликом додавања WhatsApp налога

source: Phone Number
de: Telefonnummer
sr: Број телефона

source: Choose the phone number you want to use for the channel. Zammad should have fetched the numbers which are assigned to your business app. If not, your credentials from step 1 may be wrong.
de: Wählen Sie die Telefonnummer, die Sie für den Kanal verwenden möchten. Zammad sollte die Nummern abgerufen haben, die Ihrer Unternehmens-App zugewiesen sind. Wenn nicht, sind Ihre Zugangsdaten aus Schritt 1 möglicherweise falsch.
sr: Изаберите број телефона који желите да користите за канал. Zammad ће приказати бројеве који су додељени вашој апликацији. Уколико их не видите, ваши креденцијали из корака 1 су можда неипсравни.

source: Welcome Message
de: Willkommens-Nachricht
sr: Порука добродошлице

source: Here you can define an optional text message which is automatically sent to your customers when the initial message is received.
de: Hier können Sie eine optionale Nachricht definieren, die an Ihre Kunden gesendet wird, wenn Sie eine initiale Nachricht erhalten.
sr: Овде можете дефинисати опциону поруку која се аутоматски шаље вашим клијентима по пријему иницијалне поруке.

source: Automatic Reminders
de: Automatische Erinnerungen
sr: Аутоматски подсетници

source: Here you can control whether the automatic reminders about the customer service window are sent to the customer when the window is about to expire.
de: Hier können Sie steuern, ob die automatischen Benachrichtigungen über das Service-Zeitfenster an den Kunden gesendet werden sollen, wenn das Zeitfenster abläuft.
sr: Овде можете дефинисати да ли се аутоматски подсетници о временском оквиру разговора шаљу клијенту пре истицања истог.

source: For more information on 24-hour customer service windows, take a look at Meta's `conversation description <https://developers.facebook.com/docs/whatsapp/pricing#customer-service-windows>`_ under "Customer Service Windows".
de: Weitere Informationen zum 24-stündigen Kundenservice-Zeitfenster finden Sie in der entsprechenden `Beschreibung von Meta <https://developers.facebook.com/docs/whatsapp/pricing#customer-service-windows>`_ unter "Customer Service Windows".
sr: За више информација о 24-часовном временском оквиру за разговор, погледајте Meta-ин `опис разговора <https://developers.facebook.com/docs/whatsapp/pricing#customer-service-windows>`_ под „Customer Service Windows”.

source: Reminder Message
de: Erinnerungs-Nachricht
sr: Порука подсетника
