Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: These settings **apply to all tickets and all users across the entire system**.
de: Diese Einstellungen **gelten für alle Tickets und alle Benutzer im gesamten System**.
sr: Ова подешавања **важе за све тикете и за све кориснике у целом систему**.

source: You can only see the icon and adjust the settings if you have admin permissions.
de: Sie können das Symbol nur sehen und die Einstellungen anpassen, wenn Sie über Administratorrechte verfügen.
sr: Иконицу можете видети и подешавања изменити само уколико имате администраторске дозволе.

source: Note - default visibility
de: Hinweis - Standard-Sichtbarkeit
sr: Напомена - подразумевана видљивост

source: This setting decides what the default visibility of note articles is. This affects **only** notes (default article on ticket answering). The visibility of phone- and email article notes is not affected.
de: Diese Einstellung legt fest, wie die Standard-Sichtbarkeit von Notiz-Artikeln aussieht. Dies betrifft **nur** Notizen (Standardartikel bei der Beantwortung von Tickets). Die Sichtbarkeit von Telefon- und E-Mail-Artikel-Notizen ist davon nicht betroffen.
sr: Ово подешавање одређује која је подразумевана видљивост чланака напомене. Ово утиче **само** на напомене (подразумевани тип чланка при одговарању на тикет). Не утиче на видљивост чланака позива и имејл канала.

source: Default: ``internal``
de: Standard: ``intern``
sr: Подразумевано: ``интерно``

source: Article - visibility confirmation dialog
de: Artikel - Bestätigungsdialog zur Sichtbarkeit
sr: Чланак - дијалог потврде видљивости

source: This setting allows administrators to enforce a confirmation dialog to agents when they're trying to change the article visibility from internal to public.
de: Mit dieser Einstellung können Administratoren von den Agenten eine Bestätigung einfordern, wenn sie versuchen, die Sichtbarkeit eines Artikels von intern auf öffentlich zu ändern.
sr: Ово подешавање омогућава администраторима да наметну приказ дијалога за потврду оператерима када покушавају да промене видљивост чланка са интерне на јавну.

source: This setting affects all article types within UI, no matter if the article exists already or it's still a writing draft.
de: Diese Einstellung wirkt sich auf alle Artikeltypen aus, unabhängig davon, ob der Artikel bereits existiert oder noch im Entwurfsstadium ist.
sr: Ово подешавање утиче на све типове чланака унутар корисничког интерфејса, без обзира да ли чланак већ постоји или је још увек у нацрту.

source: Default: ``no``
de: Standardwert: ``Nein``
sr: Подразумевано: ``не``

source: Email - subject field
de: E-Mail - Betreff
sr: Имејл - поље предмета

source: When setting this option to ``yes``, Zammad will also display the subject field when answering via email articles. It doesn't matter if you click on ``reply`` or switch to email article manually. In this case, the subject can differ between title and email.
de: Wenn Sie diese Option auf ``Ja`` setzen wird Zammad das Betreff-Feld anzeigen, wenn Sie über E-Mail-Artikel antworten. Dabei spielt es keine Rolle, ob Sie auf ``antworten`` klicken oder manuell zum E-Mail-Artikel umschalten. In diesem Fall kann sich der Betreff zwischen Titel und E-Mail unterscheiden.
sr: Када подесите ову опцију на ``да``, Zammad ће такође приказати поље предмета приликом писања одговора на имејл чланке. Није важно да ли кликнете на ``одговори`` или ручно се пребаците на имејл чланак. У овом случају, предмет се може разликовати од наслова и имејла.

source: If set to ``no``, Zammad will automatically use the tickets title as subject.
de: Wenn diese Option auf ``Nein`` gesetzt ist, wird Zammad automatisch den Titel des Tickets als Betreff verwenden.
sr: Уколико је подешено на ``не``, Zammad ће аутоматски користити наслов тикета као предмет чланка.

source: Email - full quote
de: E-Mail - gesamtes Zitieren
sr: Имејл - цео цитат

source: Setting this option to ``yes`` will always add the content of the answered article as quotation below your signature.
de: Wenn Sie diese Option auf ``Ja`` setzen, wird der Inhalt der beantworteten E-Mail immer als Zitat unterhalb Ihrer Signatur eingefügt.
sr: Подешавање ове опције на ``да`` ће увек додати садржај чланка на који одговорate као цитат испод вашег потписа.

source: This does not affect the "mark and quote" functionality, if you mark a text with this setting enabled, we'll use the marked text as quote instead.
de: Dies hat keinen Einfluss auf die Funktion "Markieren und Zitieren". Wenn Sie einen Text markieren und auf "antworten" oder "weiterleiten" klicken, wird der markierte Text stattdessen als Zitat verwendet.
sr: Ово не утиче на функцију „означи и цитирај“, ако означите текст са овим подешавањем омогућеним, уместо тога ће се користити означени текст као цитат.

source: Email - quote header
de: E-Mail - Zitatüberschrift
sr: Имејл - заглавље цитата

source: If you don't want Zammad to add the date, time and name or the article you're quoting, set this to ``no``.
de: Wenn Sie nicht möchten, dass Zammad das Datum, die Uhrzeit und den Namen einfügt, setzen Sie dies auf ``Nein``.
sr: Ако не желите да Zammad дода датум, време и име или чланак који цитирате, поставите ово на ``не``.

source: Example: ``On Thursday, June 27, 2019, 3:37:11 PM, Jacob Smith wrote:``
de: Beispiel: ``Am Donnerstag, 27. Juni 2019 um 15:37:11, schrieb Jacob Smith: ``
sr: Пример: ``У четвртак, 27. јун 2019. 15:37:11, Jacob Smith је написао/ла:``

source: After the basic setup of Zammad with the getting started wizard, you will see hints how to use the UI (see "Intro" below if you want to see them again).
de: Nach der grundlegenden Einrichtung von Zammad mit dem Einrichtungsassistenten erhalten Sie Hinweise zur Verwendung der Benutzeroberfläche (siehe "EInführung" unten, wenn Sie diese nochmals sehen möchten).
sr: По основној поставци Zammad-а путем чаробњака за почетак, биће вам приказани савети како да користите интерфејс (погледајте „Увод” испод уколико желите да их опет видите).

source: After these hints, the dashboard is presented to you which is basically the Zammad start page. This dashboard provides some useful information for the agents.
de: Nach diesen Hinweisen wird Ihnen das Dashboard präsentiert, das im Grunde die Startseite von Zammad ist. Dieses Dashboard bietet einige nützliche Informationen für die Agenten.
sr: Након ових савета, биће вам приказана контролна табла која је уствари почетна Zammad страница. Ова контролна табла пружа корисне информације оператерима.

source: You can switch to the "First Steps" section on top of the page to see useful links for the start. Depending on your configuration and permission, your list may look different.
de: Sie können zum Abschnitt "Erste Schritte" oben auf der Seite wechseln, um nützliche Links für den Start mit Zammad zu sehen. Je nach Ihrer Konfiguration und Ihren Berechtigungen kann Ihre Liste anders aussehen.
sr: Можете се пребацити на одељак „Први кораци” при врху странице да бисте прегледали корисне линкове за почетак. На основу ваше конфигурације и дозвола, ваша листа може изгледати другачије.

source: Screenshot showing highlighted "First Steps" section
de: Screenshot mit hervorgehobenem Abschnitt "Erste Schritte"
sr: Снимак екрана који приказује наглашен одељак „Први кораци”

source: Link to the :doc:`branding section in the settings </settings/branding>`.
de: Link zum Bereich :doc:`Branding in den Einstellungen </settings/branding>`.
sr: Линк на :doc:`брендинг одељак у подешавањима </settings/branding>`.

source: Your Email Configuration
de: Ihre E-Mail-Konfiguration
sr: Ваша имејл подешавања

source: Link to the :doc:`email channel section in the settings </channels/email/index>`.
de: Link zum Bereich :doc:`E-Mail-Kanal in den Einstellungen </channels/email/index>`.
sr: Линк на :doc:`одељак имејл канала у подешавањима </channels/email/index>`.

source: Invite agents/colleagues to help working on tickets
de: Laden Sie Agenten/Kollegen ein, um gemeinsam an Tickets zu arbeiten
sr: Позив оператерима/колегама да вам помогну око тикета

source: Here you can invite agents/colleagues to work with you in Zammad. It opens a dialog in which you can provide details and assign a role.
de: Hier können Sie Agenten/Kollegen einladen, mit Ihnen in Zammad zu arbeiten. Es öffnet sich ein Dialog, in dem Sie Details angeben und eine Rolle zuweisen können.
sr: Овде можете позвати оператере/колеге да радите заједно у Zammad-у. Отвара дијалог у коме можете унети детаље и доделити улогу.

source: Screenshot invite colleagues/agents dialog
de: Screenshot Dialog Kollegen/Agenten einladen
sr: Снимак екрана који приказује дијалог за позив колега/оператера

source: Make sure to have configured the :doc:`roles and permission </manage/roles/index>` according to your needs before inviting. To send the invitations via email, you have to configure an :doc:`email notification channel </channels/email/accounts/email-notification>` before too.
de: Stellen Sie sicher, dass Sie die :doc:`Rollen und Berechtigungen </manage/roles/index>` entsprechend Ihren Bedürfnissen konfiguriert haben, bevor Sie Einladungen versenden. Um die Einladungen per E-Mail zu verschicken, müssen Sie auch einen :doc:`E-Mail-Benachrichtigungskanal </channels/email/accounts/email-notification>` konfiguriert haben.
sr: Обратите пажњу да подеисте :doc:`улоге и дозволе </manage/roles/index>` у складу са вашим потребама пре слања позивница. За слање имејл позивница, мораћете да прво подесите и :doc:`канал имејл обавештења </channels/email/accounts/email-notification>`.

source: Invite customers to create issues in Zammad
de: Laden Sie Kunden ein um in Zammad Tickets zu erstellen
sr: Позовите клијенте да отворе тикете у Zammad-у

source: Similar to the invitation of agents, you can invite customers to create tickets/articles and to view them in the web UI. Of course, your customers can create tickets anyway if they send you an email to a address which is configured as an email channel. They even get an account created automatically. For more information, a good starting point is the :doc:`users section </manage/users/index>`.
de: Ähnlich wie bei der Einladung von Agenten können Sie Kunden einladen, Tickets/Artikel zu erstellen und diese in der Web-UI anzuzeigen. Natürlich können Ihre Kunden ohnehin Tickets erstellen, wenn sie Ihnen eine E-Mail an eine Adresse schicken, die als E-Mail-Kanal konfiguriert ist. Sie bekommen sogar automatisch ein Konto erstellt. Ein guter Ausgangspunkt für weitere Informationen ist der Abschnitt :doc:`Benutzer </manage/users/index>`.
sr: Слично као са позивањем оператера, можете позвати клијенте да отворе тикете и додају чланке и да их прегледају у веб интерфејсу. Наравно, ваши клијенти могу свакако да отворе тикете уколико вам пошаљу имејл поруку на адресу која је подешена као имејл канал. Чак ће аутоматски добити и налог. За више информације, погледајте :doc:`одељак о корисницима </manage/users/index>`.

source: How to Use it
de: Wie funktioniert es
sr: Како користити

source: Intro
de: Einführung
sr: Увод

source: Here you can access the hints which you have seen after finishing the getting started wizard. Click on "Next" to see all of them or click on the X-button on the top right corner to close them.
de: Hier können Sie auf die Hinweise zugreifen, die Sie nach Beendigung des Einrichtungsassistenten gesehen haben. Klicken Sie auf "Weiter", um alle Hinweise zu sehen, oder klicken Sie auf das "X" in der oberen rechten Ecke, um sie zu schließen.
sr: Овде можете прегледати савете који су приказани приликом комплетирања чаробњака за почетак. Кликните на „Следеће” да их све прегледате или кликните на дугме X у горњем десном углу да их затворите.

source: Screenshot showing hint after finishing basic setup of Zammad
de: Screenshot mit Hinweis nach Abschluss der Grundeinrichtung von Zammad
sr: Снимак екрана који приказује савете по завршетку чаробњака за почетак

source: Create Text Modules
de: Text-Bausteine erstellen
sr: Додавање текстуалних исечака

source: Link to the :doc:`text module section in the settings </manage/text-modules>`.
de: Link zum Bereich :doc:`Textmodule in den Einstellungen </manage/text-modules>`.
sr: Линк на :doc:`одељак текстуалних исечака у подешавањима </manage/text-modules>`.

source: Create Macros
de: Makros erstellen
sr: Додавање макроа

source: Link to the :doc:`macro section in the settings </manage/macros>`.
de: Link zum Bereich :doc:`Makros in den Einstellungen </manage/macros>`.
sr: Линк на :doc:`одељак макроа у подешавањима </manage/macros>`.

source: Additional Channels
de: Zusätzliche Kanäle
sr: Додатни канали

source: Link to the :doc:`Facebook channel in the settings </channels/facebook>`.
de: Link zum Bereich :doc:`Facebook-Kanal in den Einstellungen </channels/facebook>`.
sr: Линк на :doc:`Facebook канал у подешавањима </channels/facebook>`.

source: Link to the :doc:`chat channel in the settings </channels/chat>`.
de: Link zum Bereich :doc:`Chat-Kanal in den Einstellungen </channels/chat>`.
sr: Линк на :doc:`канал ћаскања у подешавањима </channels/chat>`.

source: Online Forms
de: Online-Formulare
sr: Онлајн форме

source: Link to the :doc:`form channel in the settings </channels/form>`.
de: Link zum Bereich :doc:`Formular-Kanal in den Einstellungen </channels/form>`.
sr: Линк на :doc:`канал форми у подешавањима </channels/form>`.

source: Object Conditions
de: Objektbedingungen
sr: Услови објекта

source: This page describes the attribute checks you can execute for different object attributes. You can use these checks in different places in Zammad like :doc:`triggers </manage/trigger>` or defining :doc:`overviews </manage/overviews>`. Please note that the available attributes and the condition operators depend on the object context and where you want to use it.
de: Diese Seite beschreibt die Attributprüfungen, die Sie für verschiedene Objektattribute durchführen können. Sie können diese Prüfungen an verschiedenen Stellen in Zammad verwenden, wie z.B. :doc:`Trigger </manage/trigger>` oder bei der Definition von :doc:`Übersichten </manage/overviews>`. Bitte beachten Sie, dass die verfügbaren Attribute und Operatoren vom Objektkontext abhängen und davon, wo Sie diese verwenden wollen.
sr: Ова страна описује све провере атрибута које можете извршити за различите објекте. Ове провере можете подесити на разним местима у Zammad-у, нпр. у :doc:`окидачима </manage/trigger>` или приликом уређивања :doc:`прегледа </manage/overviews>`. Обратите пажњу да доступни атрибути и оператори услова зависе од контекста објекта и места где желите да их користите.

source: With these object attribute conditions you should be able to create quite complex conditions. However, if you need to have additional AND/OR relations for your conditions, have a look at the :doc:`expert mode </misc/object-conditions/expert-mode>` section, where you can find a description how to use it.
de: Mit diesen Objekt-Attribut-Bedingungen sollten Sie in der Lage sein, komplexe Bedingungen zu erstellen. Wenn Sie jedoch zusätzliche UND/ODER-Verknüpfungen für Ihre Bedingungen benötigen, werfen Sie einen Blick in den Abschnitt :doc:`Experten-Modus </misc/object-conditions/expert-mode>`, wo Sie eine Beschreibung finden, wie Sie diesen verwenden kann.
sr: Са овим условима атрибута објекта бићете у могућности да дефинишете прилично комплексне услове. Међутим, уколико су вам неопходни додатни AND/OR оператори у вашим условима, погледајте одељак о :doc:`стручном режиму </misc/object-conditions/expert-mode>`, где можете пронаћи објашњење о начину коришћења.

source: Object Types
de: Objekttypen
sr: Врсте објеката

source: Depending on the location and selected attribute, the object context may change. The default basic objects in Zammad are:
de: Je nach Feature und ausgewähltem Attribut kann sich der Objektkontext ändern. Die Standard-Basisobjekte in Zammad sind:
sr: На основу места и одабраног атрибута, контекст објекта може бити другачији. Подразумевани основни објекти у Zammad-у су:

source: Group
de: Gruppe
sr: Група

source: Within these 4 objects, you can even create your :doc:`own custom attributes </system/objects>` and use them for conditions. However, there are more object types and special context depending on the feature you want to create a condition:
de: Innerhalb dieser 4 Objekte können Sie sogar Ihre :doc:`eigenen benutzerdefinierten Attribute </system/objects>` erstellen und sie für Bedingungen verwenden. Es gibt jedoch noch weitere Objekttypen und spezielle Funktionen, je nachdem, für welches in welchem Bereich Sie eine Bedingung erstellen möchten:
sr: У случају ова 4 објеката, можете чак додати и ваше :doc:`сопствене прилагођене атрибуте </system/objects>` и користити их у условима. Међутим, постоји још типова објеката и посебних контекста у зависности од функције за коју желите да дефинишете услов:

source: Article
de: Artikel
sr: Чланак

source: Execution time
de: Ausführungszeit
sr: Време извршавања

source: Session
de: Sitzung
sr: Сесија

source: Attribute Types
de: Attribut-Typen
sr: Врсте атрибута

source: Depending on the attribute type, you can choose from different operators to execute checks and build your conditions. Have a look below where you can find a table with special functions followed by a listing of attribute types and their operators.
de: Je nach Attributstyp können Sie aus verschiedenen Operatoren wählen, um Prüfungen durchzuführen und Ihre Bedingungen zu erstellen. Im Folgenden finden Sie eine Tabelle mit speziellen Funktionen, gefolgt von einer Auflistung der Attribut-Typen und ihrer Operatoren.
sr: У зависности од врсте атрибута, можете одабрати између различитих оператора за извршавање провера и изградње услова. Погледајте испод где можете пронаћи табелу посебних функција као и списак типова атрибута и њихових оператора.

source: Special Fields
de: Spezialfelder
sr: Посебна поља

source: There are built in functions in Zammad which are selectable while creating or editing a condition. Find them in the following table.
de: Es gibt in Zammad eingebaute Funktionen, die beim Erstellen oder Bearbeiten einer Bedingung ausgewählt werden können. Sie finden sie in der folgenden Tabelle.
sr: Постоје уграђене функције у Zammad-у које су доступне приликом додавања или уређивања услова. Пронађите их у следећој табели.

source: Field
de: Feld
sr: Поље

source: Operators
de: Operatoren
sr: Оператори

source: Offered values
de: Mögliche Werte
sr: Понуђене вредности

source: Article,
de: Artikel,
sr: Чланак,

source: Checks performed action.
de: Prüft die durchgeführte Aktion.
sr: Проверава извршену радњу.

source: Only available in triggers.
de: Nur in Triggern verfügbar.
sr: Доступно само у окидачима.

source: is
de: ist
sr: је

source: is not
de: ist nicht
sr: није

source: created
de: erstellt
sr: додато

source: updated
de: aktualisiert
sr: освежено

source: merged into
de: zusammengefasst zu
sr: спојено са

source: received merge
de: hierauf zusammengefasst
sr: примљено спајање

source: Execution
de: Ausführung
sr: Извршавање

source: time
de: Zeit
sr: време

source: Checks if event is in working time.
de: Prüft, ob das Ereignis in der Arbeitszeit liegt.
sr: Проверава да ли је догађај у току радног времена.

source: Only available in triggers and scheduler.
de: Nur in Triggern und in Automatisierung verfügbar.
sr: Доступно само у окидачима и планерима.

source: is in working time
de: ist innerhalb der Arbeitszeit
sr: је у току радног времена

source: is not in working time
de: ist außerhalb der Arbeitszeit
sr: није у току радног времена

source: Pre-defined calendars
de: Vordefinierte Kalender
sr: Предефинисани календари

source: Checks ticket customer.
de: Prüft Ticket-Kunde.
sr: Проверава клијента тикета.

source: has changed
de: wurde verändert
sr: је измењено

source: specific user
de: spezifischer Benutzer
sr: конкретан корисник

source: not set
de: ist nicht gesetzt
sr: није постављено

source: Detected
de: Ermittelt
sr: Откривени

source: Language
de: Sprache
sr: Језик

source: Checks the language of the article.
de: Prüft die Sprache des Artikels.
sr: Проверава језик чланка.

source: All languages which
de: Alle Sprachen, die
sr: Сви језици који

source: are supported by the
de: unterstützt werden
sr: су подржани од стране

source: language detection
de: vom Spracherkennungs-
sr: сервиса за откривање

source: Existing
de: Bestehend
sr: Постојеће

source: members
de: Mitglieder
sr: чланови

source: Checks if organization
de: Prüft, ob die Organisation
sr: Проверава да ли организација

source: has members.
de: Mitglieder hat.
sr: има чланове.

source: customer/
de: Kunde/
sr: клијент/

source: owner
de: Besitzer

source: Checks if tickets are assigned.
de: Prüft, ob Tickets zugewiesen sind.
sr: Проверава да ли су тикети додељени.

source: Only available in scheduler.
de: Nur in der Automatisierung verfügbar.
sr: Доступно само у планерима.

source: Checks affected group.
de: Prüft die betroffene Gruppe.
sr: Проверава захваћену групу.

source: All configured and
de: Alle konfigurierten und
sr: Све подешене и

source: active groups.
de: aktiven Gruppen.
sr: укључене групе.

source: Checks affected organization.
de: Prüft die betroffene Organisation.
sr: Проверава захваћену организацију.

source: current user organization
de: Organisation des aktuellen Benutzers
sr: организација тренутног корисника

source: specific organization
de: spezifische Organisation
sr: конкретна организација

source: Checks the owner.
de: Prüft den Besitzer.
sr: Проверава власника.

source: not set (not defined)
de: nicht gesetzt (nicht definiert)
sr: није постављено (није одређено)

source: Sender
de: Absender
sr: Пошиљалац

source: Checks the type of sender.
de: Prüft den Typ des Absenders.
sr: Проверава врсту пошиљаоца.

source: Checks ticket state.
de: Prüft den Status des Tickets.
sr: Проверава стање тикета.

source: All configured
de: Alle konfigurierten
sr: Сва подешена

source: ticket states.
de: Ticket-Status.
sr: стања тикета.

source: Subscribe
de: Abonniert
sr: Претплата

source: Checks if user is a
de: Prüft, ob der Benutzer ein
sr: Проверава да ли је корисник

source: ticket subscriber
de: Ticket Abonnent
sr: претплатник тикета

source: Checks tags of a ticket.
de: Prüft die Tags eines Tickets.
sr: Проверава ознаке тикета.

source: contains all
de: enthält alle
sr: садржи све

source: contains one
de: enthält eins
sr: садржи једно

source: contains all not
de: enthält alle nicht
sr: не садржи све

source: contains one not
de: enthält eins nicht
sr: не садржи једно

source: Text input field
de: Text-Eingabefeld
sr: Поље уноса текста

source: Time
de: Zeit
sr: Време

source: Accounting
de: Erfassung
sr: обрачуна

source: Checks if time is accounted.
de: Prüft, ob Zeit erfasst ist.
sr: Проверава да ли је обрачунато време.

source: is set
de: ist gesetzt
sr: је постављено

source: Checks the type of the article.
de: Prüft den Typ des Artikels.
sr: Проверава врсту чланка.

source: All available
de: Alle verfügbaren
sr: Све доступне

source: article types.
de: Artikel-Typen.
sr: врсте чланка.

source: Visibility
de: Sichtbarkeit
sr: Видљивост

source: Checks the visibility
de: Prüft die Sichtbarkeit
sr: Проверава видљивост

source: of the article.
de: des Artikels.
sr: чланка.

source: internal
de: intern
sr: интерно

source: public
de: öffentlich
sr: јавно

source: Text Field
de: Textfeld
sr: Поље текста

source: Checks if any field of type text contains a specific string. The configured "Type" of input fields has no impact on the available options.
de: Prüft, ob ein Feld vom Typ Text eine bestimmte Zeichenfolge enthält. Der konfigurierte "Typ" von Eingabefeldern hat keinen Einfluss auf die verfügbaren Optionen.
sr: Проверава да ли поље уноса текста садржи одговарајући низ. Подешена врста поља за унос нема утицаја на доступне опције.
