Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: This step is only required if you didn't consent the permissions in App registration as administrator on behalf of your users. If you do not use this kind of security measurement, simply skip to `Add a New Account`_.
de: Dieser Schritt ist nur notwendig, wenn Sie keine Berechtigung für die App-Registrierung als Administrator im Namen anderer Benutzer haben. Falls Sie diese Einstellung nicht verwenden, können Sie diesen Schritt überspringen und zu `Add a New Account`_ gehen.
sr: Овај корак је неопходан само ако нисте дали сагласност за дозволе у регистрацији апликације као администратор у име својих корисника. Ако не користите ову врсту мера безбедности, једноставно пређите на `Додај налог`_.

source: Requesting the consent
de: Anforderung der Erlaubnis
sr: Тражење сагласности

source: Within Zammad click on **Request Admin Consent** in order to request consent from your administrators. This is required in some tenants.
de: Klicken Sie in Zammad auf **Administrator Zustimmung beantragen**. Das ist in manchen Tenants notwendig.
sr: У оквиру Zammad-а кликните на **Захтев за сагласност администратора** да бисте затражили сагласност од својих администратора. Ово је потребно код неких станара.

source: If your admin already provided consent, you'll be automatically authenticated, if this happens, continue with `Add a New Account`_.
de: Falls Ihr Administrator dies bereits bestätigt hat werden Sie automatisch authentifiziert und Sie können mit `Neuen Account hinzufügen`_ fortfahren.
sr: Ако је ваш администратор већ дао сагласност, бићете аутоматски аутентификовани, ако се то догоди, наставите са `Додај налог`_.

source: After authenticating against Microsoft and providing a reason for your request, you'll be redirect to the Zammad app. Zammad will then tell you to wait for your administrators consent. The consent grant or denial will be sent by mail.
de: Nachdem Sie authentifiziert sind und einen Grund dafür angegeben haben, werden Sie zu Zammad weitergeleitet. Zammad zeigt Ihnen dann an, dass Sie auf die Bestätigung Ihres Administrators warten müssen. Die Bestätigung oder Ablehnung wird Ihnen per Mail gesendet.
sr: Након аутентификације у Microsoft-у и навођења разлога за ваш захтев, бићете преусмерени на Zammad апликацију. Zammad ће вам тада рећи да сачекате сагласност вашег администратора. Давање или одбијање сагласности биће послато имејлом.

source: Granting the consent (admin users)
de: Zugriff Gewähren (Administrator Benutzer)
sr: Давање сагласности (администратори)

source: Within **Enterprise applications** in the Entra admin center, go to **Admin consent requests**. You'll find all your user grant requests here.
de: Gehen Sie innerhalb von **Unternehmensanwendungen** im Entra Admin Center zu **Anforderungen zur Administratoreinwilligung**. Hier finden Sie alle Genehmigungsanträge Ihrer Benutzer.
sr: У оквиру **Enterprise applications** унутар Entra admin портала, идите на **Admin consent requests**. Овде ћете пронаћи све захтеве својих корисника.

source: Clicking on a request allows you to review which user requested the consent for what app. Click on **Review permissions and consent** to start the grant process. You'll be asked for credentials - these credentials are the administrator credentials *not* the ones of the mailbox user to add.
de: Wenn Sie auf eine Anfrage klicken, können Sie sehen, welcher Benutzer die Einwilligung für welche App angefordert hat. Klicken Sie auf **Berechtigungen und Zustimmung prüfen**, um den Prozess zu starten. Sie werden hier nach Anmeldeinformationen gefragt. Bei diesen Anmeldeinformationen handelt es sich um die Administrator-Anmeldeinformationen, nicht um die des jeweiligen Postfachbenutzers.
sr: Кликом на захтев можете да видите који корисник је затражио сагласност за коју апликацију. Кликните на **Review permissions and consent** да бисте започели процес одобравања. Биће вам затражени акредитиви - ови акредитиви су администраторски акредитиви *а не* они корисника поштанског сандучета које треба додати.

source: After you've granted the request, continue with "Add a New Account" below.
de: Nachdem Sie der Anfrage zugestimmt haben, fahren Sie mit "Ein neues Konto hinzufügen" fort.
sr: Након што одобрите захтев, наставите са одељком „Додај налог” испод.

source: Add a New Account
de: Hinzufügen eines neuen Kontos
sr: Додајте нови налог

source: Click on Add Account to add your Microsoft 365 account to Zammad
de: Klicken Sie auf Konto hinzufügen, um Ihr Microsoft 365 Konto zu Zammad hinzuzufügen
sr: Кликните на Додај налог да бисте додали свој Microsoft 365 налог у Zammad

source: Click **Add Account** to connect your Microsoft 365 accounts to Zammad. You will be redirected to a Microsoft sign-in and confirmation page. Enter your credentials and confirm it by clicking the **Accept** button.
de: Klicken Sie auf **Konto hinzufügen**, um Ihre Microsoft 365 Konten mit Zammad zu verbinden. Sie werden zu einer Microsoft-Anmelde- und Bestätigungsseite weitergeleitet. Geben Sie Ihre Zugangsdaten ein und bestätigen Sie sie mit einem Klick auf die Schaltfläche **Akzeptieren**.
sr: Кликните на **Додај налог** да бисте повезали своје Microsoft 365 налоге са Zammad-ом. Бићете преусмерени на Microsoft страницу за пријављивање и потврду. Унесите своје креденцијале и кликните на дугме **Accept**.

source: **Aliases are not imported automatically.**
de: **Aliasse werden nicht automatisch importiert.**
sr: **Псеудоними се не увозе аутоматски.**

source: See :doc:`secondary-addresses` to add them yourself.
de: Siehe :doc:`secondary-addresses`, um sie selbst hinzuzufügen.
sr: Погледајте :doc:`секундарне адресе <secondary-addresses>` да бисте их сами додали.

source: Screenshot showing channel configuration during adding account for M365
de: Screenshot zeigt das Hinzufügen eines Kontos für M365
sr: Снимак екрана који приказује подешавање канала приликом додавања налога за M365

source: Use :doc:`filters </channels/microsoft365/filters>` for more fine-grained sorting of incoming email.
de: Verwenden Sie :doc:`Filter </channels/microsoft365/filters>` für eine feinere Sortierung der eingehenden E-Mails.
sr: Користите :doc:`филтере </channels/microsoft365/filters>` за прецизније сортирање долазне поште.

source: Specify which folder (or *label*) to fetch from, or leave empty to fetch from ``INBOX``.
de: Legen Sie den Ordner (oder das *Label*) fest, der abgerufen werden soll oder lassen Sie es leer, um die gesamte ``INBOX`` abzurufen.
sr: Одредите из ког фолдера (или *ознаке*) желите да преузимате или оставите празно за преузимање из ``INBOX``.

source: If specifying a nested folder, be sure to use the full path; e.g. ``Inquiries/Tech-Support``.
de: Sofern Sie einen Ordner angegeben haben, der sich in einem anderen Ordner befindet, geben Sie bitte den vollen Pfad an, z.B. ``Anfragen/Tech-Support``.
sr: Ако наведете угнежђени фолдер, обавезно користите пуну путању; нпр. ``Inquiries/Tech-Support``.

source: ``no`` Zammad deletes all imported messages
de: ``nein`` Zammad entfernt alle importierten Nachrichten
sr: ``не`` Zammad брише све увезене поруке

source: ``yes`` Zammad marks imported messages as read
de: ``ja`` Zammad markiert alle importierten Nachrichten als gelesen
sr: ``да`` Zammad означава увезене поруке као прочитане

source: (With this option, Zammad will only import unread messages. This means Zammad may miss messages if the mailbox is externally modified.)
de: (Mit dieser Einstellung importiert Zammad ausschließlich ungelesene Nachrichten. Das bedeutet, dass Zammad Nachrichten übersieht, wenn das Postfach extern verändert wird.)
sr: (Са овом опцијом, Zammad ће увести само непрочитане поруке. То значи да Zammad може пропустити поруке ако је поштанско сандуче измењено споља.)

source: After adding the account
de: Nach dem Hinzufügen des Accounts
sr: Након додавања налога

source: After successfully adding the Microsoft 365 mail account, you can adjust the default group Zammad is going to assign incoming new tickets to by clicking the group name under "Destination Group":
de: Nach dem erfolgreichen Hinzufügen des Microsoft 365 E-Mail-Kontos können Sie die Standardgruppe, der Zammad neu eingehende Tickets zuweist, anpassen, indem Sie auf den Gruppennamen unter "Zielgruppe" klicken:
sr: Након успешног додавања Microsoft 365 налога, можете да прилагодите подразумевану групу којој ће Zammad доделити нове тикете одабиром назива групе под „Одредишна група”:

source: Only **active** groups will be displayed.
de: Nur **aktive** Gruppen werden angezeigt.
sr: Биће приказане само **активне** групе.

source: Changing this setting will not reassign existing tickets to the new group.
de: Die Änderung dieser Einstellung wird bestehende Tickets keiner neuen Gruppe zuordnen.
sr: Измена овог подешавања неће преместити постојеће тикете у нову групу.

source: I successfully added my account, but Zammad isn't fetching new email
de: Ich habe mein Konto erfolgreich hinzugefügt, aber Zammad ruft keine E-Mails daraus ab
sr: Успешно сам додао свој налог, али Zammad не преузима нову пошту

source: If you specified a :ref:`custom folder/label to fetch from <microsoft365-folder>`, are you sure incoming mail is arriving in that folder?
de: Falls Sie einen :ref:` speziellen Ordner oder ein spezielles Label <microsoft365-folder>` angegeben haben, stellen Sie bitte sicher, dass E-Mails auch dort ankommen.
sr: Ако сте навели :ref:`прилагођен фолдер/ознаку за преузимање <microsoft365-folder>`, да ли сте сигурни да долазна пошта стиже у тај фолдер?

source: My mailbox was working fine but suddenly it fails with ``EXPUNGE FAILED``
de: Mein Postfach hat einwandfrei funktioniert, aber plötzlich kommt die Fehlermeldung ``EXPUNGE FAILED``
sr: Моје поштанско сандуче је добро функционисало, али одједном не успе са ``EXPUNGE FAILED``

source: This is a Microsoft 365 specific issue which you have to solve with Microsoft. However, you can have a look at `Microsofts documentation <https://docs.microsoft.com/en-us/exchange/recipients-in-exchange-online/manage-user-mailboxes/change-deleted-item-retention>`_ which might allow you to solve the issue on your own.
de: Dies ist ein Microsoft 365-spezifisches Problem, das Sie mit Microsoft lösen müssen. Sie können jedoch einen Blick in deren `Dokumentation <https://docs.microsoft.com/en-us/exchange/recipients-in-exchange-online/manage-user-mailboxes/change-deleted-item-retention>`_ werfen, um das Problem möglicherweise selbst zu lösen.
sr: Ово је специфичан проблем за Microsoft 365 који морате да решите са Microsfot-ом. Међутим, можете погледати `Microsoft документацију <https://docs.microsoft.com/en-us/exchange/recipients-in-exchange-online/manage-user-mailboxes/change-deleted-item-retention>`_ која вам може омогућити да сами решите проблем.

source: As soon as the issue has been fixed, the Zammad channel will recover automatically.
de: Sobald das Problem behoben wurde, wird der Zammad-Kanal wieder automatisch funktionieren.
sr: Чим се проблем реши, Zammad канал ће се аутоматски опоравити.

source: Have a look at the :doc:`common errors section <../common-errors>` if you still face issues with your M365 account.
de: Werfen Sie einen Blick in den Abschnitt :doc:`häufige Fehler <../common-errors>`, wenn Sie immer noch Probleme mit Ihrem M365 Konto haben.
sr: Погледајте :doc:`одељак о уобичајеним грешкама <../common-errors>` уколико и даље имате проблема са вашим M365 налогом.

source: Managing accounts in Microsoft 365 channels works in the same way as in email channels. This is why the section has been adopted verbatim from :doc:`here </channels/email/accounts/managing-accounts>`.
de: Die Verwaltung von Konten in Microsoft 365-Kanälen funktioniert auf die gleiche Weise wie in E-Mail-Kanälen. Deshalb wurde der Abschnitt wörtlich von :doc:`hier </channels/email/accounts/managing-accounts>` übernommen.
sr: Управљање налозима Microsoft 365 каналa функционише идентично као за имејл канале. Зато је овај чланак дословно пренешен :doc:`одавде </channels/email/accounts/managing-accounts>`.

source: See :ref:`New Account Settings <microsoft365-folder>` for a detailed description of each option.
de: Siehe :ref:`Neues Konto einrichten <microsoft-folder>` für eine detaillierte Beschreibung der einzelnen Optionen.
sr: Погледајте :ref:`Нова подешавања налога <microsoft365-folder>` за детаљан опис сваке опције.

source: Groups need an assigned an address to send outgoing emails. If you delete a group’s assigned address, agents belonging to that group won’t be able to send emails until you assign it a new one.
de: Gruppen benötigen eine zugewiesene E-Mail-Adresse, um Nachrichten zu verschicken. Wenn Sie eine E-Mail-Adresse löschen, die einer Gruppe zugewiesen ist, können deren Agenten keine Nachrichten mehr verschicken bis Sie eine neue Zuweisung vornehmen.
sr: Групама је потребна додељена адреса за слање одлазних имејл порука. Ако избришете додељену адресу групи, оператери који припадају тој групи неће моћи да шаљу имејл поруке док јој не доделите нову.

source: Migrate From Email Channel to Microsoft 365 Channel
de: Umwandeln eines E-Mail-Kanals in einen Microsoft 365-Kanal
sr: Пређите са имејл канала на Microsoft 365 канал

source: Migrate
de: Migrieren
sr: Миграција

source: Zammad provides a migration logic that allows you to migrate existing Microsoft 365 accounts from the Email channel to the Microsoft 365 channel.
de: In Zammad gibt es eine Migrations-Funktion, mit der Sie ein als E-Mail-Kanal existierendes Microsoft 365-Konto in einen Microsoft 365-Kanal umwandeln können.
sr: Zammad обезбеђује логику миграције која вам омогућава да мигрирате постојеће Microsoft 365 налоге са имејл канала на канал Microsoft 365.

source: In order for Zammad to display the migration option, it expects the channels hostname to be ``outlook.office365.com`` for IMAP and ``smtp.office365.com`` for SMTP.
de: Damit Zammad die Umwandlung anbietet, muss der Hostname ``outlook.office365.com`` für IMAP und ``smtp.office365.com`` für SMTP lauten.
sr: Да би Zammad приказао опцију миграције, очекује да назив сервера канала буде ``outlook.office365.com`` за IMAP и ``smtp.office365.com`` за SMTP.

source: The easiest way to start the migration is to :doc:`register-app` for your Microsoft accounts before migrating. However, if you don't, Zammad will ask you to provide your app credentials before allowing you to continue.
de: Die einfachste Methode für die Umwandlung ist, für Ihre Microsoft-Konten eine :doc:`register-app` vor der Migration durchzuführen. Sofern Sie das nicht machen, wird Sie Zammad nach den Zugangsdaten fragen, bevor Sie weitermachen können.
sr: Најлакши начин да започнете миграцију је да doc:`региструјете апликацију <register-app>` за своје Microsoft налоге пре миграције. Међутим, ако то не учините, Zammad ће од вас тражити да доставите акредитиве за апликацију пре него што вам дозволи да наставите.

source: If you're ready to go, simply click on the *Migrate now!* button in the red banner of the email channel in question. Zammad will redirect you to Microsoft and request you to authenticate and consent to said account.
de: Wenn Sie bereit sind, klicken Sie einfach auf den *Jetzt migrieren!* Button im roten Banner des betreffenden E-Mail-Kanals. Sie werden dann zu Microsoft weitergeleitet und müssen sich dort authentifizieren und zustimmen.
sr: Ако сте спремни да почнете, једноставно кликните на дугме *Мигрирај одмах!* на црвеном банеру дотичног имејл канала. Zammad ће вас преусмерити на Microsoft и затражити од вас да потврдите аутентичност и пристанете на наведену операцију.

source: After you pressed next you'll be redirect to Zammad's Microsoft 365 channel overview. Your channel, if successful, is now migrated to a Microsoft 365 IMAP channel.
de: Nachdem Sie auf "Weiter" geklickt haben, werden Sie zur Übersicht über den Microsoft 365-Kanal von Zammad weitergeleitet. Ihr Kanal, sofern erfolgreich, wurde nun zu einem Microsoft 365 IMAP-Kanal migriert.
sr: Након што наставите даље, бићете преусмерени на Zammad-ов преглед Microsoft 365 канала. По успешној миграцији, ваш канал је сада Microsoft 365 IMAP канал.

source: Migrate an existing email channel to Microsoft 365
de: Umwandeln eines existierenden E-Mail-Kanals in einen Microsoft 365 Kanal
sr: Пренесите постојећи имејл канал на Microsoft 365

source: Setting up a new Microsoft 365 account? Follow our basic setup guide to get started.
de: Sie möchten ein neues Microsoft 365 Konto einrichten? Folgen Sie unserer Anleitung zur grundlegenden Einrichtung, um loszulegen.
sr: Подешавате нови Microsfot 365 канал? Пратите наш основни водич за почетак.

source: First, you'll have to connect Zammad to your Microsoft account as an **OAuth app** in the Microsoft Entra portal. Once that's done, you'll be able to connect as many Microsoft 365 accounts to Zammad as you want, using only active Microsoft 365 browser sessions (no usernames or passwords required).
de: Zunächst müssen Sie Zammad über das Microsoft Entra-Portal als **OAuth-App** mit Ihrem Microsoft-Konto verbinden. Sobald dies erledigt ist, können Sie beliebig viele Microsoft 365-Konten mit Zammad verbinden und dabei nur eine aktive Browsersitzung verwenden (keine Benutzernamen oder Passwörter erforderlich).
sr: Прво ћете морати да повежете Zammad са својим Microsoft налогом као **OAuth апликацију** унутар Microsoft Entra портала. Када то буде одрађено, моћи ћете да повежете онолико Microsoft 365 налога са Zammad-ом колико желите, користећи само активне Microsoft 365 сесије у претраживачу (нису потребна корисничка имена или лозинке).

source: Preparation
de: Vorbereitung
sr: Припрема

source: Go to *Channels > Microsoft 365 IMAP Email* and click on **Connect Microsoft 365 App**. Copy the provided callback URL.
de: Gehen Sie zu *Kanäle > Microsoft 365 IMAP E-Mail* und klicken Sie auf **Microsoft 365 App verbinden**. Kopieren Sie die angezeigte Callback-URL.
sr: Идите на *Канали > Microsoft 365 IMAP имејл* и кликните на **Повежи Microsoft 365 апликацију**. Ископирајте наведени URL повратног позива.

source: Step-by-Step
de: Schritt für Schritt
sr: Корак по корак

source: To get started, head over to `Microsoft's Entra Portal <https://entra.microsoft.com>`_. Make sure to use an admin account for your organization. Otherwise, an admin will have to approve your changes before they can take effect.
de: Um loszulegen, gehen Sie zu `Microsofts Entra-Portal <https://entra.microsoft.com>`_. Stellen Sie sicher, dass Sie ein Administratorkonto für Ihre Organisation verwenden. Andernfalls muss ein Administrator Ihre Änderungen genehmigen, bevor sie loslegen können.
sr: Да бисте започели, идите на `Microsoft Entra портал <https://entra.microsoft.com>`_. Обратите пажњу да користите администраторски налог своје организације. У супротном, администратор ће морати да одобри ваше промене пре него што буду уважене.

source: Accounts in any organizational directory (Multitenant) and personal Microsoft accounts (e.g. Skype, Xbox)
de: Konten in beliebigen Organisationsverzeichnissen (Multitenant) und persönliche Microsoft Konten (z.B. Skype, Xbox)
sr: Налози у било ком организационом директоријуму (за више корисника) и лични Microsoft налози (нпр. Skype, Xbox)

source: "Personal Microsoft accounts only" are not supported.
de: "Nur persönliche Microsoft-Konten" werden nicht unterstützt.
sr: „Само лични Microsoft налози“ нису подржани.

source: Admin Consent (optional)
de: Administrator-Zustimmung (optional)
sr: Сагласност администратора (необавезно)

source: This step is only required for tenants that require admin consent. Admin consent adds another layer of security for your tenants users and allows administrators to define who may share user information.
de: Dieser Schritt ist nur bei Tenants erforderlich, bei denen eine Administrator-Zustimmung eingerichtet ist. Die Zustimmung des Administrators bietet eine weitere Sicherheitsebene für die Benutzer Ihres Tenants und ermöglicht es Administratoren zu definieren, wer Benutzerinformationen weitergeben darf.
sr: Овај корак је потребан само за кориснике којима је потребна сагласност администратора. Сагласност администратора додаје још један ниво безбедности за ваше кориснике и омогућава администраторима да дефинишу ко може да дели информације о корисницима.

source: Within *Enterprise applications* select your app. When creating an app within *App registrations*, Microsoft will automatically also create an enterprise application for you.
de: Wählen Sie unter *Unternehmensanwendungen* Ihre App aus. Wenn Sie im Rahmen der *App-Registrierungen* eine App erstellen, erstellt Microsoft automatisch auch eine Unternehmensanwendung für Sie.
sr: У оквиру *Enterprise applications* изаберите своју апликацију. Када креирате апликацију у оквиру *App registrations*, Microsoft ће аутоматски креирати и пословну апликацију за вас.

source: Set *Assignment required* to ``Yes`` within the apps properties and hit *Save*. This generally activates your app requesting admin consent already.
de: Setzen Sie *Zuweisung erforderlich* in den App-Eigenschaften auf ``Ja`` und klicken Sie auf *Speichern*. Dies aktiviert Ihre App und fordert die Zustimmung des Administrators an.
sr: Поставите *Assignment required* на ``Yes`` у оквиру својстава апликације и притисните *Save*. Ово обично активира вашу апликацију која већ захтева сагласност администратора.

source: Screenshot showing enabled assignment requirement
de: Screenshot mit aktivierter Anforderung der Zuweisung
sr: Снимак екрана који приказује омогућавање захтева за доделу

source: Tightening your App (recommended, optional)
de: Optimierung der App (empfohlen, optional)
sr: Пооштравање безбедности ваше апликације (препоручено, необавезно)

source: This step will protect your tenant users from -to admins- unwanted permission changes (e.g. requesting more permissions than originally noted).
de: Dieser Schritt schützt Ihre Tenant-Benutzer vor unerwünschten Anpassungen der Berechtigungen (z.B. der Anforderung von mehr Berechtigungen als ursprünglich angegeben).
sr: Овај корак ће заштитити кориснике од нежељених промена дозвола за администраторе (нпр. захтевање више дозвола него што је првобитно наведено).

source: It also has another benefit: You can add the email account in question immediately without any administrator being forced to step in manually.
de: Es hat noch einen weiteren Vorteil: Sie können das betreffende E-Mail-Konto sofort hinzufügen, ohne dass ein Administrator manuell eingreifen muss.
sr: Такође има још једну предност: можете одмах додати дотични имејл налог без да било који администратор буде приморан да се умешта.

source: Still within *Enterprise applications* select *Users and groups*. In this section you can select specific users and / or groups (users must be direct members!) that are allowed to use your app for adding mailboxes to Zammad.
de: Wählen Sie in *Unternehmensanwendungen* > *Benutzer und Gruppen* aus. In diesem Abschnitt können Sie bestimmte Benutzer und/oder Gruppen auswählen (Benutzer müssen direkte Mitglieder sein!), die Ihre App zum Hinzufügen von Postfächern zu Zammad verwenden dürfen.
sr: Још увек у оквиру *Enterprise applications* изаберите *Users and groups*. У овом одељку можете да изаберете одређене кориснике и/или групе (корисници морају бити директни чланови!) којима је дозвољено да користе вашу апликацију за додавање поштанских сандучића у Zammad.
