Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: This header allows you to overwrite auto detects for e.g. ``precedence: list``.
de: Dieser Header erlaubt es, die automatische Erkennung zum Beispiel für ``precedence: list`` zu übersteuern.
sr: Ово заглавље вам омогућава да преиначите аутоматске детекције за нпр. ``precedence: list``.

source: Ticket Attributes
de: Ticket Attribute
sr: Атрибути тикета

source: Zammad allows you to use headers to manipulate ticket creations or follow ups. The manipulation can be used instead of triggers. Triggers are considered *after* header settings and thus can still override headers.
de: Mit Zammad können Sie Header verwenden, um die Erstellung von Tickets oder Rückfragen anzupassen. Die Manipulation kann anstelle von Triggern verwendet werden. Trigger werden *nach* den Auswertung der Header ausgeführt und können deshalb E-Mail-Header außer Kraft setzen.
sr: Zammad вам омогућава да користите заглавља за манипулисање отварања тикета или додавања наставака. Манипулација се може користити уместо окидача. Окидачи се разматрају *након* подешавања заглавља и стога и даље могу поништити заглавља.

source: To differentiate between ticket creation and follow-up:
de: Um zwischen Ticket-Erstellung und Nachfrage zu unterscheiden:
sr: За прављење разлике између отварања тикета и додавања наставака:

source: For creations use: ``X-Zammad-Ticket-{Attribute Name}``
de: Verwenden Sie für die Erstellung: ``X-Zammad-Ticket-{Attribute Name}``
sr: За отварање користите: ``X-Zammad-Ticket-{назив атрибута}``

source: For follow ups use: ``X-Zammad-Ticket-FollowUp-{Attribute Name}``
de: Verwenden Sie für Antworten: ``X-Zammad-Ticket-FollowUp-{Attribute Name}``
sr: За додавање наставака користите: ``X-Zammad-Ticket-FollowUp-{назив атрибута}``

source: This allows you to ensure the changes are only applied in the required situation.
de: Das erlaubt es, die Änderungen nur in der erforderlichen Situation auszuführen.
sr: Ово вам омогућава да осигурате да се измене примењују само у потребној ситуацији.

source: When using attributes that require date / time values, ensure to use Time Zoned Times. e.g. for 28th September 2021 on 8 am CEST, you can use one of the following examples:
de: Wenn Sie Attribute verwenden, die Datums-/Zeitwerte enthalten, stellen Sie sicher, dass Sie Zeitzonen angeben. Beim Beispiel für den 28. September 2021 um 8 Uhr MESZ können Sie eines der folgenden Beispiele verwenden:
sr: Када користите атрибуте који захтевају вредности датума/времена, уверите се да користите временске зоне. на пример. за 28. септембар 2021. у 8:00 по средњеевропском времену (CEST), можете користити један од следећих примера:

source: Allows you to adjust a ticket's priority.
de: Ermöglicht Ihnen die Anpassung der Ticket-Priorität.
sr: Омогућава вам да подесите приоритет тикета.

source: Example: ``X-Zammad-Ticket-Priority: 1 low``
de: Beispiel: ``X-Zammad-Ticket-Priority: 1 low``
sr: Пример: ``X-Zammad-Ticket-Priority: 1 low``

source: Allows you interfere with regular channel routing of the ticket.
de: Ermöglicht Ihnen, in die reguläre Gruppenzuweisung einzugreifen.
sr: Омогућава вам да ометате редовно рутирање канала тикета.

source: Example: ``X-Zammad-Ticket-Group: Sales``
de: Beispiel: ``X-Zammad-Ticket-Group: Verkauf``
sr: Пример: ``X-Zammad-Ticket-Group: Sales``

source: Directly assign or change the ticket owner. Valid values are either ``login`` or ``Email``
de: Weisen Sie ein Ticket direkt einem Besitzer zu oder ändern Sie diesen. Gültige Werte sind entweder ``Login`` oder ``E-Mail``
sr: Директно доделите или измените власника тикета. Важеће вредности су или ``login`` или ``email``

source: Example: ``X-Zammad-Ticket-Owner: jdoe``
de: Beispiel: ``X-Zammad-Ticket-Owner: jdoe``
sr: Пример: ``X-Zammad-Ticket-Owner: jdoe``

source: Set a specific ticket state.
de: Setzen Sie einen bestimmten Ticket-Status.
sr: Подесите одређено стање тикета.

source: Example: ``X-Zammad-Ticket-State: closed``
de: Beispiel: ``X-Zammad-Ticket-State: closed``
sr: Пример: ``X-Zammad-Ticket-State: closed``

source: Pending states always require the ``pending_time`` attribute on top.
de: Warten-Status erfordern immer das ``pending_time``-Attribut zusätzlich.
sr: Стања на чекању увек захтевају и атрибут ``pending_time``.

source: Example: ``X-Zammad-Ticket-Pending_Time: 2021-09-26T08:00:00+0200``
de: Beispiel: ``X-Zammad-Ticket-Pending_Time: 2021-09-26T08:00:00+0200``
sr: Пример: ``X-Zammad-Ticket-Pending_Time: 2021-09-26T08:00:00+0200``

source: Manipulate the ticket customer - this can be a different user than the actual sender. Replying to the original sender is still possible.
de: Verändern Sie den Kunden des Tickets. Das kann ein anderer Benutzer sein als der Absender. Antworten an den Original-Absender sind weiterhin möglich.
sr: Манипулишите клијентом тикета - ово може бити корисник различит од стварног пошиљаоца. Одговор оригиналном пошиљаоцу је и даље могућ.

source: Example: ``X-Zammad-Customer-Email: jdoe@example.com``
de: Beispiel: ``X-Zammad-Customer-Email: jdoe@example.com``
sr: Пример: ``X-Zammad-Customer-Email: jdoe@example.com``

source: This header is not available for follow ups.
de: Dieser Header steht für Follow-Ups nicht zur Verfügung.
sr: Ово заглавље није доступно за наставке.

source: Example: ``X-Zammad-Customer-Login: jdoe``
de: Beispiel: ``X-Zammad-Customer-Login: jdoe``
sr: Пример: ``X-Zammad-Customer-Login: jdoe``

source: Article Attributes
de: Artikel Attribute
sr: Атрибути чланка

source: If needed Zammad allows you to manipulate attributes or states of fetched email articles.
de: Zammad erlaubt es, die Attribute und den Status von Artikeln für bereits abgerufene E-Mails zu verändern.
sr: Ако је потребно, Zammad вам омогућава да манипулишете атрибутима или стањима преузетих имејл чланака.

source: Manipulate the sender type (agent, customer or system)
de: Passen Sie den Absender-Typ an (Agent, Kunde oder System)
sr: Манипулишите типом пошиљаоца (agent, customer или system)

source: Example: ``X-Zammad-Article-Sender: System``
de: Beispiel: ``X-Zammad-Article-Sender: System``
sr: Пример: ``X-Zammad-Article-Sender: System``

source: System Emails are indicated in a similar way as trigger-responses. Users can't see them natively and see only a indicator like that:
de: System-E-Mails werden in ähnlicher Weise angezeigt wie Trigger-Antworten. Benutzer können sie nicht direkt sehen und sehen nur einen Indikator wie diesen:
sr: Системске поруке су назначене на сличан начин као и аутоматски одговори. Корисници их не могу видети у изворном облику и приказују се само као следећи индикатори:

source: Received mail as article sender system
de: Eingehende E-Mail als Artikel vom Absender-Typ System
sr: Примљена пошта као чланак системског пошиљаоца

source: Change the article type of your incoming mail. This requires you to know which article types are available in your system.
de: Ändert den Artikel-Typ von eingehenden E-Mails. Das setzt voraus, dass Sie wissen welche Artikel-Typen in Ihrem System verfügbar sind.
sr: Промените тип чланка ваше долазне поште. Ово захтева да знате који су типови чланака доступни у вашем систему.

source: Example: ``X-Zammad-Article-Type: phone``
de: Beispiel: ``X-Zammad-Article-Type: phone``
sr: Пример: ``X-Zammad-Article-Type: phone``

source: This header can cause *serious issues* in your instance and may lead to unexpected behavior. Only use with absolute care!
de: Dieser Header kann **unerwünschte Auswirkungen** in Ihrer Zammad-Instanz haben und zu unerwartetem Verhalten führen. Nutzen Sie diesen mit absoluter Vorsicht!
sr: Ово заглавље може изазвати *озбиљне проблеме* у вашој инстанци и може довести до неочекиваног понашања. Користите само са апсолутном пажњом!

source: Manipulate the default article visibility.
de: Verändert die Sichtbarkeit (intern/öffentlich) des Artikels.
sr: Манипулишите подразумеваном видљивошћу чланка.

source: Example: ``X-Zammad-Article-Internal: true``
de: Beispiel: ``X-Zammad-Article-Internal: true``
sr: Пример: ``X-Zammad-Article-Internal: true``

source: Tell Zammad to silently drop the Email.
de: Weist Zammad an, die E-Mail zu verwerfen.
sr: Реци Zammad-у да нечујно одбаци имејл поруку.

source: Example: ``X-Zammad-Ignore: true``
de: Beispiel: ``X-Zammad-Ignore: true``
sr: Пример: ``X-Zammad-Ignore: true``

source: Trusted Channel
de: Vertrauenswürdiger Kanal
sr: Поуздан канал

source: **🚧 Self Hosted only 🚧**
de: **🚧 Nur selbst gehostet 🚧**
sr: **🚧 Само ако сами хостујете 🚧**

source: The settings below are only available to self hosted users.
de: Die folgenden Einstellungen sind nur für Benutzer einer selbst gehosteten Instanz verfügbar.
sr: Подешавања испод су доступна само на инстанцама које сами хостујете.

source: ⚠️ As stated above, this is dangerous and can lead to unexpected behavior in the communication with external parties. Only follow the instructions below if you know what you are doing.
de: ⚠️ Wie bereits erwähnt, ist dies gefährlich und kann zu unerwartetem Verhalten bei der Kommunikation mit externen Parteien führen. Befolgen Sie die folgenden Anweisungen nur, wenn Sie wissen, was Sie tun.
sr: ⚠️ Као што је горе наведено, ово је опасно и може довести до неочекиваног понашања у комуникацији са спољним системима. Следите доле наведена упутства само ако знате шта радите.

source: Setting a channel to ``trusted`` can be done via :docs:`console </admin/console.html>` exclusively. To do so, go to the rails console and follow the steps below:
de: Das Setzen eines Kanals auf ``trusted`` kann ausschließlich über :docs:`console </admin/console.html>` erfolgen. Rufen Sie dazu die Rails-Konsole auf und folgen Sie den nachstehenden Schritten:
sr: Подешавање канала на ``поуздано`` се може одрадити само преко :docs:`конзоле </admin/console.html>`. Да бисте то урадили, идите у rails конзолу и пратите следеће кораке:

source: List all channels in Zammad:
de: Alle Kanäle auflisten:
sr: Излистајте све канале у Zammad-у:

source: Look for the ``id`` of the channel, you want to set to ``trusted``.
de: Suchen Sie die ``id`` des Kanals, den Sie auf ``trusted`` setzen wollen.
sr: Потражите ``id`` канала, који желите да поставите на ``поуздани``.

source: Select your identified channel (replace the 99 with the correct id):
de: Wählen Sie Ihren identifizierten Kanal aus (ersetzen Sie die 99 durch die richtige ID):
sr: Изаберите свој идентификовани канал (замените 99 исправним ID-ом):

source: Show the currently activated options of the selected channel:
de: Zeigt die aktuell aktivierten Funktionen des ausgewählten Kanals an:
sr: Прегледајте тренутно активиране опције изабраног канала:

source: Add the ``"trusted"=>true`` flag for the inbound part of the channel:
de: Fügen Sie das Kennzeichen ``"trusted"=>true`` für den eingehenden Kanal hinzu:
sr: Додајте ознаку ``"trusted"=>true`` за долазни део канала:

source: Save your changes:
de: Speichern Sie Ihre Änderungen:
sr: Сачувајте промене:

source: Filters
de: Filter
sr: Филтери

source: Account settings page
de: Kontoeinstellungen
sr: Страница подешавања налога

source: Postmaster filters allow you to match email headers (e.g. ``From``, ``To``, ``Subject``, ``X-Spam-Flag`` etc.) and execute a set of actions whenever Zammad's email parser encounters a matching email. The actions will be applied to the ticket that is created or updated by this email.
de: Mit Postmaster-Filtern können Sie E-Mail-Header prüfen (z.B. ``Von``, ``An``, ``Betreff``, ``X-Spam-Flag`` etc.) und eine Reihe von Aktionen ausführen, sobald die E-Mail-Verarbeitung in Zammad einen Treffer erkennt. Die Aktionen werden auf das Ticket bezogen, das durch diese E-Mail erstellt oder aktualisiert wird.
sr: Postmaster филтери вам омогућавају да проверите имејл заглавља (нпр. ``Од``, ``За``, ``Предмет``, ``X-Spam-Flag`` итд.) и извршавате скуп радњи кад год Zammad имејл парсер наиђе на одговарајућу поруку. Радње ће се применити на тикет који је отворен или освежен дотичном поруком.

source: Zammad comes with system filters as well. While you can't change them, it might be useful for you what they actually do. Learn more on :doc:`filters/system-filters`.
de: Zammad wird mit System-Filtern ausgeliefert. Obwohl Sie diese nicht ändern können, kann das Wissen über deren Funktion dennoch nützlich sein. Weitere Infos finden Sie unter :doc:`filters/system-filters`.
sr: Zammad такође долази са системским филтерима. Иако их не можете променити, могло би вам бити корисно да знате шта они заправо раде. Сазнајте више у :doc:`filters/system-filters`.

source: Different attributes of a filter can be combined with each other. Likewise, the following operators can be combined. The supported matches are:
de: Verschiedene Attribute können in den Filtern kombiniert werden. Gleichermaßen können die folgenden Operatoren kombiniert werden. Folgende Kombinationen werden unterstützt:
sr: Различити атрибути филтера се могу комбиновати једни са другима. Такође, следеће радње се могу комбиновати. Подржана подударања су:

source: *contains*
de: *enthält*
sr: *садржи*

source: *contains not*
de: *enthält nicht*
sr: *не садржи*

source: *is any of*
de: *ist eins von*
sr: *је један од*

source: *is none of*
de: *ist keins von*
sr: *није ниједан од*

source: *starts with one of*
de: *beginnt mit eins von*
sr: *почиње са једним од*

source: *ends with one of*
de: *endet auf eins von*
sr: *завршава се са једним од*

source: *matches regex*
de: *passt auf regex*
sr: *задовољава регуларни израз*

source: *does not match regex*
de: *entspricht nicht regex*
sr: *не задовољава регуларни израз*

source: You can also have a look at the :doc:`object conditions </misc/object-conditions/basics>` for text fields, where you can find a description of how the operators are working.
de: Sie finden unter :doc:`Objektbedingungen </misc/object-conditions/basics>` eine Beschreibung, wie die Operatoren funktionieren.
sr: Такође можете погледати :doc:`услове објеката </misc/object-conditions/basics>` за текстуална поља, где можете пронаћи опис како функционишу оператори.

source: Please note that the ticket actions are separated in "Ticket creation" and "Ticket update". Make sure to use the appropriate variant for your scenario.
de: Bitte beachten Sie, dass die Ticket-Aktionen in "Ticket-Erstellung" und "Ticket-Aktualisierung" unterteilt sind. Stellen Sie sicher, dass Sie die richtige Variante für Ihr Szenario verwenden.
sr: Обратите пажњу да су радње тикета подељене на „отварање тикета” и „освежавање тикета”. Уверите се да користите одговарајућу врсту за ваше потребе.

source: Here are some examples of what is possible with filters:
de: Hier einige Beispiele, was mit Filtern möglich ist:
sr: Ево неколико примера шта је све могуће са филтерима:

source: Automatically dispatch tickets into certain groups:
de: Automatisches Verteilen von Tickets in bestimmte Gruppen:
sr: Аутоматски убацити тикете у одређене групе:

source: For example, tickets from ``amazon.com`` could automatically be dispatched to the Purchasing group.
de: Zum Beispiel könnten Tickets von ``amazon.com`` automatisch in die Gruppe "Einkauf" verschoben werden.
sr: На пример, тикети од ``amazon.com`` могу аутоматски бити смештени у групу за куповину.

source: From: *matches regex:* ``(\.|@)amazon\.com``
de: Von: *passt auf regex:* ``(\.|@)amazon\.com``
sr: Од: *задовољава регуларни израз:* ``(\.|@)amazon\.com``

source: Group: Purchasing
de: Gruppe: Einkauf
sr: Група: Куповина

source: Automatically dispatch tickets to responsible staff based on organization name:
de: Automatisches Verteilen von Tickets an zuständiges Personal, abhängig vom Namen der Organisation:
sr: Аутоматски пребацује тикете одговорним тимовима на основу назива организације:

source: Organization: *starts with one of:* ``A`` ``B`` ``C``
de: Organisation: *beginnt mit eins von:* ``A`` ``B`` ``C``
sr: Организација: *почиње са једним од:* ``A`` ``B`` ``C``

source: Owner: Emily Adams
de: Besitzer: Emily Adams
sr: Власник: Emily Adams

source: Automatically increase the priority of tickets from a VIP customer:
de: Erhöht automatisch die Priorität von Tickets eines VIP-Kunden:
sr: Аутоматски увећајте приоритет тикета од VIP клијента:

source: From: *contains:* ``ourvipcustomer@example.com``
de: Von: *enthält:* ``ourvipcustomer@example.com``
sr: Од: *садржи:* ``ourvipcustomer@example.com``

source: Priority: 3 high
de: Priorität: 3 hoch
sr: Приоритет: 3 висок

source: Automatically tag and close spam tickets that have been marked as spam by an external spam filter (e.g. SpamAssassin):
de: Automatisches Taggen und Schließen von Spam-Tickets, die von einem externen Spam-Filter (z. B. SpamAssassin) als Spam markiert wurden:
sr: Аутоматски означите и затворите тикете које је спољни филтер непожељне поште означио као нежељену (нпр. SpamAssassin):

source: X-Spam-Flag: *contains:* ``YES``
de: X-Spam-Flag: *enthält:* ``JA``
sr: X-Spam-Flag: *садржи:* ``YES``

source: Tag: add: ``spam``
de: Tag: *hinzufügen:* ``spam``
sr: Ознаке: додај: ``spam``

source: State: closed
de: Status: geschlossen
sr: Стање: затворено

source: If a filter is no longer needed, it can either be temporarily set inactive or deleted directly.
de: Sofern ein Filter nicht mehr benötigt wird, können Sie diesen entweder deaktivieren oder löschen.
sr: Ако филтер није више неопходан, може бите искључен или потпуно обрисан.

source: System Filters
de: Systemfilter
sr: Системски филтери

source: On this page you can find some pre-defined filters that you won't find within the Zammad's UI. Those filters might come in handy when trying to understand Zammad's behavior.
de: Auf dieser Seite finden Sie vordefinierte Filter, die nicht in Zammad enthalten sind. Diese können nützlich sein, um die Funktionsweise zu verstehen.
sr: На овој страници можете пронаћи неке унапред дефинисане филтере који нису приказани у оквиру корисничког интерфејса Zammad-а. Ти филтери би могли бити корисни када покушавате да разумете Zammad-ово понашање.

source: Please note that this is not a full filters list, if you're missing filters, feel free to ask over at the `Community <https://community.zammad.org>`_.
de: Es handelt sich hierbei nicht um eine vollständige Filterliste. Sofern Sie hier Filter vermissen, können Sie gerne in der `Community <https://community.zammad.org>`_ eine Anfrage stellen.
sr: Имајте на уму да ово није потпуна листа филтера, ако вам недостају филтери, слободно питајте на `Community форуму <https://community.zammad.org>`_.

source: Zammad will detect Service Now emails and assign them to existing tickets, if the following requirements are met:
de: Zammad erkennt Service Now E-Mails und ordnet diese existierenden Tickets zu, sofern folgende Voraussetzungen erfüllt sind:
sr: Zammad ће детектовати Service Now поруке и доделити их постојећим тикетима, ако су испуњени следећи услови:

source: Headers contain the ``X-ServiceNow-Generated`` header.
de: Header enthält ``X-ServiceNow-Generated``.
sr: Порука садржи ``X-ServiceNow-Generated`` заглавље.

source: Subject does match the regex ``\s(INC\d+)\s`` e.g. ``INC678439``.
de: Titel enthält regex ``\s(INC\d+)\s`` z.B. ``INC678439``.
sr: Предмет не задовољава регуларни израз ``\s(INC\d+)\s``, нпр. ``INC678439``.

source: See `Service-Now Mail Example <https://github.com/zammad/zammad/blob/stable/test/data/mail/mail090.box>`_ for comparison of your emails.
de: Siehe `Service-Now Mail Beispiel <https://github.com/zammad/zammad/blob/stable/test/data/mail/mail090.box>`_ für den Vergleich Ihrer E-Mails.
sr: Погледајте `Service-Now пример поруке <https://github.com/zammad/zammad/blob/stable/test/data/mail/mail090.box>`_ за поређење ваших имејл порука.

source: Zammad will detect JIRA emails and assign them to existing tickets, if the following requirements are met:
de: Zammad erkennt JIRA E-Mails und ordnet diese existierenden Ticket zu, sofern folgende Bedingungen erfüllt sind:
sr: Zammad ће детектовати JIRA поруке и доделити их постојећим тикетима, ако су испуњени следећи услови:

source: Headers contain the ``X-JIRA-FingerPrint`` header.
de: Headers enthält ``X-JIRA-FingerPrint``.
sr: Порука садржи ``X-JIRA-FingerPrint`` заглавље.

source: Subject does match the regex ``\[JIRA\]\s\((\w+-\d+)\)`` e.g. ``[JIRA] (SYS-422)``.
de: Titel passt auf regex ``\[JIRA\]\s\((\w+-\d+)\)`` z.B. ``[JIRA] (SYS-422)``.
sr: Предмет задовољава регуларни израз ``\[JIRA\]\s\((\w+-\d+)\)``, нпр. ``[JIRA] (SYS-422)``.

source: See `JIRA Mail Example <https://github.com/zammad/zammad/blob/stable/test/data/mail/mail103.box>`_ for comparison of your emails.
de: Siehe `JIRA Mail Beispiel <https://github.com/zammad/zammad/blob/stable/test/data/mail/mail103.box>`_ für den Vergleich Ihrer E-Mails.
sr: Погледајте `JIRA пример поруке <https://github.com/zammad/zammad/blob/stable/test/data/mail/mail103.box>`_ за поређење ваших порука.

source: Control how Zammad **sends and receives email**.
de: Legen Sie fest, wie Zammad **Mails sendet und empfängt**.
sr: Контролишите како Zammad **шаље и прима имејл**.

source: **Using Gmail / G Suite?**
de: **Sie benutzen Gmail / G-Suite?**
sr: **Користите Gmail/G Suite?**

source: Set up a :doc:`Google channel </channels/google/index>` instead.
de: Nutzen Sie stattdessen den :doc:`Google Kanal </channels/google/index>`.
sr: Уместо овога, подесите :doc:`Google канал </channels/google/index>`.

source: **Using Microsoft 365?**
de: **Nutzen Sie Microsoft 365?**
sr: **Користите Microsoft 365?**

source: Set up a :doc:`Microsoft 365 IMAP </channels/microsoft365/index>` or :doc:`Microsoft 365 Graph channel </channels/microsoft365-graph/index>` instead.
de: Richten Sie stattdessen einen :doc:`Microsoft 365 IMAP- </channels/microsoft365/index>` oder :doc:`Microsoft 365 Graph-Kanal </channels/microsoft365-graph/index>` ein.
sr: Уместо тога, подесите :doc:`Microsoft 365 IMAP </channels/microsoft365/index>` или :doc:`Microsoft 365 Graph канал </channels/microsoft365-graph/index>` .

source: Email settings panel
de: E-Mail Einstellungen
sr: Панел подешавања имејла

source: 🚛 Migrate existing email channel to "XOAUTH" channel
de: 🚛 Richten Sie einen existierenden E-Mail-Kanal als "XOAUTH" Kanal ein
sr: 🚛 Мигрирајте постојећи имејл канал на „XOAUTH“ канал

source: At this moment Zammad supports XOAUTH for the following providers:
de: Aktuell unterstützt Zammad XOAUTH für folgende Anbieter:
sr: У овом тренутку Zammad подржава XOAUTH за следеће провајдере:

source: :doc:`Microsoft 365 IMAP Email </channels/microsoft365/accounts/migrate-from-email-channel>` (formerly Office 365)
de: doc:`Microsoft 365 IMAP E-Mail </channels/microsoft365/accounts/migrate-from-email-channel>` (früher Office 365)
sr: :doc:`Microsoft 365 IMAP имејл </channels/microsoft365/accounts/migrate-from-email-channel>` (раније познато као Office 365)

source: Microsoft 365 *Graph* Email supports XOAUTH as well, but currently there is no migration option. Instead, you have to remove the existing and :doc:`add the new channel manually </channels/microsoft365-graph/accounts/>`.
de: Microsoft 365 *Graph* E-Mail unterstützt ebenfalls XOAUTH, aber derzeit gibt es keine Migrationsoption. Stattdessen müssen Sie den bestehenden Kanal entfernen und den neuen :doc:`Kanal manuell hinzufügen </channels/microsoft365-graph/accounts/>`.
sr: Microsoft 365 *Graph* имејл такође подржава XOAUTH, али тренутно не постоји могућност миграције. Уместо тога можете да уклоните постојећи и :doc:`ручно додате нови канал </channels/microsoft365-graph/accounts/>`.

source: :doc:`👥 Accounts <accounts>`
de: :doc:`👥 Konten <accounts>`
sr: :doc:`👥 Налози <accounts>`
