Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: **Search result list** (only if *search result list key* is properly set): output of the structure under the configured *search result list key*.
de: **Suchergebnisliste** (nur wenn *Suchergebnislisten-Schlüssel* richtig gesetzt ist): Ausgabe der Struktur unter dem konfigurierten *Suchergebnislisten-Schlüssel*.
sr: **Листа резултата претраге** (само ако *кључ листе резултата претраге* није исправно подешен): део структуре испод подешеног *кључа листе резултата претраге*.

source: **Preview table** (when fully configured): Zammad shows you a table which includes the found items based on the search string (value, label and optional link). You can use this preview if you don't have the complete data structure of the external system in mind.
de: **Vorschau-Tabelle** (wenn vollständig konfiguriert): Zammad zeigt Ihnen eine Tabelle an, die die gefundenen Elemente auf der Grundlage des Suchstrings (Wert, Bezeichnung und optionaler Link) enthält. Sie können diese Vorschau verwenden, wenn Sie nicht die komplette Datenstruktur des externen Systems im Kopf haben.
sr: **Табела приказа** (када је комплетно подешено): Zammad ће вам приказати табелу која укључује нађене уносе на основу кључних речи (вредност, ознаку и опционо линк). Можете користити приказ и када немате потпуну слику о структури података удаљеног система.

source: An example of a configured external data source field from agent perspective:
de: Ein Beispiel für ein eigenes Feld auf Ticketebene vom Typ externe Datenquelle aus der Sicht eines Agenten:
sr: Пример подешеног поља удаљеног извора података из перспективе оператера:

source: Screencast showing the search for a product in a ticket
de: Screencast zeigt die Suche nach einem Produkt in einem Ticket
sr: Снимак екрана који приказује претрагу производа у тикету

source: URL fields (Link-Template)
de: URL-Felder (Link-Template)
sr: URL адреса поља (шаблон везе)

source: This function is restricted to Text, Select and External data source types only.
de: Diese Funktion ist nur auf die Feldtypen Text-, Auswahl- und Externe Datenquelle beschränkt.
sr: Ова функција је ограничена само на поља текста, избора и удаљеног извора података.

source: Link-Templates are an amazing way to dynamically generate URLs. They allow you to integrate other systems better without having to manually copy data from Zammad if possible.
de: Link-Templates sind eine hervorragende Möglichkeit, URLs dynamisch zu erzeugen. Sie ermöglichen es Ihnen, andere Systeme zu integrieren, ohne Daten manuell aus Zammad kopieren zu müssen.
sr: Шаблони везе су сјајан начин за динамичко генерисање URL адреса. Омогућавају вам да боље интегришете удаљене системе без да ручно копирате податке из Zammad-а.

source: Another great way of communicating with another system may be Zammad's :doc:`Webhooks </manage/webhook>`.
de: Eine weitere gute Möglichkeit, mit anderen Systemen zu kommunizieren, sind die :doc:`Webhooks </manage/webhook>` von Zammad.
sr: Још један сјајан начин за комуникацију са удаљеним системима могу бити и Zammad-ови :doc:`повратни позиви </manage/webhook>`.

source: After filling a link-template enabled field, an URL icon will appear on its right. Clicking on the icon opens a new tab.
de: Nach dem Ausfüllen eines Feldes, das mit einem Link-Template versehen ist, erscheint rechts davon ein Symbol. Wenn Sie auf das Symbol klicken, wird ein neuer Tab im Browser geöffnet.
sr: По уносу поља са подешеним шаблоном везе, URL иконица ће се појавити са његове десне стране. Клик на иконицу ће отворити нови језичак.

source: Even though Zammad displays the link template within object edit and create screens, the function is optional. It's only active if you populate the field.
de: Obwohl Zammad das Link-Template in den Ansichten zum Bearbeiten und Erstellen von Objekten anzeigt, ist die Funktion optional. Sie ist nur aktiv, wenn Sie das Feld ausfüllen.
sr: Иако Zammad приказује подешавање шаблона везе у оквиру дијалога додавања и уређивања објекта, функција је опциона. Биће активна само ако га подесите.

source: What's the difference between URL and text fields with link template...?!
de: Was ist der Unterschied zwischen URL und Textfeldern mit Linkvorlage?
sr: Која је разлика између URL и поља текста са шаблоном везе…?!

source: Both fields have different use cases. Use ``text`` type text fields when ever you have a *static* url that requires dynamic parameters. If you require a drag & drop like field that you can put in any URL, use ``URL`` type text fields.
de: Beide Felder haben unterschiedliche Verwendungszwecke. Verwenden Sie Felder vom Typ ``Text``, wenn Sie eine *statische* URL haben, die dynamische Parameter erfordert. Wenn Sie ein Feld benötigen, in das Sie eine beliebige statische URL einfügen können, verwenden Sie Textfelder vom Typ ``URL``.
sr: Оба типа поља имају различите употребну вредност. Користите поље текста типа ``text`` кад год имате *статичку* URL адресу која захтева динамичке параметре. Ако захтевате поље у које желите да унесете било коју URL адресу, користите поље текста типа ``URL``.

source: The difference is easier to spot when comparing the fields directly, below screencast shows the result - the dynamic approach uses existing values in the moment of updating to built the URL - e.g. ``https://google.com/search?q=cookies`` - while the URL approach uses the actual URL of the field - e.g. ``https://zammad.com``.
de: Der Unterschied ist leichter zu erkennen, wenn man die Felder direkt vergleicht. Der folgende Screencast zeigt das Ergebnis - der dynamische Ansatz verwendet die vorhandenen Werte im Moment der Aktualisierung, um die URL zu bilden - z.B. ``https://google.com/search?q=cookies`` - während der URL-Ansatz die aktuelle statische URL des Feldes verwendet - z.B. ``https://zammad.com``.
sr: Разлика је лакша за приметити када поредите поља једно поред другог, снимак екрана испод приказује резултат – динамички приступ користи постојеће вредности у тренутку освежавања да би генерисао URL – нпр. ``https://google.com/search?q=cookies`` – док URL приступ користи дотичну URL адресу поља – нпр. ``https://zammad.com``.

source: Screencast showing the differents in between URL and text type fields with actual values
de: Screencast mit den Unterschieden zwischen URL- und Textfeldern mit aktuellen Werten
sr: Снимак екрана који приказује разлику између URL и поља текста са стварним вредностима

source: How does this work...?!
de: Wie funktioniert das?
sr: Како то уствари функционише?!

source: As an example, let's say you have an attribute called ``amazing_attribute`` and you want to open a google search directly with the input from that field.
de: Nehmen wir an, Sie haben ein Attribut namens ``amazing_attribute`` und möchten eine Google-Suche direkt mit Inhalt aus diesem Feld öffnen.
sr: Као пример, рецимо да имате објекат под називом ``amazing_attribute`` и желите да отворите страну претраге директно на основу уноса тог поља.

source: Providing the link-template field below allows you to do so: ``https://www.google.com/search?q=#{ticket.amazing_attribute}``
de: Mit dem unten stehenden Link-Template-Feld können Sie dies tun: ``https://www.google.com/search?q=#{ticket.amazing_attribute}``
sr: Следећа вредност за шаблон везе вам омогућује баш то: ``https://www.google.com/search?q=#{ticket.amazing_attribute}``

source: You can use any :doc:`Zammad variable </misc/variables>` as long as it's available in the moment you need it.
de: Sie können jede :doc:`Zammad-Variable </misc/variables>` verwenden, solange sie in dem Moment, in dem Sie sie brauchen, verfügbar ist.
sr: Можете користити било коју :doc:`Zammad променљиву </misc/variables>` све док је доступна у тренутку када вам је неопходна.

source: As a result, you are redirected to Google with a search for the value of the attribute, if you click on the button in the ticket (as you can see in the screencast above).
de: Als Ergebnis werden Sie zu Google mit einer Suche nach dem Inhalt des Attributs weitergeleitet, wenn Sie auf die Schaltfläche im Ticket klicken (wie Sie im Screencast oben sehen können).
sr: Као резултат, ако кликнете на дугме у тикету (као на снимку екрана изнад) бићете преусмерени на страну претраге за вредност атрибута.

source: Packages
de: Pakete
sr: Пакети

source: That's the package management-area.
de: Das ist der Bereich der Paketverwaltung.
sr: Ово је одељак за уређивање пакета.

source: Individual add-ons for Zammad can be installed and managed here.
de: Individuelle Add-ons für Zammad können hier installiert und verwaltet werden.
sr: Појединални додаци за Zammad се могу инсталирати и уређивати одавде.

source: Sessions
de: Sitzungen
sr: Сесије

source: The session management provides a list of currently known user sessions and allows you to end them. The :ref:`security_session_timeout` can be configured in the the security settings.
de: Die Sitzungsverwaltung stellt eine Liste der aktuell bekannten Benutzer-Sitzungen bereit und ermöglicht Ihnen, diese zu beenden. Der :ref:`security_session_timeout` kann in den Sicherheitseinstellungen konfiguriert werden.

source: Screenshot showing Zammad's session management
de: Screenshot der Sitzungsverwaltung von Zammad
sr: Снимак екрана који приказује уређивање сесија у Zammad-у

source: Zammad will provide the following information:
de: Zammad stellt die folgenden Informationen zur Verfügung:
sr: Zammad обезбеђује следеће информације:

source: The user account this session entry belongs to. It can be normal if a user has several sessions in the list. This can be due to changed browser information or if you use e.g. single sign on methods where the user does not use the log off button.
de: Das Benutzerkonto, zu dem dieser Sitzungseintrag gehört. Es kann vorkommen, dass ein Benutzer mehrere Sitzungen in der Liste hat. Dies kann auf geänderte Browser-Informationen zurückzuführen sein oder wenn Sie z.B. Single-Sign-On-Methoden verwenden, bei denen der Benutzer die Abmeldefunktion nicht benutzt.
sr: Кориснички налог коме припада дотична сесија. Сасвим је нормално да корисник има неколико сесија у листи. До овога може доћи услед промене претраживача или уколико се користи нпр. метод јединствене пријаве и корисник не користи дугме за одјаву.

source: The browser agent communicated to Zammad.
de: Der Browser-Agent, der an Zammad kommuniziert wurde.
sr: Агент претраживача који је пријављен Zammad-у.

source: Location
de: Ort
sr: Локација

source: The anticipated location based on the users IP address. Depending on the IP address the result shown may differ. This option depends on :doc:`/settings/system/services`.
de: Der ungefähre Standort basiert auf der IP-Adresse des Nutzers. Je nach IP-Adresse kann das angezeigte Ergebnis stark abweichen. Diese Option ist abhängig von :doc:`/settings/system/services`.
sr: Локација на основу корисничке IP адресе. У зависности од IP адресе резултат се може разликовати. Ова опција зависи од :doc:`/settings/system/services`.

source: The following information can be shown:
de: Die folgenden Informationen können angezeigt werden:
sr: Следеће информације могу бити приказане:

source: IP address
de: IP-Adresse
sr: IP адреса

source: Either if you set *Geo IP services* to inactive or you're using internal IP address which do not provide location information.
de: Entweder haben Sie den *Geo-IP-Service* auf inaktiv gesetzt oder Sie verwenden eine interne IP-Adresse, die keine Standortinformationen liefert.
sr: Уколико искључите *сервис географског IP* или ако користите интерну IP адресу која не открива локацију.

source: Country (or Country + City)
de: Land (oder Land + Stadt)
sr: Држава (или држава + град)

source: If *Geo IP services* is enabled only. Depends on how detailed the available IP address information are.
de: Nur wenn *Geo-IP-Service* aktiviert ist. Hängt davon ab, wie detailliert die verfügbaren IP-Adressinformationen sind.
sr: Само уколико је *сервис географског IP* укључен. Зависи од тога колико су детаљне доступне информације о IP адреси.

source: Be aware that results can be inaccurate - this technically is not an error.
de: Beachten Sie, dass die Ergebnisse ungenau sein können - dies ist technisch gesehen kein Fehler.
sr: Обратите пажњу да подаци могу бити нетачни – технички ово није грешка.

source: Age
de: Alter
sr: Старост

source: Provides the time when the session initially has been created.
de: Gibt die Zeit an, zu der die Sitzung ursprünglich erstellt wurde.
sr: Обезбеђује време од када је сесија иницијално креирана.

source: Update
de: Aktualisierung
sr: Освежавање

source: Provides the time the user used this session to open Zammad. This timestamp is only updated if the user e.g. reloads, not during normal work on tickets.
de: Gibt den Zeitpunkt an, zu dem der Benutzer diese Sitzung verwendet hat, um Zammad zu öffnen. Dieser Zeitstempel wird nur aktualisiert, wenn der Benutzer z.B. die Seite neu lädt, nicht während der normalen Arbeit an Tickets.
sr: Обезбеђује време када је корисник користио сесију да приступи Zammad-у. Ова временска вредност ће бити освежена само ако корисник нпр. поново учита апликацију, али не и при стандардном раду на тикетима.

source: This timestamp is being used for the session timeout.
de: Dieser Zeitstempel wird für den Timeout der Sitzung verwendet.
sr: Ова временска вредност се користи за обрачун времена истека сесије.

source: Use the delete button to remove a single session on behalf of your user.
de: Verwenden Sie die Schaltfläche "Löschen", um eine einzelne Sitzung Ihres Benutzers zu entfernen.
sr: Користите дугме за брисање да бисте одјавили појединачну сесију вашег корисника.

source: Subscription (SaaS)
de: Abonnement (SaaS)
sr: Претплата (SaaS)

source: The subscription settings page allows you to configure your instances package and number of agents required.
de: Auf der Seite mit den Abonnementeinstellungen können Sie Ihr Paket und die Anzahl der benötigten Agenten konfigurieren.
sr: Страна подешавање претплате вам омогућава да подесите пакет ваше инстанце и неопходан број оператера.

source: This setting section is only available for Hosted setups. If you're looking for on premise support contracts, please see the `Zammad pricing page <https://zammad.com/en/pricing#selfhosted>`_.
de: Dieser Bereich ist nur für Hosted Instanzen verfügbar. Wenn Sie nach Supportverträgen für selbst gehosteten Installationen suchen, sehen Sie sich bitte die `Zammad Preisübersicht <https://zammad.com/de/pricing#selfhosted>`_ an.
sr: Овај одељак подешавања је доступан само у хостованим инстанцама. Ако тражите уговор за подршку, молимо погледајте `Zammad ценовник <https://zammad.com/en/pricing#selfhosted>`_.

source: Plan
de: Produkt
sr: План

source: Here you can set up everything affecting your instance subscription functions like number of agents and package.
de: Hier können Sie alles einstellen, was Instanz-Abonnement betrifft, wie die Anzahl der Agenten und das Paket.
sr: Овде можете подесити све у вези претплате ваше инстанце као што су број оператера и пакет.

source: On top of the page you can find a subscription summary. You'll find the number of used and available (booked) agent seats there. By using the *see more* link you can also expand an agent list to see the currently configured active agents. This list *does not* count accounts with admin permissions only.
de: Oben auf der Seite finden Sie eine Abonnementübersicht. Dort finden Sie die Anzahl der genutzten und verfügbaren (gebuchten) Agentenplätze. Über den Link *Mehr anzeigen* können Sie auch eine Liste der Agenten ausklappen, um die derzeit konfigurierten aktiven Agenten zu sehen. In dieser Liste werden Konten mit ausschließlich Admin-Rechten *nicht* gezählt.
sr: При врху стране наћи ћете преглед претплате. Приказани су број искоришћених и доступних (купљених) налога оператера. Коришћењем линка *прикажи више* такође можете увећати листу оператера да видите тренутно подешене, активне оператере. Ова листа *не укључује* налоге само са дозволама администратора.

source: Within subscription you can always see how many agents are still available to add and who uses the seats.
de: Innerhalb des Abonnements können Sie immer sehen, wie viele Agenten noch zur Verfügung stehen und wer die Agenten-Plätze nutzt.
sr: У оквиру претплате увек можете проверити колико оператера је још увек достпуно и ко користи налоге.

source: Learn more on how to manage your agents in general :doc:`here </manage/users/index>`.
de: Erfahren Sie, wie Sie Ihre Agenten im Allgemeinen verwalten :doc:`hier </manage/users/index>`.
sr: Сазнајте више о начину управљања вашим оператерима :doc:`овде </manage/users/index>`.

source: This section gives you an overview of the available plans and their functions / limits. If you require a more detailed table, check our `detailed pricing table <https://zammad.com/en/pricing/table>`_ for more.
de: Dieser Abschnitt gibt Ihnen einen Überblick über die verfügbaren Tarife und ihre Funktionen / Grenzen. Wenn Sie eine detailliertere Tabelle benötigen, finden Sie weitere Informationen in unserer `detaillierten Preisliste <https://zammad.com/de/pricing/table>`_.
sr: Овај одељак вам даје преглед доступним планова и њихових функција / ограничења. Уколико су вам потребне детаљније информације, погледајте наш `детаљну табелу ценовника <https://zammad.com/en/pricing/table>`.

source: Your selection in this step will decide on the base agent price and e.g. agent limits that might apply in the summary step.
de: Ihre Auswahl in diesem Schritt entscheidet über den Basis-Agentenpreis und z.B. die Agentenlimits, die Sie in der Zusammenfassung sehen.
sr: Ваш избор у овом кораку ће одредити основну цену оператера и нпр. ограничења оператера која су приказана у прегледу.

source: The green *Selected* button will also tell you what plan you're currently in.
de: Die grüne Schaltfläche *Ausgewählt* zeigt Ihnen an, in welchem Tarif Sie sich gerade befinden.
sr: Зелено дугме *изабрано* ће вам такође рећи на ком сте тренутно плану.

source: Trial instances are running at Professional with 3 agents. The plan cannot be changed during the trial for technical reasons, if you require more agents for testing, please contact `our sales team <https://zammad.com/en/company/contact>`_ with a reason for the raise request.
de: Die Testinstanzen laufen auf Professional mit 3 Agenten. Der Plan kann aus technischen Gründen während der Testphase nicht geändert werden. Wenn Sie mehr Agenten zum Testen benötigen, wenden Sie sich bitte an `unser Sales Team <https://zammad.com/de/company/contact>`_ mit einem Begründung, warum Sie eine Erhöhung benötigen.
sr: Пробне инстанце раде под Professional пакетом са 3 оператера. План није могуће променити током пробног периода из техничких разлога, ако вам је неопходно више оператера за тестирање, молимо контактирајте `наш тим продаје <https://zammad.com/en/company/contact>`_ са разлогом за увећање.

source: Screenshot showing three available packages for a hosted Zammad instance
de: Screenshot mit drei verfügbaren Paketen für eine gehostete Zammad-Instanz
sr: Снимак екрана приказује три доступна пакета хостованих Zammad инстанци

source: At the bottom of this block you can find a summary where you can adjust the settings of the previous selected plan.
de: Am unteren Ende dieses Blocks finden Sie eine Zusammenfassung, in der Sie die Einstellungen des zuvor ausgewählten Plans anpassen können.
sr: При дну овог одељка наћи ћете преглед где можете изменити подешавања претходно изабраног плана.

source: Note that upgrading (more agents, higher package) is always possible, however, downgrading will only happen when your billing period renews.
de: Beachten Sie, dass ein Upgrade (mehr Agenten, höheres Paket) immer möglich ist, ein Downgrade jedoch erst zum Ablauf Ihres Abrechnungszeitraums erfolgen kann.
sr: Обратите пажњу да је унапређење (више оператера, скупљи пакет) увек могуће, док је повратак назад могућ само при обнављању вашег уговорног периода.

source: Upgrading resets your billing period and existing credit will be deducted from the new total.
de: Durch das Upgrade wird Ihr Abrechnungszeitraum zurückgesetzt und Ihr bisheriges Guthaben wird vom neuen Gesamtbetrag abgezogen.
sr: Унапређење ће ресетовати ваш уговорни период и цена ће бити умањена за тренутни износ.

source: Billing cycle
de: Abrechnungszyklus
sr: Обрачунски период

source: You can choose between either monthly or yearly billing. The price per agent will be cheaper if you decide for yearly billing.
de: Sie können zwischen monatlicher und jährlicher Abrechnung wählen. Der Preis pro Agent ist günstiger, wenn Sie sich für eine jährliche Abrechnung entscheiden.
sr: Увек можете одабрати између месечне и годишње наплате. Цена по оператеру је нижа ако се одлучите за годишњу наплату.

source: If you're still trying out things and are unsure of the right package for your instance, you may want to choose monthly first and then upgrade to yearly when you're sure.
de: Wenn Sie noch am Ausprobieren sind und z.B. nicht wissen, welches Paket für Ihre Instanz das richtige ist, sollten Sie sich zunächst für ein monatliches Paket entscheiden und dann auf ein jährliches Paket umsteigen, wenn Sie sich sicher sind.
sr: Ако још увек испробавате ствари и нисте сигурни који је пакет најбољи за вашу инстанцу, можда ћете желети да прво одаберете месечну наплату и после унапредите на годишњу када будете сигурни.

source: Plan: (Starter|Professional|Plus) - Agents
de: Produkt: (Starter|Professional|Plus) - Agenten
sr: План: (Starter|Professional|Plus) - Оператери

source: Choose the number of agents you require for your instance.
de: Wählen Sie die Anzahl der Agenten, die Sie für Ihre Instanz benötigen.
sr: Одаберите број оператера који су вам неопходни у вашој инстанци.

source: Keep in mind that some packages may have agent limits. Depending on the previous chosen package, you won't be able to exceed specific agent numbers. Also note that setting less agents than currently configured is not possible.
de: Beachten Sie, dass es bei einigen Paketen Obergrenzen für die Anzahl der Agenten gibt. Je nach dem zuvor gewählten Paket können Sie eine bestimmte Anzahl von Agenten nicht überschreiten. Beachten Sie auch, dass es nicht möglich ist, weniger Agenten einzustellen als derzeit konfiguriert sind.
sr: Обратите пажњу да неки пакети имају ограничење у броју оператера. У зависности од претходно одабраног пакета, нећете бити у могућности да прекорачите одређени број оператера. Такође имајте на уму да избор броја оператера нижи од подешеног није могућ.

source: Total
de: Gesamt
sr: Укупно

source: This will be the net total you're going to be billed.
de: Dies ist der Nettobetrag, der Ihnen in Rechnung gestellt wird.
sr: Ово представља укупну нето цифру која ће вам бити наплаћена.

source: By using the *Update subscription* button, the instance package will be adjusted immediately. If you didn't provide a payment method yet, Zammad will request you to provide one at this point.
de: Wenn Sie die Schaltfläche *Abonnement aktualisieren* verwenden, wird Ihr Instanzpaket sofort angepasst. Wenn Sie noch keine Zahlungsmethode angegeben haben, wird Zammad Sie an dieser Stelle auffordern, eine anzugeben.
sr: Коришћењем дугмета *Освежите претплату*, пакет инстанце ће бити моментално измењен. Уколико још увек нисте додали начин плаћања, Zammad ће захтевати да га обезбедите у овом тренутку.

source: In case you're still within the trial period, this means that the trial will be over immediately!
de: Falls Sie sich noch im Testzeitraum befinden, wird die Probezeit sofort beendet!
sr: У случају да сте још увек у оквиру пробног периода, ово значи да ће пробни период одмах бити завршен!
