Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: Enhanced Settings
de: Erweiterte Einstellungen
sr: Напредна подешавања

source: Some less relevant settings can be changed via rails console if needed. As an example, Zammad allows you to send all outgoing communication to a BCC address for archiving reasons if needed. You can find the needed commands :docs:`within the advanced customization settings </admin/console/hidden-settings.html>`.
de: Einige weitere Einstellungen können über die Rails Konsole vorgenommen werden, wenn benötigt. Beispielsweise kann Zammad alle ausgehenden Mails per BCC an eine fixe E-Mail-Adresse schicken (z.B. zur Archivierung). Sie können die dafür notwendigen Befehle :docs:`hier </admin/console/hidden_settings.html>` finden.
sr: Нека мање релевантна подешавања могу се променити преко rails конзоле ако је неопходно. На пример, Zammad вам омогућава да проследите сву одлазну комуникацију на BCC адресу из разлога архивирања. Детаљне команде можете пронаћи :docs:`у оквиру напредних подешавања </admin/console/hidden-settings.html>`.

source: Signatures
de: Signaturen
sr: Потписи

source: You can create a separate signature for each group in Zammad. The individual signatures can be created and edited here.
de: Sie können für jeden Gruppe in Zammad eine eigene Signatur erstellen. Individuelle Signaturen können hier erstellt und bearbeitet werden.
sr: Можете дефинисати посебан потпис за сваку групу у Zammad-у. Овде се могу креирати и уређивати појединачни потписи.

source: Afterwards, the existing (and active) signatures are available in the group editing mask:
de: Anschließend sind die erstellten und aktiven Signaturen in der Gruppenbearbeitung verfügbar:
sr: Након тога, постојећи (и активни) потписи су доступни у масци за уређивање групе:

source: Each group can be assigned its own signature, but they can also all use the same signature.
de: Jeder Gruppe kann eine eigene Signatur zugewiesen werden. Es kann aber auch eine gemeinsame Signatur verwendet werden.
sr: Свакој групи се може доделити сопствени потпис, али и све могу да користе исти потпис.

source: Dynamic Signatures
de: Dynamische Signaturen
sr: Динамични потписи

source: To individualize the signatures, it is possible to automatically load specific information into a signature via :doc:`/misc/variables`. All information stored on the ticket, assigned customers or agents can be inserted. This makes it possible to design the signature individually. To load a list of available variables, enter two colons (``::``) into the *Text* box of the signature editor.
de: Um die Signaturen zu individualisieren, können Sie bestimmte Informationen als :doc:`Variablen </misc/variables>` hinterlegen. Auf alle Informationen eines Tickets, eines Kunden und eines Agenten kann hier zugegriffen werden. Um eine Liste der verfügbaren Variablen zu sehen, geben Sie zwei Doppelpunkte (``::``) in das Textfeld ein.
sr: Да бисте персонализовали потписе, могуће је аутоматски учитати одређене информације у потпис преко :doc:`/misc/variables`. Могу се унети све информације сачуване у тикету, додељеним клијентима или оператерима. Ово омогућава индивидуалну персонализацију потписа. Да бисте учитали листу доступних променљивих, унесите две двотачке (``::``) у поље *Текст* при уређивању потписа.

source: Screenshot shows signature editor with highlighted variable usage
de: Screenshot zeigt den Signatureditor mit hervorgehobener Verwendung von Variablen
sr: Снимак екрана који приказује екран уредника потписа са наглашеним коришћењем променљивих

source: Please keep in mind that specific information might not be available during ticket creation. The best example here is the ticket number. It gets created with submitting the ticket form and thus is not available before.
de: Bitte denken Sie daran, dass bestimmte Informationen bei der Erstellung des Tickets möglicherweise nicht verfügbar sind. Das beste Beispiel hierfür ist die Ticket-Nummer. Sie wird erst mit dem Absenden des Ticket-Formulars erstellt und ist daher vorher nicht verfügbar.
sr: Имајте на уму да одређене информације можда неће бити доступне током отварања тикета. Најбољи пример овде је број тикета. Биће одређен по слању форме тикета и није доступан пре те радње.

source: Here is an example of a signature with variables and the result when you write a mail:
de: Hier ein Beispiel einer Signatur mit Variablen und dem zugehörigen Ergebnis beim Verfassen:
sr: Ево примера потписа са променљивама и резултат када пишете имејл поруку:

source: You can connect your Facebook account to Zammad, allowing you to create tickets from posts and respond as comments.
de: Sie können Ihr Facebook Konto mit Zammad verbinden, so dass Sie aus Beiträgen Tickets erstellen und als Kommentar antworten können.
sr: Сада можете повезати ваш Facebook налог са Zammad-ом, и почећете примати тикете од постова и коментара..

source: Please note that you first and foremost should have a look at `Meta's documentation <https://developers.facebook.com/docs/>`_ to get the most recent and substantial information for the steps on their side. Some steps on Meta's side are only mentioned here as prerequisites, as this is outside the scope of this documentation.
de: Bitte beachten Sie, dass Sie zuallererst einen Blick in Metas Dokumentation <https://developers.facebook.com/docs/>`_ werfen sollten, um die aktuellsten und relevantesten Informationen zu erhalten. Einige Schritte auf Metas Seite werden hier nur als Voraussetzungen erwähnt und sind nicht in dieser Dokumentation enthalten.
sr: Обратите пажњу да прво консултујете `Meta документацију <https://developers.facebook.com/docs/>`_ за најновије и важне информације о њиховој конфигурацији. Неки кораци са њихове стране су овде напоменути само као предуслов, с обзиром да су ван домена ове документације.

source: The setup of the :doc:`WhatsApp channel </channels/whatsapp/index>` has similar prerequisites as the Facebook channel. So, if you managed to set one of them to up, you should have a look at the other one too. It could be a low hanging fruit! 🎉
de: Die Einrichtung des :doc:`WhatsApp-Kanals </channels/whatsapp/index>` erfordert ähnliche Schritte und Voraussetzungen wie der Facebook-Kanal. Wenn Sie einen der beiden Kanäle eingerichtet haben, können Sie sich auch die Einrichtung des anderen ansehen! 🎉
sr: Подешавање :doc:`WhatsApp канала </channels/whatsapp/index>` захтева сличне предуслове као Facebook канал. Уколико сте већ подесили један, погледајте и други. Можда не захтева толико труда колико мислите! 🎉

source: Prerequisites
de: Voraussetzungen
sr: Предуслови

source: `Meta business account <https://business.facebook.com/overview>`_
de: `Meta-Business-Konto <https://business.facebook.com/overview>`_
sr: `Meta business налог <https://business.facebook.com/overview>`_

source: `Meta developer account <https://developers.facebook.com/docs/development/register>`_
de: `Meta-Entwickler Konto <https://developers.facebook.com/docs/development/register>`_
sr: `Meta developer налог <https://developers.facebook.com/docs/development/register>`_

source: Permission to create an app inside your developer account and needed information for the app (see `here <https://developers.facebook.com/docs/development/create-an-app>`_)
de: Erlaubnis zur Erstellung einer App innerhalb Ihres Kontos als Entwickler und erforderliche Informationen für die App (siehe `hier <https://developers.facebook.com/docs/development/create-an-app>`_)
sr: Дозвола за креирање апликације унутар вашег developer налога и неопходне информације о апликацији (погледајте `овде <https://developers.facebook.com/docs/development/create-an-app>`_)

source: Creating an App
de: Erstellen einer App
sr: Креирање апликације

source: Create a new app
de: Eine neue App erstellen
sr: Креирање нове апликације

source: Go to Meta's `app dashboard <https://developers.facebook.com/apps>`_ and create a new app.
de: Gehen Sie zu Metas `App-Dashboard <https://developers.facebook.com/apps>`_ und erstellen Sie eine neue App.
sr: Посетите Meta `контролну таблу апликација <https://developers.facebook.com/apps>`_ и креирајте нову апликацију.

source: Screenshot of Meta's app dashboard with highlighted "Create App" button
de: Screenshot des App-Dashboards von Meta mit hervorgehobener Schaltfläche "Create App" Schaltfläche
sr: Снимак екрана који приказује Meta контролну таблу апликација са наглашеним дугметом „Create App”

source: If you have more than one business portfolio, select the desired one.
de: Wenn Sie mehr als ein Business Portfolio haben, wählen Sie das gewünschte aus.
sr: Уколико имате више од једног business портфолиа, одаберите један.

source: In the "Use cases" tab, select "Other" and "Business" app type.
de: Wählen Sie im Tab "Use cases" den App-Typ "Other" und "Business".
sr: Под језичком „Use cases”, одаберите „Other” и „Business” тип апликације.

source: Screenshot of app creation with highlighted app type
de: Screenshot der App-Erstellung mit hervorgehobenem App-Typ
sr: Снимак екрана који приказује креирање апликације са наглашеним типом апликације

source: In the next screen, provide a fitting app name, contact email address and select your business portfolio and finally click on "Create app".
de: Geben Sie in der nächsten Ansicht einen passenden App-Namen und eine Kontakt-E-Mail-Adresse an, wählen Sie Ihr Business Portfolio aus und klicken Sie schließlich auf "Create app".
sr: На следећем екрану, унесите одговарајући назив апликације, контакт имејл адресу и одаберите business портфолио да бисте конално кликнули на „Create app”.

source: Screenshot of app creation on "Details" tab
de: Screenshot der App-Erstellung im Tab "Details"
sr: Снимак екрана приказује „Details” језичак приликом креирање апликације

source: Add a product to your app
de: Ein Produkt zu Ihrer App hinzufügen
sr: Додавање производа у вашу апликацију

source: After creating the app, you should see the app overview, where you can add a product to your app.
de: Nachdem Sie die App erstellt haben, sollten Sie die Übersicht der App sehen, in der Sie ein Produkt zu Ihrer App hinzufügen können.
sr: По креирању апликације, биће вам приказан преглед апликације, где можете повезати производ са својом апликацијом.

source: Scroll down and select "Facebook Login for Business" by clicking on the "Set up" button.
de: Scrollen Sie nach unten und wählen Sie "Facebook Login for Business", indem Sie auf die Schaltfläche "Set up" klicken.
sr: Изаберите „Facebook Login for Business” испод кликом на дугме „Set up”.

source: Screenshot of product overview with highlighted "Facebook Login for Business"
de: Screenshot der Produktübersicht mit hervorgehobenem "Facebook Login for Business"
sr: Снимак екрана који приказује преглед производа са наглашеним „Facebook Login for Business”

source: In the following screen, go to "Valid OAuth Redirect URIs" and provide the URL of your Zammad instance, followed by ``/api/v1/external_credentials/facebook/callback``. You can copy this URL from Zammad if you click on the "Configure App" button in Zammad's Facebook channel admin screen.
de: Gehen Sie in der folgenden Ansicht auf "Valid OAuth Redirect URIs" und geben Sie die URL Ihrer Zammad-Instanz ein, gefolgt von ``/api/v1/external_credentials/facebook/callback``. Sie können diese URL von Zammad kopieren, wenn Sie auf die Schaltfläche "App konfigurieren" in der Ansicht des Facebook-Kanals von Zammad klicken.
sr: На следећем екрану, идите на „Valid OAuth Redirect URIs” и унесите URL адресу ваше Zammad инстанце, а затим ``/api/v1/external_credentials/facebook/callback``. Ову URL адресу можете и ископирати из Zammad-а уколико кликнете на дугме „Подеси апликацију” у Zammad администраторским подешавањима Facebook канала.

source: Screenshot of app settings with highlighted "OAuth Redirect URIs"
de: Screenshot der App-Einstellungen mit hervorgehobenen "OAuth Redirect URIs"
sr: Снимак екрана подешавања апликације са наглашеним „OAuth Redirect URIs”

source: Continue with the next step on Zammad's side by connecting the Facebook with Zammad.
de: Fahren Sie mit dem nächsten Schritt in Zammad fort, indem Sie Facebook mit Zammad verbinden.
sr: Наставите са следећим кораком у Zammad-у, повезивањем Facebook са Zammad-ом.

source: Connect Facebook App in Zammad
de: Facebook-App in Zammad verbinden
sr: Повежите Facebook апликацију у Zammad-у

source: If not already done, go to the Facebook channel section in the admin interface in Zammad and click on "Configure App". This will open a dialog where you have to provide the app ID as well as the app secret.
de: Falls noch nicht geschehen, gehen Sie in der Verwaltungsoberfläche von Zammad zum Abschnitt Facebook-Kanal und klicken Sie auf "App konfigurieren". Daraufhin öffnet sich ein Dialog, in dem Sie die App-ID und App-Secret angeben müssen.
sr: Уколико нисте већ то урадили, идите у одељак Facebook канала у администраторском интерфејсу Zammad-а и кликните на „Подеси апликацију”. Ово ће приказати дијалог где ће се од вас тражити да унесете ID и шифру апликације.

source: Head over to the Meta app dashboard and switch to "App settings" > "Basic". Copy the "App ID" and the the "App secret" (after clicking on the "Show" button) and paste both to Zammad in the corresponding fields.
de: Gehen Sie zum Meta-App-Dashboard und wechseln Sie zu "App settings" > "Basic". Kopieren Sie die "App ID" und das "App Secret" (nachdem Sie auf die Schaltfläche "Show" geklickt haben) und fügen Sie beide in Zammad in die entsprechenden Felder ein.
sr: Назад на Meta контролној табли апликација пребаците се на „App settings” > „Basic”. Ископирајте „App ID” као и „App secret” (по клику на дугме „Show”) и налепите их у одговарајућа поља у Zammad-у.

source: Screenshot showing basic settings section of app settings
de: Screenshot zeigt den Bereich Basic Settings der App-Einstellungen
sr: Снимак екрана који приказује одељак основних подешавања апликације

source: Screenshot showing "Connect Facebook App" dialog in Zammad
de: Screenshot des Dialogs "Facebook-App verbinden" in Zammad
sr: Снимак екрана који приказује дијалог „Повежи Facebook апликацију” у Zammad-y

source: Confirm it by clicking on "Submit" and continue with the next step.
de: Bestätigen Sie die Eingabe mit einem Klick auf "Absenden" und fahren Sie mit dem nächsten Schritt fort.
sr: Потврдите кликом на дугме „Пошаљи” и наставите са следећим кораком.

source: Add Facebook Account to Zammad
de: Facebook Konto zu Zammad hinzufügen
sr: Додавање Facebook налога у Zammad

source: After you successfully connected your app with Zammad, you can now add an account by clicking the "Add Account" button in Zammad. This redirects you to Facebook and you will see an account selection dialog. Confirm by clicking on "Continue as ..." or log in with another account.
de: Nachdem Sie Ihre App erfolgreich mit Zammad verbunden haben, können Sie nun ein Konto hinzufügen, indem Sie auf die Schaltfläche "Konto hinzufügen" in Zammad klicken. Dadurch werden Sie zu Facebook weitergeleitet und es erscheint ein Dialog zur Auswahl eines Kontos. Bestätigen Sie mit einem Klick auf "Continue as ..." oder melden Sie sich mit einem anderen Konto an.
sr: По успешном повезивању ваше апликације са Zammad-om, сада можете додати налог кликом на дугме „Додај налог” у Zammad-у. Бићете преусмерени на Facebook и биће вам приказан дијалог одабира налога. Потврдите кликом на „Continue as ...” или се пријавите под другим налогом.

source: Screenshot showing Account selection from Meta
de: Screenshot zeigt die Auswahl des Meta Kontos
sr: СНимак екрана који приказује одабир Meta налога

source: In the next screen you can choose if you want to receive tickets from all pages or just selected ones. Choose what fits your needs and confirm by clicking "Continue".
de: In der nächsten Ansicht können Sie wählen, ob Sie Tickets von allen Seiten oder nur von ausgewählten Seiten erhalten möchten. Wählen Sie entsprechend ihrer Anforderung und bestätigen Sie mit "Continue".
sr: На следећем екрану можете одабрати да ли желите да примате тикете са свих или само одабраних страница. Изаберите према вашим потребама и потврдите кликом на „Настави”.

source: Screenshot showing pages selection from Meta
de: Screenshot zeigt die Seitenauswahl von Meta
sr: Снимак екрана који приказује избор Meta страница

source: Finally, you see an overview about the requested permission. Click on "Save" and "Got it" in the next screen.
de: Schließlich sehen Sie eine Übersicht über die angefragten Berechtigungen. Klicken Sie auf "Save" und "Got it" in der nächsten Ansicht.
sr: Коначно, видећете преглед затражених дозвола. Кликните на „Сачувај” и „Разумем!” на следећем екрану.

source: Screenshot showing permission overview
de: Screenshot mit Übersicht der Berechtigungen
sr: Снимак екрана који приказује преглед дозвола

source: You are now redirected to Zammad where you can see a configuration dialog. Select a group you want to handle the Facebook tickets and click on "Submit".
de: Sie werden nun zu Zammad weitergeleitet, wo Sie einen Konfigurationsdialog sehen können. Wählen Sie eine Gruppe aus, die die Facebook Tickets bearbeiten soll und klicken Sie auf "Absenden".
sr: Сада ћете бити преусмерени на Zammad где можете да видите дијалог подешавања. Одаберите групу у којој желите да обрађујете Facebook тикете и кликните на „Пошаљи”.

source: Screenshot showing group selection dialog in Zammad
de: Screenshot zeigt Gruppenauswahldialog in Zammad
sr: Снимак екрана који приказује дијалог избора групе у Zammad-у

source: After that, you are technically ready to go. However, you have to do some additional steps, which aren't covered in this documentation:
de: Danach sind Sie im Prinzip einsatzbereit. Sie müssen jedoch einige zusätzliche Schritte durchführen, die in dieser Dokumentation nicht behandelt werden:
sr: Након свега, технички сте спремни. Међутим, биће неопходно обавити додатне кораке, који нису покривени овом документацијом:

source: Request advanced access for your app (see screenshot below)
de: Fragen Sie erweiterte Berechtigung für Ihre App an (siehe Screenshot unten)
sr: Затражите додатан приступ за вашу апликацију (погледајте снимак екрана испод)

source: Request a business review if your business is not already reviewed
de: Fragen Sie ein Business Review an, falls noch nicht geschehen
sr: Затражите business проверу уколико је још нисте обавили

source: Switch your app from development to live mode
de: Schalten Sie Ihre Anwendung vom Development- in den Live-Modus um
sr: Пребаците вашу апликацију из развојног у мод уживо

source: Screenshot showing permission and features screen in the Facebook developer portal
de: Screenshot zeigt Berechtigungen und Funktionen im Facebook-Entwicklerportal
sr: Снимак екрана који приказује дозволе и функције у Facebook developer порталу

source: Form
de: Formular
sr: Форма

source: Feedback or contact forms are used on websites quite often. Usually they will generate an email which will be sent to somebody who forwards it and so on. With Zammad it's quite easy to integrate these forms into your website and directly generate tickets with them. In just 2 minutes.
de: Feedback-/Kontaktformulare werden häufig auf Webseiten eingesetzt. Üblicherweise werden daraus allerdings E-Mails generiert, die an einen bestimmten Account geschickt und von dort weitergeleitet werden. Mit Zammad können Sie in nur zwei Minuten ein solches Formular für Ihre Website erstellen und Tickets generieren.
sr: Форме за повратне информације или контакт се често користе на интернет презентацијама. Обично ће генерисати имејл поруку која ће бити прослеђена на исправну адресу и тако даље. Са Zammad-ом је прилично лако интегрисати ове обрасце у ваш сајт и директно генерисати тикете преко њих. У року од два минута.

source: Zammad form management page
de: Zammad Formular-Einstellungen
sr: Zammad страница за управљање формама

source: Limitations
de: Einschränkungen
sr: Ограничења

source: Please note the following limitations:
de: Bitte beachten Sie die folgenden Limitierungen:
sr: Имајте на уму следећа ограничења:

source: The fields provided by the form are limited to the following:
de: Die im Formular nutzbaren Felder sind beschränkt auf die folgenden:
sr: Поља наведена у форми су ограничена на следеће:

source: Message
de: Nachricht
sr: Порука

source: Attachment upload (optional)
de: Hochladen von Anhängen (optional)
sr: Отпремање прилога (необавезно)

source: Checkbox for custom agreement text (optional)
de: Checkbox für individuelle Hinweise (optional)
sr: Поље за потврду прилагођеног текста споразума (необавезно)

source: As of now only one dedicated form per instance is possible
de: Aktuell kann nur ein Formular pro Instanz verwendet werden
sr: За сада је могућ само једна наменска форма по инстанци

source: Zammad comes with certain settings for forms.
de: Es gibt Einstellungen für Formulare in Zammad.
sr: Zammad долази са одређеним подешавањима за форме.

source: By default the form channel is *inactive*. Use the switch in front of "Form" to activate this channel.
de: Standardmäßig ist der Formular-Kanal *inaktiv*. Klicken Sie auf den Schalter vor "Formular", um den Kanal zu aktivieren.
sr: Подразумевано је канал форме *искључен*. Користите прекидач испред наслова „Форма“ да активирате овај канал.

source: Forms will not be displayed on your website if the channel is not active. This does not affect the form *preview* on the channels setting page.
de: Formulare werden nicht auf Ihrer Webseite angezeigt, solange der Kanal deaktiviert ist. Die *Vorschau* in den Formular-Einstellungen kann jedoch immer angezeigt werden.
sr: Форме неће бити приказане на вашој интернет презентацији ако је канал искључен. Ово не утиче на *преглед* форме на страници за подешавање канала.

source: Group selection for ticket creation
de: Gruppenauswahl bei Ticketerstellung
sr: Избор групе за отварање тикета

source: The group you set here defines where tickets should be created if they're supplied by Zammad's web form.
de: Die Gruppenauswahl legt fest, in welcher Gruppe die über das Formular kommenden Tickets erstellt werden sollen.
sr: Група коју сте овде поставили дефинише где треба да се сместе тикету отворени путем Zammad-ове форме.

source: This section helps you to configure your form in the channel's scope. If you're happy with what you've chosen, you're provided with the code you need to copy to your website.
de: In diesem Bereich können Sie das Formular anpassen. Sofern Sie mit dem Ergebnis zufrieden sind müssen Sie den ausgegebenen Code noch in Ihrer Website einfügen.
sr: Овај одељак вам помаже да подесите форму у оквиру канала. Ако сте задовољни оним што сте изабрали, добијате код који треба да копирате на свој сајт.

source: The designer's changes *are not* stored anywhere in Zammad. This means that the provided source code needs to be copied every time you change settings here.
de: Änderungen im Designer *werden nicht* in Zammad gespeichert. Das bedeutet, dass Sie den Code nach jeder Änderung erneut kopieren und in Ihrer Webseite einfügen müssen.
sr: Промене приказане у дизајнеру *нису* снимљене у Zammad-у. То значи да дати изворни код треба да се копира сваки пут када измените нека подешавања овде.

source: Zammad's form designer supports you with the initial configuration of your form.
de: Der Formular-Designer von Zammad unterstützt Sie bei der initialen Konfiguration Ihres Formulars.
sr: Zammad-ов дизајнер форме вам обезбеђује почетна подешавања ваше форме.

source: So let's talk about the options the designer provides.
de: Im Folgenden finden Sie die einzelnen Optionen des Designers.
sr: Хајде да разговарамо о опцијама које дизајнер нуди.

source: Title of the form
de: Titel des Formulars
sr: Наслов форме
