Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: Activates the username & password login by default and if no third-party login is activated. Disabling password login on the Zammad login page only takes effect if you enable any :doc:`third-party`.
de: Aktiviert standardmäßig die Anmeldung mit Benutzernamen und Passwort wenn keine Drittanbieteranmeldung aktiviert ist. Die Deaktivierung der Passwort-Anmeldung auf der Zammad-Anmeldeseite wird nur wirksam, wenn Sie eine :doc:`third-party` Anmeldung aktivieren.
sr: Омогућује пријаву путем корисничког имена и лозинке уколико нема укључених пријава преко трећег лица. Искључивање пријављивања путем лозинке на Zammad страници за пријаву ступа на снагу само ако омогућите било коју пријаву преко :doc:`трећег лица <third-party>`.

source: See :doc:`third-party` for supported third-party logins.
de: Siehe :doc:`third-party` für unterstützte Drittanbieter-Logins.
sr: Погледајте :doc:`овде <third-party>` за подржане опције пријаве преко трећих лица.

source: Figure showing de-activated "Password Login" setting
de: Abbildung zeigt die deaktivierte Einstellung "Passwort Anmeldung"
sr: Слика која приказује искључено подешавање „Пријављивање путем лозинке“

source: To help administrators to overcome "login issues", Zammad automatically offers a password request for administrator users. This allows you to adjust Third-Party applications even if the login does no longer work!
de: Um Administratoren bei "Anmelde-Problemen" zu helfen, bietet Zammad automatisch eine Passwortabfrage für Administrator-Benutzer an. Dies ermöglicht es Ihnen, Anwendungen von Drittanbietern anzupassen, auch wenn der Login nicht mehr funktioniert!
sr: Да би помогао администраторима да превазиђу „проблеме са пријављивањем“, Zammad аутоматски нуди пријаву привременом лозинком администраторе. Ово вам омогућава да подесите апликације трећег лица чак и ако пријава уопште не функционише!

source: Session Timeout
de: Sitzungs-Timeout
sr: Време истека сесије

source: All settings below by default are set to ``4 weeks``. Session Timeout defines the life time of a users session. As soon as it's reached, Zammad will automatically log off the session in question.
de: Alle folgenden Einstellungen sind standardmäßig auf ``4 Wochen`` eingestellt. Session Timeout definiert die Lebenszeit einer Benutzersitzung. Sobald sie erreicht ist, meldet Zammad die betreffende Sitzung automatisch ab.
sr: Сва подешавања испод су подразумевано подешена на ``4 недеље``. Временско ограничење сесије дефинише време трајања сесије корисника. Чим се достигне, Zammad ће аутоматски одјавити дотичну сесију.

source: Zammad takes the highest value set assigned for the user based on the permissions.
de: Zammad nimmt den höchsten Wert, der dem Benutzer aufgrund der Berechtigungen zugewiesen wurde.
sr: Zammad узима највишу вредност која је додељена кориснику на основу дозвола.

source: ``default`` (fallback if user doesn't have above permissions set)
de: ``default`` (Fallback, wenn der Benutzer die oben genannten Berechtigungen nicht hat)
sr: ``подразумевано`` (замена ако корисник нема постављене дозволе изнад)

source: All settings act independently from each other allowing you to disable the timeouts for e.g. admins, but not agents.
de: Alle Einstellungen wirken unabhängig voneinander, so dass Sie z.B. nur die Timeouts für Admins deaktivieren können.
sr: Сва подешавања делују независно једно од другог омогућавајући вам да искључите временска ограничења за нпр. администраторе, али не и оператере.

source: Example
de: Beispiel
sr: Пример

source: Let's suppose you configured the following session timeouts
de: Angenommen, Sie haben die folgenden Sitzungs-Timeouts konfiguriert
sr: Претпоставимо да сте подесили следећа временска ограничења сесије

source: default: 3 weeks
de: Standard: 3 Wochen
sr: подразумевано: 3 недеље

source: admin: 2 weeks
de: admin: 2 Wochen
sr: admin: 2 недеље

source: ticket.agent: 4 weeks
de: ticket.agent: 4 Wochen
sr: ticket.agent: 4 недеље

source: ticket.customer: 1 week
de: ticket.customer: 1 Woche
sr: ticket.customer: 1 недеља

source: This results in the following situations:
de: Daraus ergibt sich folgendes Szenario:
sr: Ово резултира следећим ситуацијама:

source: a user with ``admin`` permission will have a timeout of 2 weeks
de: ein Benutzer mit der Berechtigung ``admin`` hat einen Timeout von 2 Wochen
sr: корисник са дозволом ``admin`` имаће временско ограничење од 2 недеље

source: a user with ``admin`` and ``ticket.agent`` permissions will have a timeout of 2 weeks
de: ein Benutzer mit den Rechten ``admin`` und ``ticket.agent`` hat einen Timeout von 2 Wochen
sr: корисник са дозволама ``admin`` и ``ticket.agent`` имаће временско ограничење од 2 недеље

source: a user with ``ticket.customer`` permission will have a timeout of 1 week
de: ein Benutzer mit der Berechtigung ``ticket.customer`` hat einen Timeout von 1 Woche
sr: корисник са дозволом ``ticket.customer`` имаће временско ограничење од 1 недеље

source: a user with neither ``admin``, ``ticket.agent`` nor ``ticket.customer`` permissions will have a timeout of 3 weeks
de: ein Benutzer, der weder ``admin``, ``ticket.agent`` noch ``ticket.customer`` Rechte hat, hat einen Timeout von 3 Wochen
sr: корисник који нема дозволе ни за ``admin``, ``ticket.agent`` ни за ``ticket.customer`` имаће временско ограничење од 3 недеље

source: This section allows you to define password requirements for the local user accounts.
de: In diesem Bereich können Sie die Anforderungen an das Passwort für die lokalen Benutzerkonten festlegen.
sr: Овај одељак вам омогућава да подесите понашање лозинке за локалне корисничке налоге.

source: Zammad does **not** allow you to change your LDAP password, instead, it will set a password in its local database which might confuse your users. This might be addressed in the future by `#1169 <https://github.com/zammad/zammad/issues/1169>`_.
de: Zammad erlaubt das Ändern des LDAP-Passworts **nicht**. Stattdessen wird ein Passwort in der lokalen Datenbank gesetzt, was zu Verwirrung führen könnte. Dies kann zukünftig durch `#1169 <https://github.com/zammad/zammad/issues/1169>`_ behoben.
sr: Zammad вам **не** дозвољава да промените своју LDAP лозинку, већ ће поставити лозинку у својој локалној бази података која би могла збунити ваше кориснике. Овим ће се убудуће бавити `#1169 <https://github.com/zammad/zammad/issues/1169>`_.

source: **Exception for admins**
de: **Ausnahme für Administratoren**
sr: **Изузетак за администраторе**

source: Please note that below password policies *do not* affect administrators setting passwords on user accounts. While this seems strange and not safe we believe that an administrator knowing an user's password is insecure as well.
de: Bitte beachten Sie, dass die unten aufgeführten Passwortrichtlinien *nicht* das manuelle Setzen von Passwörtern für Benutzer durch Administratoren betrifft. Das mag inkonsistent und seltsam wirken, aber wir sind der Meinung, dass es ebenfalls nicht sicher ist, wenn ein Administrator das Passwort eines Benutzers kennt.
sr: Имајте на уму да доле наведени захтеви за јачину лозинке *не* утичу на администраторе који постављају лозинке на корисничким налозима. Иако ово изгледа чудно и небезбедно, верујемо да је и администратор који зна лозинку корисника такође небезбедан.

source: The suggested workflow is either:
de: Die vorgeschlagene Vorgehensweise ist entweder:
sr: Предложени радни ток је или:

source: to use third party logins to not require local passwords at all **- or -**
de: Anmeldung von Drittanbietern zu verwenden, um keine lokalen Passwörter mehr zu benötigen **- oder -**
sr: да користите пријаве преко трећег лица тако да уопште не захтевате локалне лозинке **- или -**

source: to require your *user to reset the password* upon first login.
de: dass Ihr Benutzer bei der ersten Anmeldung sein *Kennwort zurücksetzen* muss.
sr: да захтевате од *корисника да поништи лозинку* приликом првог пријављивања.

source: This way administrators are not required to set a user's password at all!
de: Auf diese Weise müssen Administratoren das Passwort eines Benutzers überhaupt nicht festlegen!
sr: На овај начин администратори уопште нису обавезни да постављају корисничку лозинку!

source: Maximum Failed Logins
de: Maximale Anzahl fehlgeschlagener Anmeldungen
sr: Максимални број неуспешних пријава

source: You can choose a value between ``4`` and ``20``. This defines how often a login to a user account may fail until Zammad will lock it. Your users can always use the "forgot password" function to change their password and unlock their account.
de: Sie können einen Wert zwischen ``4`` und ``20`` wählen. Dieser Wert legt fest, wie oft eine Anmeldung bei einem Benutzerkonto fehlschlagen darf, bis Zammad es sperrt. Ihre Benutzer können jederzeit die Funktion "Passwort vergessen" verwenden, um ihr Passwort zu ändern und ihr Konto zu entsperren.
sr: Можете да изаберете вредност између ``4`` и ``20``. Ово одређује колико често пријављивање на кориснички налог може бити неуспешно док га Zammad не закључа. Ваши корисници увек могу да користе функцију „изгубљена лозинка“ да промене своју лозинку и откључају свој налог.

source: The default value is ``10``.
de: Der Standardwert ist ``10``.
sr: Подразумевана вредност је ``10``.

source: Beside changing the user's password, you can also unlock accounts via
de: Neben der Änderung des Benutzerkennworts können Sie Konten auch entsperren über
sr: Поред промене корисничке лозинке, налоге можете откључати и преко

source: :ref:`User management <locked-user-accounts>`
de: :ref:`Benutzerverwaltung <locked-user-accounts>`
sr: :ref:`Листе за управљање корисницима <locked-user-accounts>`

source: :docs:`Console (system documentation) </admin/console/working-on-users.html>`
de: :docs:`Konsole (System Dokumentation) </admin/console/working-on-users.html>`
sr: :docs:`Конзола (системска документација) </admin/console/working-on-users.html>`

source: :docs:`API (system documentation) </api/user.html>`
de: :docs:`API (System Dokumentation) </api/user.html>`
sr: :docs:`API (системска документација) </api/user.html>`

source: Failed logins via LDAP no longer lock accounts.
de: Fehlgeschlagene Anmeldungen über LDAP sperren keine Konten mehr.
sr: Неуспеле пријаве преко LDAP-а више не закључавају налоге.

source: 2 Lower Case And 2 Upper Case Characters
de: 2 Kleinbuchstaben und 2 Großbuchstaben
sr: 2 мала и 2 велика слова

source: You can add complexity to passwords by enforcing at least 2 upper and lower case characters.
de: Sie können die Komplexität von Passwörtern erhöhen, indem Sie mindestens 2 Groß- und Kleinbuchstaben vorschreiben.
sr: Лозинкама можете додати сложеност тако што ћете применити најмање 2 велика и мала слова.

source: The default value is ``no``.
de: Der Standardwert ist ``nein``.
sr: Подразумевана вредност је ``не``.

source: Minimum Length
de: Minimale Länge
sr: Минимална дужина

source: This defines the minimum password length required for users to provide (from ``4`` to ``20``).
de: Dies definiert die minimale Passwortlänge, die Benutzer einhalten müssen (von ``4`` bis ``20``).
sr: Ово одређује минималну дужину лозинке коју корисници морају дати (од ``4`` до ``20``).

source: The default value is ``6``.
de: Der Standardwert ist ``6``.
sr: Подразумевана вредност је ``6``.

source: Digit Required
de: Ziffer benötigt
sr: Неопходна цифра

source: This enforces your users to use at least one digit within the password.
de: Dadurch müssen Ihre Benutzer mindestens eine Ziffer im Passwort verwenden.
sr: Ово приморава ваше кориснике да користе најмање једну цифру унутар лозинке.

source: The default value is ``yes``.
de: Der Standardwert ist ``Ja``.
sr: Подразумевана вредност је ``да``.

source: Special Character Required
de: Sonderzeichen erforderlich
sr: Неопходан специјални знак

source: This setting allows you to improve your password quality even more by enforcing the password to contain at least one special character.
de: Mit dieser Einstellung können Sie die Stärke Ihres Passworts noch weiter erhöhen, indem das Passwort mindestens ein Sonderzeichen enthalten muss.
sr: Ово подешавање вам омогућава да још више побољшате квалитет својих лозинки тако што ћете захтевати да лозинка садржи најмање један посебан знак.

source: SSL Certificates
de: SSL-Zertifikate
sr: SSL сертификати

source: Zammad offers the possibility to upload custom certificates and custom Certificate Authority (CA) certificates. This can be useful if you want to connect Zammad the secure way to other systems which are using custom certificates.
de: Zammad bietet die Möglichkeit, benutzerdefinierte Zertifikate und benutzerdefinierte Zertifikate der Zertifizierungsstelle (Certificate Authority, CA) hochzuladen. Dies kann nützlich sein, wenn Sie Zammad auf sichere Weise mit anderen Systemen verbinden wollen, die eigene Zertifikate verwenden.
sr: Zammad вам омогућава да отпремите прилагођене сертификате и сертификате органа за сертификацију (CA). Ово може бити корисно ако желите да повежете Zammad на безбедан начин са другим системима који користе прилагођене сертификате.

source: An example use case might be: You have an internal LDAP server that is not accessible from the internet, and you want a SSL-encrypted connection, using a custom certificate.
de: Ein Beispielanwendungsfall könnte sein: Sie haben einen internen LDAP-Server, der nicht über das Internet zugänglich ist und Sie möchten zu diesem eine SSL-verschlüsselte Verbindung mit einem benutzerdefinierten Zertifikat herstellen.
sr: Пример употребе би могао бити: имате интерни LDAP сервер који није видљив на интернту, и желите да се повежете путем шифроване SSL конекције, користећи прилагођени сертификат.

source: You should have an existing custom certificate file and/or a custom CA certificate file, which you want to add to Zammad. As filetype ``.crt`` is supported and the certificate format has to be PEM (Base64 ASCII).
de: Sie sollten eine bestehende Zertifikatsdatei und/oder eine CA-Zertifikatsdatei haben, die Sie zu Zammad hinzufügen möchten. Als Dateityp wird ``.crt`` unterstützt und das Zertifikatsformat muss PEM (Base64 ASCII) sein.
sr: Требаже вам постојећи прилагођени сертификат и прилагођени CA сертификат које желите да додате у Zammad. Подрђан формат датотеке је ``.crt`` и формат сертификата мора бити PEM (Base64 ASCII).

source: When you import a custom CA certificate, all certificates generated with this are trusted. This can be useful if you have more than one system/certificate you want to connect to and the certificates are issued from the same custom CA.
de: Wenn Sie ein eigenes CA-Zertifikat importieren, werden alle mit diesem Zertifikat erzeugten Zertifikate als vertrauenswürdig eingestuft. Dies kann nützlich sein, wenn Sie mehr als ein System/Zertifikat haben, mit dem Sie sich verbinden möchten, und die Zertifikate von derselben CA ausgestellt wurden.
sr: Када увезете прилагођени CA сертификат, сви сертификати генерисани путем њега биће признати. Ово може бити корисно ако имате више од једног система које желите да повежете и сертификати су издати одстране истог прилагођеног CA.

source: Add a Certificate
de: Zertifikat hinzufügen
sr: Додавање сертификата

source: To add a custom certificate or a custom CA certificate, head over to *Settings > Security > SSL Certificates* in the admin panel. Here you can find a "Add SSL Certificate" button. In the dialog you can either select a certificate file or paste the content of the certificate:
de: Um ein benutzerdefiniertes Zertifikat oder ein benutzerdefiniertes CA-Zertifikat hinzuzufügen, gehen Sie im Admin-Bereich zu *Einstellungen > Sicherheit > SSL-Zertifikate*. Hier finden Sie eine Schaltfläche "SSL-Zertifikat hinzufügen". In dem Dialog können Sie entweder eine Zertifikatsdatei auswählen oder den Inhalt des Zertifikats einfügen:
sr: За додавање прилагођеног сертификата или прилагођеног CA сертификата, упутите се на *Подешавања > Безбедност > SSL сертификати* у панелу администратора. Тамо можете пронађи дугме „Додај SSL сертификат”. У дијалогу можете одабрати или да отпремите датотеку сертификата или да налепите садржај сертификата:

source: Screenshot showing certificate adding dialog
de: Screenshot zeigt Dialog zum Hinzufügen von Zertifikaten
sr: Снимак екрана који приказује дијалог за додавање сертификата

source: After selecting a file or pasting the content of the certificate, click on the "Add" button to finally upload it to Zammad. Then, the certificates are immediately effective, no restart or similar required.
de: Nachdem Sie eine Datei ausgewählt oder den Inhalt des Zertifikats eingefügt haben, klicken Sie auf die Schaltfläche "Hinzufügen", um es schließlich in Zammad hochzuladen. Danach sind die Zertifikate sofort wirksam, es ist kein Neustart oder ähnliches erforderlich.
sr: По одабиру датотеке или налепљивању садржаја сертификата, кликните на дугме „Додај” да бисте га отпремили у Zammad. Након тога, сертификати се одмах користе, није неопходно рестартовање или слично.

source: Please note that only single certificate files are supported. That means if you want to import a certificate / CA certificate, it must contain **only one** certificate.
de: Bitte beachten Sie, dass nur Dateien mit einzelne Zertifikaten unterstützt werden. Das heißt, wenn Sie ein Zertifikat / CA-Zertifikat importieren möchten, darf es **nur ein** Zertifikat enthalten.
sr: Обратите пажњу да су подржане само датотеке са појединачним сертификатима. Ово значи да ако желите да увезете сертификат / CA сертификат путем датотеке, мора садржати *само један** сертификат.

source: Certificate Overview
de: Zertifikat Übersicht
sr: Преглед сертификата

source: After you added a certificate, you can see a table with information for each added certificate:
de: Nachdem Sie ein Zertifikat hinzugefügt haben, sehen Sie eine Tabelle mit Informationen zu jedem hinzugefügten Zertifikat:
sr: По додавању сертификата, можете видети табелу са информацијама за сваки додати сертификат:

source: Screenshot showing table of added certificates
de: Screenshot zeigt Tabelle mit den hinzugefügten Zertifikaten
sr: Снимак екрана који приказује табелу додатих сертификата

source: Here you can download the certificate or delete it, if you don't need it anymore.
de: Hier können Sie das Zertifikat herunterladen oder es löschen, wenn Sie es nicht mehr benötigen.
sr: Овде можете преузети и обрисати сертификате, ако вам више нису потребни.

source: Deleting Certificates
de: Löschen von Zertifikaten
sr: Брисање сертификата

source: If you want to delete a specific certificate, you can do it by clicking on the menu in the actions column and selecting delete:
de: Wenn Sie ein bestimmtes Zertifikat löschen möchten, können Sie dies tun, indem Sie auf das Menü in der Spalte "Aktionen" klicken und "Löschen" auswählen:
sr: Ако желите да обришете сертификат, то можете учинити кликом на мени у колони радњи и избором брисања:

source: Screenshot showing certificate deletion button
de: Screenshot zeigt Schaltfläche zum Löschen von Zertifikaten
sr: СНимак екрана који приказује дугме за брисање сертификата

source: Downloading Certificates
de: Herunterladen von Zertifikaten
sr: Преузимање сертификата

source: If you want to download your certificates, you can do this as well via corresponding action buttons.
de: Wenn Sie Ihre Zertifikate herunterladen möchten, können Sie dies ebenfalls über entsprechende Aktionsschaltflächen tun.
sr: Ако желите да преузмете ваше сертификате, то можете урадити путем одговарајућих дугмића радњи.

source: Screenshot showing certificate download button
de: Screenshot zeigt Schaltfläche zum Herunterladen des Zertifikats
sr: Снимак екрана који приказује дугме за преузимање сертификата

source: Login Providers
de: Login-Anbieter
sr: Провајдери за пријављивање

source: Third-Party Applications
de: Anwendungen von Drittanbietern
sr: Апликације трећег лица

source: Third party authentication is a great way to help your users to login to Zammad more easily. If the account is yet unknown, Zammad will create a new user automatically, without the user needed to interact (e.g. type in his name). Another big advantage of this feature is that your user doesn't need to remember another password.
de: Die Authentifizierung von Drittanbietern ist eine gute Möglichkeit, Ihren Benutzern die Anmeldung bei Zammad zu erleichtern. Wenn das Benutzerkonto noch nicht bekannt ist, erstellt Zammad automatisch einen neuen Benutzer, ohne dass der Benutzer etwas unternehmen muss (z.B. seinen Namen eingeben). Ein weiterer großer Vorteil dieser Funktion ist, dass der Benutzer sich kein zusätzliches Passwort merken muss.
sr: Провера аутентичности преко трећег лица је одличан начин да помогнете својим корисницима да се лакше пријаве на Zammad. Ако налог још увек није познат, Zammad ће аутоматски додати новог корисника, без потребе за интеракцијом корисника (нпр. укуцавањем њиховог имена). Још једна велика предност ове функције је да ваш корисник не мора да памти додатну лозинку.

source: You can deactivate logging in via :ref:`security_password_login` if any of the mentioned authentication providers are enabled in your instance.
de: Sie können das Einloggen mittels :ref:`security_password_login` deaktivieren, wenn einer der genannten Authentifizierungsanbieter in Ihrer Instanz aktiviert ist.
sr: Можете искључити :ref:`пријављивање путем лозинке <security_password_login>` ако је било који од наведених провајдера аутентификације омогућен у вашој инстанци.

source: You can find the settings in Zammad's admin panel under *Settings > Security > Third-party Applications*.
de: Sie finden die Einstellungen im Admin-Bereich von Zammad unter *Einstellungen > Sicherheit > Anwendungen von Drittanbietern*.
sr: Ова подешавања можете пронаћи у Zammad-овом панелу администратора под *Подешавања > Безбедност > Апликације трећег лица*.

source: We're currently missing documentation for the following login providers:
de: Aktuell fehlt die Dokumentation für die folgenden Login-Provider:
sr: Тренутно нам недостаје документација за следеће провајдере за пријављивање:

source: Automatic Account Link on Initial Logon
de: Automatische Kontoverbindung bei der Erstanmeldung
sr: Аутоматско повезивање налога приликом иницијалне пријаве

source: In general there's two possible options for Zammad on how to deal with already known users as they try to authenticate against a third-party application. By default, Zammad will not automatically link "unknown" authentication providers to existing accounts.
de: In Zammad gibt es zwei Möglichkeiten, wie mit bereits bekannten Benutzern umgegangen werden kann, wenn eine Authentifizierung über eine Drittanbieteranwendung erfolgt. Standardmäßig verknüpft Zammad "unbekannte" Authentifizierungsanbieter nicht automatisch mit bestehenden Konten.
sr: Уопштено говорећи, постоје две могуће опције за Zammad о томе како да се носи са већ познатим корисницима док покушавају да се пријаве преко апликације трећег лица. Подразумевано, Zammad неће аутоматски повезати „непознате“ провајдере за пријављивање са постојећим налозима.

source: This means that the user has to manually link authentication providers to their accounts (for more about this :user-docs:`consult the user documentation </extras/profile-and-settings.html>`).
de: Dies bedeutet, dass der Benutzer die Authentifizierungsanbieter manuell mit seinen Konten verknüpfen muss (weitere Informationen hierzu finden Sie in der :user-docs:`Benutzerdokumentation </extras/profile-and-settings.html>`).
sr: То значи да корисник мора ручно да повеже провајдере за пријављивање са својим налогом (за више о овоме :user-docs:`погледајте корисничку документацију </extras/profile-and-settings.html>`).
