Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: For technical and security reasons, some default fields (the pale ones you can't edit) stay unavailable for display and usage on customer permissions.
de: Aus technischen und sicherheitstechnischen Gründen sind einige Standardfelder (die grauen Felder, die Sie nicht bearbeiten können) für Benutzer mit Kunden-Berechtigung nicht verfügbar.
sr: Из техничких и безбедносних разлога, нека подразумевана поља (нпр. она бледа која не можете да мењате) остају недоступна за приказ и коришћење за дозволе клијента.

source: If you require your customers to change e.g. priorities, please consider using workarounds via :doc:`/system/objects` and :doc:`/manage/trigger`.
de: Wenn Sie möchten dass Ihre Kunden z.B. Prioritäten ändern können, ziehen Sie bitte Workarounds über :doc:`/system/objects` und :doc:`/manage/trigger` in Betracht.
sr: Ако желите да ваши клијенти промене нпр. приоритете, размислите о коришћењу алтернативних решења преко :doc:`објеката </system/objects>` и :doc:`окидача </manage/trigger>`.

source: Ticket title changes not supported in edit mask
de: Änderungen des Ticket-Titels werden in der Bearbeitungsmaske nicht unterstützt
sr: Измена наслова тикета није подржана у форми уређивања

source: It is currently not possible to perform changes of the ticket title in the edit mask (e.g. renaming, set to read-only).
de: Es ist derzeit nicht möglich, in der Bearbeitungsmaske Änderungen am Titel des Tickets vorzunehmen (z.B. umbenennen, auf schreibgeschützt setzen).
sr: Тренутно није могуће изменити наслов тикета у форми уређивања (нпр. промена наслова, постављање само на читање).

source: Ticket text changes not supported in edit mask
de: Ticket-Textänderungen werden in der Bearbeitungsmaske nicht unterstützt
sr: Измена текста тикета није подржана у форми уређивања

source: It is currently not possible to perform changes of the ticket text in the edit mask (e.g. set to read-only).
de: Es ist derzeit nicht möglich, Änderungen am Tickettext in der Bearbeitungsmaske vorzunehmen (z.B. auf schreibgeschützt zu setzen).
sr: Тренутно није могуће изменити текст тикета у форми уређивања (нпр. постављање само на читање).

source: What is out of scope of core workflows?
de: Was decken Core-Workflows nicht ab?

source: There are some things that would count as workflow but are either done via :doc:`/manage/trigger` or :doc:`/manage/scheduler`.
de: Es gibt einige Dinge, die als Workflow gelten würden, aber entweder über :doc:`/manage/trigger` oder :doc:`/manage/scheduler` erledigt werden.
sr: Постоје неке ствари које би се рачунале као радни ток, али се извршавају или преко :doc:`окидача </manage/trigger>` и :doc:`планера </manage/scheduler>`.

source: Such as (but not limited to):
de: Zum Beispiel (nicht abschließend):
sr: Као што су (али не ограничавајући се на):

source: Up- or downgrade permissions of users
de: Berechtigungen von Benutzern herauf- oder herabstufen

source: Affecting article creation or listing
de: Erstellung oder Auslesen von Artikeln

source: Data Privacy
de: Datenschutz
sr: Приватност података

source: You can delete users and their tickets by creating a deletion task. This can be required for compliance with GDPR and other data privacy laws. This page describes the places where you can do it, how to do it and includes additional useful information.
de: Sie können Benutzer und ihre Tickets löschen, indem Sie eine Löschaufgabe erstellen. Dies kann für die Einhaltung der DSGVO und anderer Datenschutzgesetze erforderlich sein. Auf dieser Seite werden die Orte beschrieben, an denen Sie eine Löschaufgabe erstellen können, wie Sie dies tun sowie weitere nützliche Informationen.

source: The permission ``admin.data_privacy`` is required to initiate a deletion task.
de: Die Berechtigung ``admin.data_privacy`` wird benötigt, um eine Löschaufgabe zu erstellen.

source: If you want to delete an organization, the deletion task of the last remaining user of this organization asks you if you want to delete the user's organization as well.
de: Wenn Sie eine Organisation löschen wollen, fragt der Lösch-Dialog des letzten verbleibenden Benutzers dieser Organisation Sie, ob Sie auch die Organisation des Benutzers löschen wollen.

source: It is not possible to only delete a user and keep its tickets.
de: Es ist nicht möglich, nur einen Benutzer zu löschen und dessen Tickets zu behalten.

source: You can't delete your own account.
de: Sie können Ihr eigenes Konto nicht löschen.

source: You can't delete the system's last remaining administrator account.
de: Sie können das letzte verbleibende Administratorkonto des Systems nicht löschen.

source: You can create :docs:`data privacy deletion task via API </api/user.html>`.
de: Sie können :docs:`Datenschutz-Löschaufgaben per API </api/user.html>` erstellen.

source: Only customer tickets of a user are deleted. If the user is also agent, only the owner gets removed from the affected tickets.
de: Es werden nur Kunden-Tickets eines Benutzers gelöscht. Wenn der Benutzer auch Agent ist, wird nur der Besitzer aus den betroffenen Tickets entfernt.

source: All deletions are final! Double check your commands.
de: Alle Löschungen sind final! Prüfen Sie die gewünschte Löschung vor der Ausführung.

source: Manual Deletion via GUI
de: Manuelle Löschung via GUI

source: You can initiate a data privacy deletion task from different places in Zammad:
de: Sie können an verschiedenen Stellen in Zammad eine Löschaufgabe erstellen:

source: User management
de: Benutzerverwaltung

source: User detail page
de: Benutzer-Detailseite

source: Data privacy management
de: Datenschutz-Verwaltung

source: Independent of where you initiate the deletion task, the dialog always looks the same and consists of the following sections:
de: Unabhängig davon, von wo aus Sie die Löschaufgabe starten, sieht der Dialog immer gleich aus und beinhaltet folgende Elementen:

source: User: either the user is pre-selected or you can search for a user by typing its name.
de: Benutzer: Entweder ist der Benutzer vorausgewählt oder Sie können nach einem Benutzer suchen, indem Sie einen Namen eingeben.

source: Delete organization: optional; only available if user is last user of the organization.
de: Organisation löschen: optional; nur verfügbar, wenn der Benutzer der letzte Benutzer der Organisation ist.

source: Preview customer tickets: shows a preview of the affected ticket. Be aware that this is just a preview and it may change, depending on the execution time.
de: Vorschau Kunden-Tickets: Zeigt eine Vorschau des betroffenen Tickets. Beachten Sie, dass es sich nur um eine Vorschau handelt, die sich je nach Ausführungszeit ändern kann.

source: Confirmation: this is a safety feature where you have to enter ``DELETE`` manually to make sure you are not deleting data by accident.
de: Bestätigung: Dies ist eine Sicherheitsfunktion, bei der Sie ``LÖSCHEN`` manuell eingeben müssen, um sicherzustellen, dass Sie nicht versehentlich Daten löschen.

source: Screenshot shows the dialog for creating a deletion task.
de: Screenshot zeigt den Dialog zur Erstellung einer Löschaufgabe.

source: Read on about how to create a deletion task in the different places.
de: Lesen Sie weiter, wie Sie eine Löschaufgabe an verschiedenen Stellen erstellen.

source: User Management
de: Benutzerverwaltung

source: To delete a user and its tickets from within the :doc:`user management </manage/users/index>`, simply locate the user in question (e.g. by searching) and choose **Delete** from the action menu via ︙ button in the user table:
de: Um einen Benutzer und seine Tickets aus der :doc:`Benutzerverwaltung </manage/users/index>` zu löschen, suchen Sie einfach den betreffenden Benutzer (z.B. per Suche) und wählen Sie **Löschen** aus dem Aktionsmenü über die Schaltfläche ︙ in der Benutzertabelle:

source: Screenshot shows a user from user management and the action menu with highlighted sections.
de: Screenshot zeigt einen Benutzer aus der Benutzerverwaltung und das Aktionsmenü mit Hervorhebungen.

source: User Detail Screen
de: Benutzer-Detailansicht

source: To delete a user and its tickets from the user detail screen, choose **Delete** from the action menu in the top right corner:
de: Um einen Benutzer und seine Tickets aus der Benutzer-Detailansicht zu löschen, wählen Sie **Löschen** aus dem Aktionsmenü in der oberen rechten Ecke:

source: Screenshot shows an user detail dialog and the action menu with highlighted sections.
de: Screenshot zeigt eine Benutzer-Detailansicht und das Aktionsmenü mit hervorgehobenen Bereichen.

source: Data Privacy Task
de: Datenschutz-Aufgabe

source: You can find the data privacy section in Zammad's settings under *System > Data Privacy*. To create a deletion task, use the **New Deletion Task** button in the top right corner. The difference to the two mentioned options is that you first have to search the user in the dialog. Everything else is the same.
de: Sie finden den Bereich Datenschutz in den Einstellungen von Zammad unter *System > Datenschutz*. Um eine Löschaufgabe zu erstellen, verwenden Sie die Schaltfläche **Neue Löschaufgabe** in der oberen rechten Ecke. Der Unterschied zu den beiden genannten Optionen besteht darin, dass Sie zunächst den Benutzer im Dialog suchen müssen. Alles andere ist identisch.

source: Screenshot shows the data privacy section in Zammad's settings with highlighted sections.
de: Screenshot zeigt den Datenschutz-Bereich in den Einstellungen von Zammad mit hervorgehobenen Bereichen.

source: In this section, you can also see logs of scheduled and finished deletion tasks. Read on in the next section to learn more.
de: In diesem Abschnitt können Sie auch die Einträge der geplanten und abgeschlossenen Löschaufgaben einsehen. Lesen Sie im nächsten Abschnitt weiter, um mehr zu erfahren.

source: Monitor Deletion Jobs
de: Löschaufgaben überwachen

source: For each user you delete, a deletion task is added to the deletion queue. It may take up to ten minutes for the system to process your request. Depending on the amount of tickets of the user, the deletion itself can also take some time. You can see status messages of these tasks in two places:
de: Für jeden Benutzer, den Sie löschen, wird eine Aufgabe zur Warteschlange hinzugefügt. Es kann bis zu zehn Minuten dauern, bis das System Ihre Aufgabe bearbeitet. Je nach Anzahl der Tickets des Benutzers kann auch die Löschung selbst einige Zeit in Anspruch nehmen. Sie können die Statusmeldungen zu diesen Aufgaben an zwei Stellen einsehen:

source: Data privacy management (Zammad's admin settings)
de: Datenschutz-Verwaltung (in den Zammad-Einstellungen)

source: Activity stream (by opening the dashboard; deletion task entries only visible for users with ``admin.data_privacy`` permission)
de: Aktivitäts-Verlauf (durch Öffnen des Dashboards; Einträge für Löschaufgaben nur für Benutzer mit der Berechtigung ``admin.data_privacy`` sichtbar)

source: For each deleted user, you can see two entries: one when the task is created and one when the task has finished.
de: Für jeden gelöschten Benutzer sehen Sie zwei Einträge: einen, wenn die Aufgabe erstellt wurde, und einen, wenn die Aufgabe beendet ist.

source: Activity stream in dashboard
de: Aktivitäts-Verlauf im Dashboard

source: Screenshot shows the activity stream from Zammad's dashboard with 2 deletion task entries
de: Screenshot zeigt den Aktivitäts-Verlauf in Zammads Dashboard mit 2 Einträgen einer Löschung

source: Data privacy management in admin settings
de: Datenschutz-Verwaltung in den Einstellungen

source: Screenshot shows the data privacy section in Zammad's settings with a finished and a running task
de: Screenshot zeigt Datenschutz-Verwaltung von Zammad mit einer abgeschlossenen und einer laufenden Aufgabe

source: Automatic Deletion via Scheduler
de: Automatische Löschung per Automatisierung

source: In case you want to automatically clean up old customers with their tickets or specific customers or organizations, you can do this by creating a :doc:`scheduler </manage/scheduler>` task. Such a scheduler task checks which users are affected based on conditions and runs at pre-defined times and days.
de: Wenn Sie alte Kunden mit ihren Tickets oder bestimmte Kunden oder Organisationen automatisch bereinigen möchten, können Sie dies durch Erstellen einer :doc:`Automatisierungsaufgabe </manage/scheduler>` tun. Eine solche Aufgabe prüft anhand von Bedingungen, welche Benutzer betroffen sind, und wird zu vordefinierten Zeiten und Tagen ausgeführt.

source: The relevant object is **User** and the action to execute is **Action** > **Add a data privacy deletion task**. You can create a condition to narrow down the users you exactly want to delete. A basic example of a scheduler could look like this:
de: Das relevante Objekt ist **Benutzer** und die auszuführende Aktion ist **Aktion** > **Datenschutz-Löschaufgabe hinzufügen**. Sie können eine Bedingung erstellen, um die Benutzer genau einzugrenzen, die Sie löschen möchten. Ein einfaches Beispiel für eine Automatisierung könnte wie folgt aussehen:

source: Screenshot shows important scheduler configuration for a deletion task
de: Screenshot zeigt wichtige Bereiche einer Automatisierungs-Konfiguration für eine Löschaufgabe

source: You can delete only tickets if you choose **Ticket** as object in the scheduler task. This gives you an additional action named **Delete immediately** which does exactly that. Customers of these tickets aren't deleted.
de: Sie können auch nur Tickets löschen, indem Sie **Ticket** als Objekt in der Automatisierungs-Aufgabe wählen. Damit erhalten Sie eine zusätzliche Aktion namens **Sofort löschen**, die genau das tut. Die Kunden dieser Tickets werden nicht gelöscht.

source: Frequently Asked Questions
de: Regelmäßige gestellte Fragen
sr: Често постављана питања

source: What happens if I receive an email from a deleted customer?
de: Was passiert, wenn ich eine E-Mail von einem gelöschten Kunden erhalte?
sr: Шта се дешава ако добијем имејл од избрисаног клијента?

source: Zammad automatically creates a new user account whenever it receives a message from an unrecognized email address, including deleted users. Deleted users are never blocked from creating new tickets.
de: Zammad erstellt automatisch einen neuen Benutzer-Account wann immer es eine Nachricht von unbekannten E-Mail-Adressen erhält - das betrifft auch gelöschte Benutzer. Gelöschte Nutzer werden niemals vom Erstellen neuer Tickets abgehalten.
sr: Zammad аутоматски додаје нови кориснички налог сваки пут када прими поруку са непознате имејл адресе, укључујући и избрисане кориснике. Избрисаним корисницима никада није онемогућено отварање нових тикета.

source: In case you receive an email between the time that you click delete and the system has processed your request, that ticket will be automatically **deleted**. The ticket number of the lost ticket is displayed in the data privacy management in Zammad's admin settings in the deletion task entry under **Deleted Tickets**.
de: Sollten Sie zwischen dem Zeitpunkt, an dem Sie auf "Löschen" klicken, und dem Zeitpunkt, an dem das System Ihre Aufgabe bearbeitet hat, eine E-Mail erhalten, wird dieses Ticket automatisch **gelöscht**. Die Ticketnummer des gelöschten Tickets wird in der Datenschutzverwaltung in den Admin-Einstellungen von Zammad im Eintrag der Löschaufgabe unter **Gelöschte Tickets** angezeigt.

source: What about user information stored in internal notes or other messages?
de: Was ist mit Benutzerinformationen, die in internen Notizen oder anderen Nachrichten gespeichert sind?
sr: А шта је са корисничким информацијама сачуваним у интерним напоменама или другим порукама?

source: The deletion process removes user accounts and associated tickets **only**. If there are references to a user's name or information stored somewhere else in the system, this information **will not be removed** because there is no way to safely determine which information is relevant.
de: Beim Löschvorgang werden **nur** Benutzerkonten und zugehörige Tickets gelöscht. Wenn es Verweise auf den Namen eines Benutzers oder andere Informationen gibt, die irgendwo anders im System gespeichert sind, werden diese Informationen **nicht entfernt**, da es keine Möglichkeit gibt, sicher festzustellen, welche Informationen für die Löschung relevant sind.

source: I deleted a user and can still see a message they sent!
de: Ich habe einen Benutzer gelöscht und kann immer noch eine von ihm gesendete Nachricht sehen!

source: Tickets can only belong to a single customer, but may contain messages from many people. If you deleted a user but you're still seeing articles they sent, then it is an article in a ticket from another customer. The user information of the deleted user is removed but the articles in question are still available.
de: Tickets können nur zu einem einzigen Kunden gehören, können aber Nachrichten von vielen Personen enthalten. Wenn Sie einen Benutzer gelöscht haben, aber immer noch Artikel sehen, die von ihm gesendet wurden, dann handelt es sich um einen Artikel in einem Ticket eines anderen Kunden. Die Benutzerinformationen des gelöschten Benutzers wurden entfernt, aber die betreffenden Artikel sind weiterhin verfügbar.

source: I removed a customer, now my reporting is off!
de: Ich habe einen Kunden entfernt, jetzt passt das Reporting nicht mehr!
sr: Уклонио сам клијента, сада су моји извештаји погрешни!

source: When removing users and their tickets, all references are removed. This also affects reporting - these information are lost.
de: Beim Entfernen von Benutzern und deren Tickets werden alle Referenzen entfernt. Dies betrifft auch das Reporting - diese Informationen sind weg.

source: How long does Zammad store created tasks?
de: Wie lange speichert Zammad erstellte Aufgaben?
sr: Колико дуго Zammad чува заказане захтеве?

source: Please see the on-premise data section of the :docs:`data privacy </appendix/privacy.html>` chapter.
de: Bitte beachten Sie den Abschnitt über lokale Daten im Kapitel :docs:`Datenschutz </appendix/privacy.html>`.
sr: Погледајте одељак о локалним подацима у поглављу :docs:`приватност података </appendix/privacy.html>`.

source: What about re-assigned tickets? I want to delete them, too.
de: Was ist mit neu zugewiesenen Tickets? Ich möchte sie auch löschen.
sr: А шта је са поново додељеним тикетима? Желим да избришем и њих.

source: Only tickets which are currently assigned to the matching customer at the time of the execution of the data privacy deletion task will be deleted. The deletion will not consider historical assignments.
de: Es werden nur Tickets gelöscht, die dem entsprechenden Kunden zum Zeitpunkt der Ausführung der Löschaufgabe zugewiesen sind. Historische Zuweisungen werden bei der Löschung nicht berücksichtigt.

source: Why are there so many deletion task entries, I didn't create them!
de: Warum gibt es so viele Löschaufgabeneinträge, ich habe sie nicht erstellt!
sr: Одакле сви ови захтеви за брисање, ја их нисам додао!

source: The deletion tasks can come from :doc:`scheduler</manage/scheduler>` tasks as well. See :ref:`automatic-deletion-scheduler` above.
de: Die Löschaufgaben können auch von :doc:`Automatisierungsaufgaben</manage/scheduler>` kommen. Siehe :ref:`automatic-deletion-scheduler` oben.

source: Admin Panel Reference
de: Admin-Bereich
sr: Референца администраторског панела

source: Screenshot of Checkmk settings overview
de: Screenshot der Checkmk-Einstellungen in Zammad
sr: Снимак екрана изгледа Checkmk подешавања

source: Which :doc:`group </manage/groups/index>` should Checkmk tickets be assigned to as a default (*i.e.,* when none is specified)?
de: Welcher :doc:`Gruppe </manage/groups/index>` sollen Checkmk-Tickets standardmäßig zugewiesen werden (wenn keine angegeben ist)?
sr: Којој :doc:`групи </manage/groups/index>` треба да буду подразумевано додељени Checkmk тикети (*тј.* када ниједна није наведена)?

source: (Applies to :ref:`API alerts <checkmk-api-alerts>` only.)
de: (Gilt nur für :ref:`API alerts <checkmk-api-alerts>`.)
sr: (Односи се само на :ref:`API упозорења <checkmk-api-alerts>`.)

source: Auto close
de: Automatisch schließen
sr: Аутоматско затварање

source: Should Zammad automatically close tickets if a service has recovered on its own?
de: Soll Zammad Tickets automatisch schließen, wenn sich ein Dienst von selbst "erholt" hat?
sr: Да ли Zammad треба да аутоматски затвори тикете ако се сервис опорави?

source: (Agents will receive notifications for such closures as appropriate.)
de: (Agenten werden gegebenenfalls über solche Schließungen benachrichtigt.)
sr: (Оператери ће примати обавештења о затварањима тикета по потреби.)

source: Auto-close state
de: Automatisch-Schließen-Status
sr: Стање аутоматског затварања

source: What ticket state should be applied when “auto-closing” a ticket?
de: Welcher Ticketstatus soll beim "automatischen Schließen" eines Tickets angewendet werden?
sr: Које стање тикета треба применити приликом „аутоматског затварања“ тикета?

source: You can choose from the seven built-in ticket states. If these states aren't enough for you, you can :ref:`define a new ticket state <ticket-state-reference>` for this purpose as well. This can be useful for tracking tickets with :doc:`reports </manage/report-profiles>`, for example.
de: Sie können aus den sieben eingebauten Ticketstatus wählen. Wenn Ihnen diese Status nicht ausreichen, können Sie auch einen :ref:`neuen Status <ticket-state-reference>` für diesen Zweck definieren. Dies kann z.B. für die Auswertung von Tickets mit :doc:`Berichten </manage/report-profiles>` nützlich sein.
sr: Можете бирати између седам уграђених стања тикета. Ако вам ова стања нису довољна, можете :docs:`дефинисати ново стање тикета <ticket-state-reference>`. На пример, ово може бити посебно корисно за праћење тикета помоћу :doc:`извештаја </manage/report-profiles>`.

source: Recent Logs
de: Aktuellste Protokolle
sr: Недавни уноси евиденције

source: Screenshot of Checkmk "Recent Logs" section
de: Screenshot des Checkmk-Bereichs "Aktuellste Protokolle"
sr: Снимак екрана одељка „Недавни уноси евиденције“ за Checkmk.

source: If you're having trouble getting Zammad and Checkmk to play nicely together, this section can help you troubleshoot.
de: Wenn Sie Probleme bei der Verbindung von Zammad und Checkmk haben kann dieser Abschnitt Ihnen bei der Fehlersuche helfen.
sr: Ако имате проблема да натерате Zammad и Checkmk да лепо сарађују, овај одељак вам може помоћи да решите проблеме.

source: It contains a record of the fifty most recent transactions that Zammad knows about, including each one's request/response details and return status.
de: Sie enthält eine Aufzeichnung der letzten 50 Einträge, die Zammad bekannt sind, einschließlich der Details zu jeder Anfrage/Antwort und des zurückgegebenen Status.
sr: Садржи записе о педесет најновијих трансакција за које Zammad зна, укључујући детаље захтева/одговора и статус одговора.

source: API Reference
de: API-Referenz
sr: API референца
