Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: You can also specify a folder from which Zammad should fetch emails from. If you do so, make sure that the emails are routed to this folder somehow. Otherwise, you won't receive tickets. Leave it empty to fetch all emails from the inbox. After that, choose if fetched emails should remain on the server or not.
de: Sie können auch einen Ordner angeben, aus dem Zammad E-Mails abrufen soll. Wenn Sie dies tun, stellen Sie sicher, dass die E-Mails irgendwie an diesen Ordner weitergeleitet werden. Andernfalls werden Sie keine Tickets erhalten. Lassen Sie das Feld leer, um alle E-Mails aus dem Posteingang zu holen. Legen Sie anschließend fest, ob die abgerufenen E-Mails auf dem Server verbleiben sollen oder nicht.
sr: Такође можете одредити фолдер из кога ће Zammad преузимати имејл поруке. Уколико то и учините, обезбедите да се имејл поруке рутирају у овај фолдер на неки начин. У супротном нећете примати тикете. Оставите ово поље празно за преузимање свих имејл порука из сандучета. Након тога, одлучите да ли се преузете поруке чувају на серверу или не.

source: Depending if there are already email messages in this account, the archive mode dialog may be shown.
de: Je nachdem, ob bereits E-Mail-Nachrichten in diesem Konto vorhanden sind, wird das Dialogfeld für den Archivierungsmodus angezeigt.
sr: У зависности од тога да ли већ постоје имејл поруке у овом сандучету, биће приказан дијалог архивског режима.

source: Now your channel is ready and can be used! If something doesn't work, have a look at the :doc:`common errors section <common-errors>`, where you can find common errors related to the M365 configuration.
de: Jetzt ist Ihr Kanal fertig und kann verwendet werden! Wenn etwas nicht funktioniert, finden Sie unter :doc:`häufige Fehler <common-errors>` einige bekannte Fehlermeldungen und deren Ursache im Zusammenhang mit der M365-Konfiguration.
sr: Сада је ваш канал спреман и може се користити! Уколико нешто не функционише како треба, погледајте у :doc:`одељку о уобичајеним грешкама <common-errors>`, где можете пронаћи детаље у вези неисправне M365 конфигурације.

source: 🤔 **How do I use my Microsoft 365 account for outgoing system notifications?**
de: **Wie verwende ich mein Microsoft 365 Konto für ausgehende Systembenachrichtigungen?**
sr: 🤔 **Како да користим свој Microsoft 365 налог за одлазна системска обавештења?**

source: On **subscription/cloud-hosted instances**, you can't. Notifications will always come from “Notification Master <noreply\@your.zammad.domain>”.
de: In **gehosteten Zammad-Instanzen** in der Cloud ist das nicht möglich. Benachrichtigungen werden hier immer von “Notification Master <noreply\@your.zammad.domain>” versendet.
sr: На **хостованим инстанцама које се плаћају**, не можете. Обавештења ће увек долазити од „Notification Master <noreply\@your.zammad.domain>“.

source: On **self-hosted instances**, we still don't recommend it. Using a Microsoft account for automated, outgoing messages is risky: users who exceed Microsoft's `email sending limits <https://docs.microsoft.com/en-us/office365/servicedescriptions/exchange-online-service-description/exchange-online-limits#receiving-and-sending-limits>`_ can have their accounts suspended.
de: Wir empfehlen das auch nicht auf **selbst gehosteten** Instanzen. Die Verwendung eines Microsoft-Kontos für automatisch ausgehende Nachrichten ist gefährlich: Nutzern, die Microsofts `E-Mail-Versandbegrenzung <https://docs.microsoft.com/en-us/office365/servicedescriptions/exchange-online-service-description/exchange-online-limits#receiving-and-sending-limits>`_ überschreiten, kann das Konto gesperrt werden.
sr: На **инстанцама које хостујете сами**, то и даље не препоручујемо. Коришћење Microsoft налога за аутоматизоване, одлазне поруке је ризично: корисници који прекораче Microsoft `ограничења за слање <https://docs.microsoft.com/en-us/office365/servicedescriptions/exchange-online-service-description/exchange-online-limits#receiving-and-sending-limits>`_ могу бити суспендовани.

source: Set up a generic :doc:`email channel </channels/email/index>` instead, then use the :ref:`Email Notification <email-notification>` setting.
de: Richten Sie stattdessen einen allgemeinen :doc:`E-Mail Kanal </channels/email/index>` ein und benutzen Sie die Einstellungen für die :ref:`E-Mail Benachrichtigung <email-notification>`.
sr: Подесите генерички :doc:`имејл канал </channels/email/index>` уместо тога, користите подешавање :ref:`имејл обавештења <email-notification>`.

source: Re-Authenticate
de: Re-Authentifizierung
sr: Реаутентификација

source: If your token got invalid, you have to replace the token due to other reasons, you want to use a shared mailbox with another user, you can use the **Re-Authenticate** button.
de: Wenn Ihr Token ungültig geworden ist, Sie das Token aus anderen Gründen ersetzen müssen oder Sie ein freigegebenes Postfach mit einem anderen Benutzer verwenden möchten, können Sie die Schaltfläche **Re-Authentifizierung** verwenden.
sr: Уколико ваш кључ постане неважећи, морате да га замените из других разлога, или желите да преузимате из заједничког поштанског сандучета под другим корисником, можете користити дугме **Реаутентификација**.

source: In case you are using an user mailbox, the new user has to match the existing one, otherwise it will result in a user mismatch error. In this case, you should delete the channel and add a new account.
de: Wenn Sie ein Benutzer-Postfach verwenden, muss der neue Benutzer mit dem vorhandenen übereinstimmen, da sonst ein Fehler auftritt. In diesem Fall sollten Sie den Kanal löschen und ein neues Konto hinzufügen.
sr: У случају да користите корисничко поштанско сандуче, нови корисник мора да се поклапа са постојећим, у супротном ће резултирати у грешци. У овом случају, требало би да уклоните постојећи канал и додате нови налог.

source: Request Admin Consent
de: Administrator-Zustimmung beantragen
sr: Захтев за сагласност администратора

source: It is possible to request the permissions via admin consent. In this case Zammad will request necessary permissions for you from your admin, and then your admin (if it's not the same user as you) can accept them on Microsoft side. Trigger this process via the **Request Admin Consent** button in Zammad.
de: Es ist möglich, die Berechtigungen per Administrator-Zustimmung anzufordern. In diesem Fall wird Zammad die notwendigen Berechtigungen für Sie von Ihrem Administrator anfordern, und dann kann Ihr Administrator (falls es nicht Ihr Konto ist) diese auf der Microsoft-Seite bestätigen. Triggern Sie diesen Prozess über die Schaltfläche **Administrator-Zustimmung beantragen** in Zammad.
sr: Могуће је и прибавити неопходне дозволе путем сагласности администратора. У овом случају Zammad ће захтевати потребне дозволе за вас од вашег администратора, и онда ваш администратор (уколико није у питању исти корисник као ви) може да их прихвати на Microsoft страни. Покрените овај поступак преко дугмета **Захтев за сагласност администратора** у Zammad-у.

source: Common Errors
de: Häufige Fehler
sr: Уобичајене грешке

source: Here you can find some common errors in M365 context. Also have a look at the general :doc:`M365 documentation </channels/microsoft365-graph/index>` for the configuration and the :doc:`common errors mentioned in the M365 IMAP channel <../microsoft365/common-errors>`, if your error is not covered here.
de: Hier finden Sie einige häufige Fehler im M365-Kontext. Werfen Sie auch einen Blick auf die allgemeine :doc:`M365-Dokumentation </channels/microsoft365-graph/index>` für die Konfiguration und die :doc:`häufigen Fehler im Zusammenhang mit dem M365-IMAP-Kanal <../microsoft365/common-errors>`, falls Ihr Problem hier nicht behandelt wird.
sr: Овде можете пронаћи неке уобичајене грешке у М365 контексту. Такође погледајте општу :doc:`М365 документацију </channels/microsoft365-graph/index>` у вези подешавања и :doc:`уобичајете грешке поменуте у оквиру M365 IMAP канала <../microsoft365/common-errors>`, уколико ваша грешка није излистана овде.

source: If you try to fix a problem, make sure to remove the account after the fix first and re-add it then again.
de: Wenn Sie versuchen, ein Problem zu beheben, stellen Sie sicher, dass Sie das Konto nach der Behebung zunächst entfernen und dann wieder hinzufügen.
sr: Уколико покушавате да исправите грешку, проверите да ли сте прво уклонили канал пре него што га поново додате.

source: Problem with User Mailbox
de: Problem mit dem Benutzer-Postfach
sr: Проблем са корисничким поштанским сандучетом

source: *The mailbox is either inactive, soft-deleted, or is hosted on-premise.*
de: *Die Mailbox ist entweder inaktiv, gelöscht oder wird on-premise gehostet.*

source: Possible reasons:
de: Mögliche Gründe:
sr: Могући разлози:

source: The user has no access to the mailbox.
de: Der Benutzer hat keinen Zugriff auf die Mailbox.
sr: Корисник нема приступ поштанском сандучету.

source: The account has no mailbox at all (user mailboxes).
de: Das Konto hat überhaupt kein Postfach (bei Benutzerpostfächer).
sr: Налог не поседује (корисничко) поштанско сандуче.

source: Either grant the user access to the mailbox or assign them a license and create a mailbox for this user.
de: Gewähren Sie dem Benutzer entweder Zugriff auf die Mailbox oder weisen Sie ihm eine Lizenz zu und erstellen Sie eine Mailbox für diesen Benutzer.
sr: Или доделите кориснику приступ поштанском сандучету или му обезбедите лиценцу и креирајте поштанско сандуче за њих.

source: Problem with User Permissions
de: Problem mit Benutzer-Berechtigungen
sr: Проблем са дозволама корисника

source: *The specified object was not found in the store., Default folder Root not found.*
de: *Das angegebene Objekt wurde nicht im Speicher gefunden, Standardordner Root nicht gefunden.*

source: Indicates that the user has no delegation permissions for the mailbox. Make sure that the permissions are set correctly or consider using another account.
de: Zeigt an, dass der Benutzer keine Delegationsberechtigungen für das Postfach hat. Vergewissern Sie sich, dass die Berechtigungen korrekt eingestellt sind, oder ziehen Sie die Verwendung eines anderen Kontos in Betracht.
sr: Указује да корисник нема дозволе делегирања за поштанско сандуче. Обезбедите да су дозволе исправно подешене или размислите о коришћењу другог налога.

source: Problem with Shared Mailbox
de: Problem mit freigegebenem Postfach
sr: Проблем са заједничким поштанским сандучетом

source: *The requested user '\*' is invalid.*
de: *Der angeforderte Benutzer '\*' ist ungültig.*

source: Possible reason could be that the shared mailbox you provided is wrong. Check if the provided shared mailbox email address is correct.
de: Es könnte sein, dass das freigegebene Postfach, das Sie angegeben haben, falsch ist. Überprüfen Sie, ob die angegebene E-Mail-Adresse des freigegebenen Postfachs korrekt ist.
sr: Могући разлог је да заједничко поштанско сандуче не постоји. Проверите да ли је приложена имејл адреса заједничког поштанско сандучета исправна.

source: Header based actions in Microsoft 365 channels work in the same way as in email channels. This is why the section has been adopted verbatim from :doc:`here </channels/email/email-headers>`.
de: Header-basierte Aktionen in Microsoft 365-Kanälen funktionieren auf die gleiche Weise wie in E-Mail-Kanälen. Aus diesem Grund wurde der Abschnitt wörtlich von :doc:`hier </channels/email/email-headers>` übernommen.
sr: Радње заглавља у Microsoft 365 каналима функционишу идентично као у имејл каналима. Зато је овај чланак дословно пренешен :doc:`одавде </channels/email/email-headers>`.

source: Filters in Microsoft 365 channels work in the same way as in email channels. This is why the section has been adopted verbatim from :doc:`here </channels/email/filters>`.
de: Filter in Microsoft 365-Kanälen funktionieren genauso wie in E-Mail-Kanälen. Deshalb wurde der Abschnitt wörtlich von :doc:`hier </channels/email/filters>` übernommen.
sr: Филтери на Microsoft 365 каналима функционишу идентично филтерима у имејл каналима. Зато је овај чланак дословно пренешен :doc:`одавде </channels/email/filters>`.

source: System Filters in Microsoft 365 channels work in the same way as in email channels. This is why the section has been adopted verbatim from :doc:`here </channels/email/filters/system-filters>`.
de: Systemfilter in Microsoft 365-Kanälen funktionieren genauso wie in E-Mail-Kanälen. Aus diesem Grund wurde der Abschnitt wörtlich von :doc:`hier </channels/email/filters/system-filters>` übernommen.
sr: Системски филтери у Microsoft 365 каналима функционишу идентично системским филтерима у имејл каналима. Зато је овај чланак дословно пренешен :doc:`одавде </channels/email/filters/system-filters>`.

source: Connect a Microsoft 365 account (formerly "Office 365") via Graph API to Zammad.
de: Verbinden Sie ein Microsoft 365 Konto (früher "Office 365") über Graph API mit Zammad.
sr: Повежите Microsoft 365 налог (раније „Office 365“) преко Graph API са Zammad-ом.

source: What is the difference between the :doc:`Graph-API- </channels/microsoft365-graph/index>` and :doc:`IMAP-based M365 channel </channels/microsoft365/index>`?
de: Was ist der Unterschied zwischen dem :doc:`Graph-API- </channels/microsoft365-graph/index>` und :doc:`IMAP-basierten M365-Kanal </channels/microsoft365/index>`?
sr: Која је разлика између :doc:`М365 Graph </channels/microsoft365-graph/index>` и :doc:`М365 IMAP канала </channels/microsoft365/index>`?

source: The Graph-API variant has some advantages over the IMAP-based channel:
de: Die Graph-API-Variante hat einige Vorteile gegenüber dem IMAP-basierten Kanal:
sr: Graph варијанта има неке предности над IMAP каналом:

source: Shared mailboxes are implemented in a better way. By using them, you can save some license costs.
de: Freigegebene Postfächer sind auf eine bessere Weise implementiert. Dadurch können Sie Lizenzkosten sparen.
sr: Заједнички поштански сандучићи су имплементирани на бољи начин. Њиховим коришћењем можете уштедети на цени лиценце.

source: The selection of an inbox folder is implemented with a tree-select field in Zammad. So you can choose a folder from the fetched folder list, which is much less error-prone.
de: Die Auswahl eines Posteingangsordners ist in Zammad mit einem Baumauswahl-Feld implementiert. So können Sie einen Ordner aus der abgerufenen Ordnerliste auswählen, was wesentlich weniger fehleranfällig ist.
sr: Фолдер пријемног сандучета је имплементиран као поље вишеструког избора стабла у Zammad-у. Тако да можете изабрати фолдер из постојеће листе, што води мањем броју грешака.

source: It is the future-proof way of connecting to your M365 environment.
de: Es ist die zukunftssichere Art der Anbindung an Ihre M365-Umgebung.
sr: То начин повезивања будућности са вашим M365 окружењем.

source: It is more secure and scalable and offers a unified endpoint.
de: Sie ist sicherer und skalierbarer und bietet einen einheitlichen Endpunkt.
sr: Безбедније је, боље се скалира и пружа јединствену путању приступа.

source: So, if you are in doubt which one to use, we recommend using the Graph channel.
de: Wenn Sie sich also nicht sicher sind, welchen Kanal Sie verwenden sollen, empfehlen wir Ihnen den Graph-basierten Kanal.
sr: Уколико сте у недоумици коју врсту канала да користите, препоручујемо коришћење Graph канала.

source: Microsoft 365 channels are a specialized kind of :doc:`📨 email channel </channels/email/index>`.
de: Microsoft 365-Kanäle sind eine spezielle Art von :doc:`📨 E-Mail-Kanälen </channels/email/index>`.
sr: Microsoft 365 канали су специјализована врста :doc:`📨 имејл канала </channels/email/index>`.

source: If you're already familiar with email channels, you can skip most of this - but you should have a look at the **Accounts** section, which differs from a standard email setup.
de: Wenn Sie bereits mit E-Mail-Kanälen vertraut sind, können Sie das meiste hier überspringen - aber Sie sollten einen Blick auf den Abschnitt **Konten** werfen, der sich von einer Standard-E-Mail-Einrichtung unterscheidet.
sr: Ако сте већ упознати са имејл каналима, можете да прескочите већину овога – међутим, требало би да консултујете одељак **Налози**, која се разликује од основног тока подешавања имејл налога.

source: :doc:`🛟 Common M365 errors </channels/microsoft365/common-errors>`
de: doc:`🛟 Häufige M365-Probleme </channels/microsoft365/common-errors>`
sr: :doc:`🛟 Уобичајене М365 грешке </channels/microsoft365/common-errors>`

source: Here you can find common errors and how to fix them.
de: Hier finden Sie häufige Fehler und deren Behebung.
sr: Овде можете пронаћи уобичајене грешке и како их исправити.

source: Settings in Microsoft 365 channels work in the same way as in email channels. This is why the section has been adopted verbatim from :doc:`here </channels/email/settings>`.
de: Die Einstellungen in Microsoft 365-Kanälen funktionieren genauso wie in E-Mail-Kanälen. Deshalb wurde der Abschnitt wörtlich von :doc:`hier </channels/email/settings>` übernommen.
sr: Подешавања на Microsoft 365 каналима су идентична подешавањима у имејл каналима. Зато је овај чланак дословно пренешен :doc:`одавде </channels/email/settings>`.

source: Signatures in Microsoft 365 channels work in the same way as in email channels. This is why the section has been adopted verbatim from :doc:`here </channels/email/signatures>`.
de: Signaturen in Microsoft 365-Kanälen funktionieren genauso wie in E-Mail-Kanälen. Aus diesem Grund wurde der Abschnitt wörtlich von :doc:`hier </channels/email/signatures>` übernommen.
sr: Потписи у Microsoft 365 каналима функционишу идентично потписима у имејл каналима. Зато је овај чланак дословно пренешен :doc:`одавде </channels/email/signatures>`.

source: Use the links below to step through the process of adding an M365 IMAP channel to Zammad.
de: Verwenden Sie die nachstehenden Links, um das Hinzufügen eines M365 IMAP-Kanals zu Zammad schrittweise zu durchlaufen.
sr: Пратите линкове испод за водич кроз процес додавања M365 IMAP канала у Zammad-у.

source: Use the **Connect Microsoft 365 App** dialog to register Zammad as an OAuth app on Microsoft.
de: Verwenden Sie den **Microsoft 365 App verbinden** Dialog, um Zammad als OAuth-App in Microsoft einzurichten.
sr: Користите дијалог **Повежи Microsoft 365 апликацију** да бисте регистровали Zammad као OAuth апликацију са Microsoft.

source: This step is **required** before adding an account to Zammad.
de: Dieser Schritt ist **erforderlich**, bevor Sie ein Konto zu Zammad hinzufügen.
sr: Овај корак је **обавезан** пре додавања налога у Zammad.

source: Use the **Add Account** dialog to connect your account.
de: Benutzen Sie den **Hinzufügen** Dialog, um das Konto hinzuzufügen.
sr: Користите дијалог **Додај налог** да бисте повезали свој налог.

source: If you want to migrate an existing email channel, see next section.
de: Wenn Sie einen bestehenden E-Mail-Kanal migrieren möchten, lesen Sie den nächsten Abschnitt.
sr: Уколико желите да мигрирате постојећи имејл канал, погледајте следећи одељак.

source: Migrate your existing email channels from standard IMAP to the dedicated M365 IMAP channel in Zammad to quickly move your mailboxes. You can roll back if something goes wrong!
de: Migrieren Sie Ihre bestehenden E-Mail-Kanäle von Standard-IMAP auf den dedizierten M365-IMAP-Kanal in Zammad. Sie können die Migration rückgängig machen, wenn etwas schief geht!
sr: Мигрирајте своје постојеће имејл канале са стандардног IMAP на одговарајући M365 IMAP канал у Zammad-у за брзу измену ваших поштанских сандучића. Увек се можете вратити на старо уколико нешто пође наопако!

source: After you've :doc:`registered Zammad as an OAuth app <register-app>` in your Entra admin center, you can begin connecting Microsoft accounts to Zammad.
de: Nachdem Sie :doc:`Zammad als OAuth-App <register-app>` in Ihrem Entra Admin Center registriert haben, können Sie damit beginnen, Microsoft Konten mit Zammad zu verbinden.
sr: Након што сте :doc:`регистровали Zammad као OAuth апликацију <register-app>` у вашем Entra admin порталу, можете започети са повезивањем Microsoft налога са Zammad-ом.

source: By default, Zammad will **delete all emails** in your inbox during the import process. Use the *Keep Messages on Server* setting to :ref:`disable this behavior <microsoft365-keep-messages-on-server>`.
de: Standardmäßig **löscht Zammad alle E-Mails** in Ihrem Posteingang während des Importvorgangs. Verwenden Sie die Einstellung *Nachrichten auf dem Server behalten*, um :ref:`dieses Verhalten zu deaktivieren <microsoft365-keep-messages-on-server>`.
sr: Подразумевано, Zammad **брише све имејл поруке** из вашег сандучета приликом увоза. Користите подешавање *Чувај поруке на серверу* да бисте :ref:`онемогућили ово понашање <microsoft365-keep-messages-on-server>`.

source: Zammad will **send an auto-reply message to every email it imports** (including the old ones!). Make sure to :doc:`disable this behavior </manage/trigger>` prior adding an email account, and to turn it back on once all your messages have been imported.
de: Zammad **schickt eine automatische Eingangsbestätigung an alle Absender der importierten E-Mails** (auch alte E-Mails!). Stellen Sie sicher, dass Sie :doc:`dieses Verhalten vor dem Hinzufügen eines Kontos deaktivieren </manage/trigger>` und es wieder einschalten, sobald alle Ihre Nachrichten importiert worden sind.
sr: Zammad ће **послати аутоматки одговор на сваку имејл поруку коју увезе** (укључујући и старе!). Обавезно :doc:`онемогућите ово понашање </manage/trigger>` пре него што додате имејл налог, и укључите га поново када све ваше поруке буду увезене.

source: 🤓 **Shared mailboxes are possible...**
de: 🤓 **"Shared mailboxes" sind möglich...**
sr: 🤓 **Дељени сандучићи су могући...**

source: For this to function ensure to set a password for the account in question. You'll need these credentials to authenticate against later during adding the account.
de: Stellen Sie für den entsprechenden Account sicher, dass ein Passwort gesetzt ist. Sie benötigen die Zugangsdaten später während der Einrichtung des Kontos.
sr: Да би ово функционисало, обавезно поставите лозинку за дотични налог. Ови акредитиви ће вам бити неопходни за аутентификацију касније током додавања налога.

source: 🚛 Migrate an Existing Email Channel
de: 🚛 Umwandeln eines existierenden E-Mail-Kanals
sr: 🚛 Мигрирајте постојећи имејл канал

source: If you've already added your Microsoft 365 account as a regular email channel, you'll have to convert it to a Microsoft 365 channel eventually: Microsoft is planning to end support for simple password authentication in third-party email clients (like Zammad).
de: Sofern Sie bereits ein Microsoft-365-Konto als regulären E-Mail-Kanal eingerichtet haben, sollten Sie diesen evtl. in einen Microsoft-365-Kanal umwandeln: Microsoft plant, die einfache Passwort-Authentifizierung für E-Mail-Clients (wie Zammad) einzustellen.
sr: Ако сте већ додали свој Microsoft 365 налог као обичан имејл канал, мораћете да га мигрирате у Microsfot 365 канал: Microsoft планира да укине подршку за пријављивање текстуалном лозинком у имејл клијентима трећих лица (као што је Zammad).

source: Please refer the :doc:`migrate-from-email-channel` guide.
de: Details entnehmen Sie bitte der :doc:`migrate-from-email-channel` Anleitung.
sr: Молимо погледајте водич doc:`migrate-from-email-channel`.

source: Requesting Administrator Consent
de: Anfordern der Administrator-Einwilligung
sr: Захтевање сагласности администратора
