Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: Be aware that actions are not available for **related** context. Example: Let's assume you are working in the ticket context. While you can have customer *conditions*, you *can't adjust* objects with actions in that scope. That's because this wouldn't have any impact on the ticket dialog. Of course all ticket attributes (state, owner, ...) are available.
de: Beachten Sie, dass Aktionen für in Relation stehenden Kontext nicht verfügbar sind. Beispiel: Nehmen wir an, Sie arbeiten im Ticket-Kontext. Sie können zwar *Bedingungen* für Kunden haben, aber Sie können *keine* Objekte mit Aktionen in diesem Bereich anpassen. Das liegt daran, dass dies keinen Einfluss auf den Ticket-Dialog hat. Natürlich sind alle Ticket-Attribute (Status, Besitzer, ...) verfügbar.

source: Available Operators
de: Verfügbare Operatoren
sr: Доступни оператори

source: The availability of operators depends on the object type and scope.
de: Die Verfügbarkeit von Operatoren hängt von dem Objekt ab.
sr: Доступност оператора зависи од типа објекта и обима.

source: Please note that actions may or may not restrict API based access to attributes. We're displaying the following icons for your overview to understand these limits better:
de: Bitte beachten Sie, dass Aktionen den API-basierten Zugriff auf Attribute einschränken können, aber nicht müssen. Wir zeigen Ihnen die folgenden Symbole an, damit Sie die Einschränkungen besser verstehen:
sr: Имајте на уму да радње могу али и не морају ограничити приступ атрибутима преко API-ја. За бољи преглед, приказујемо следеће иконице да бисте боље разумели ова ограничења:

source: |api| This icon indicates the action affects the API.
de: |api| Dieses Symbol zeigt an, dass die Aktion die API betrifft.
sr: |api| Ова иконица означава да радња утиче на API.

source: |ui| This icon indicates the action only affects the web interface.
de: |ui| Dieses Symbol zeigt an, dass die Aktion nur die Weboberfläche betrifft.
sr: |ui| Ова иконица означава да радња утиче само на кориснички интерфејс.

source: show |ui|
de: anzeigen |ui|
sr: прикажи |ui|

source: Display the chosen field. Allows setting of values.
de: Zeigt das ausgewählte Feld an. Ermöglicht die Einstellung von Werten.
sr: Прикажи дотично поље. Омогућава подешавање вредности.

source: hide |ui|
de: verstecken |ui|
sr: сакриј |ui|

source: Hide the chosen field. However, it technically still allows setting the field.
de: Ausblenden des gewählten Feldes. Technisch gesehen kann das Feld aber immer noch eingestellt werden.
sr: Сакриј дотично поље. Међутим, технички и даље дозвољава подешавање вредности поља.

source: Please note that the field is **not** gone and still contains an existing value (if set)! Consider *remove* instead, if you want this field to be gone.
de: Bitte beachten Sie, dass das Feld **nicht** verschwunden ist und immer noch einen vorhandenen Wert enthält (falls gesetzt)! Ziehen Sie stattdessen *entfernen* in Betracht, wenn Sie wollen, dass dieses Feld wirklich verschwindet.
sr: Имајте на уму да поље **неће** нестати и још увек садржи вредност коју пружа! Можда бисте желели да размислите о oператору *уклони* уместо њега.

source: remove |ui|
de: entfernen |ui|
sr: уклони |ui|

source: Entirely removes the field. The field value will not be evaluated.
de: Entfernt das Feld vollständig. Der Feldwert wird nicht ausgewertet.
sr: Потпуно уклања поље. Вредност поља неће бити пружена.

source: set mandatory |ui| |api|
de: als erforderlich festlegen |ui| |api|
sr: постави обавезно |ui| |api|

source: Sets the field to mandatory.
de: Definiert das Feld als Pflichtfeld.
sr: Поставља поље на обавезно.

source: set optional |ui| |api|
de: als optional festlegen |ui| |api|
sr: постави необавезно |ui| |api|

source: Sets the field to optional.
de: Definiert das Feld als optionales Feld.
sr: Поставља поље на опционо.

source: add option |ui| |api|
de: Option hinzufügen |ui| |api|
sr: додај опцију |ui| |api|

source: Allows adding options to tree selects or selects.
de: Ermöglicht das Hinzufügen von Optionen zu Auswahlen und Baumauswahlen.
sr: Омогућава додавање опција у пољa за избор (стабла).

source: You have to use the "remove option" before performing this action. It allows you to use *existing* configured values.
de: Bevor Sie diese Aktion durchführen, müssen Sie die Option "Entfernen" verwenden. Im Anschluss können Sie damit *vorhandene* konfigurierte Werte verwenden.
sr: Ово захтева да се опције претходно сакрију (уклони опцију). Омогућава коришћење *постојећих* вредности.

source: remove option |ui| |api|
de: Option entfernen |ui| |api|
sr: уклони опцију |ui| |api|

source: Allows removing options from tree selects or selects. It allows you to use *existing* configured values.
de: Ermöglicht das Entfernen von Optionen aus Baumauswahl oder Auswahl-Feldern. Damit können Sie *vorhandene* konfigurierte Werte verwenden.
sr: Омогућава уклањање опција из поља једноструког и вишеструког избора. Омогућава коришћење *постојећих* вредности.

source: set fixed to |ui| |api|
de: fest eingestellt auf |ui| |api|
sr: постави на вредност |ui| |api|

source: Reduces the available options by your selection.
de: Reduziert die verfügbaren Optionen um Ihre Auswahl.
sr: Ограничава доступне опције по вашем избору.

source: This reduces your workflows in terms of *add option* and *remove option*.
de: Dies reduziert Ihre Workflows bzgl. *Option hinzufügen* und *Option entfernen*.
sr: Ово може смањити број ваших радних токова који користе *додај опцију* и *уклони опцију*.

source: fill in |ui|
de: befüllen mit |ui|
sr: попуни |ui|

source: Allows filling in of string and integer fields with your values.
de: Ermöglicht die Befüllung von Text- und Zahlen-Feldern mit einem Wert.
sr: Омогућава попуњавање поља текста и целобројних поља са вашим вредностима.

source: fill in empty |ui|
de: befüllen mit (wenn leer) |ui|
sr: попуни празно |ui|

source: Allows filling in of string and integer fields with your values **if the field is empty**.
de: Ermöglicht die Befüllung von Text- und Zahlen-Feldern mit einem Wert **wenn das Feld leer ist**.
sr: Омогућава попуњавање поља текста и целобројних поља са вашим вредностима **ако су поља празна**.

source: select |ui|
de: auswählen |ui|
sr: изабери |ui|

source: Select a specific value within a select, tree select or boolean field.
de: Wählen Sie einen bestimmten Wert innerhalb eines Auswahl-, Baumauswahl- oder Boolean-Feldes aus.
sr: Изабери одређену вредност унутар поља за избор, избор стабла или логичког поља.

source: auto select |ui|
de: automatisch auswählen |ui|
sr: аутоматски избор |ui|

source: Helps users with tree select and select fields:
de: Hilft den Benutzern bei Baumauswahl- und Auswahlfeldern:
sr: Помаже кориснику са пољима избора (стабла):

source: If the field has only one option available for selection and no value yet, the value will be automatically set.
de: Wenn für das Feld nur eine Option zur Auswahl steht und noch kein Wert vorhanden ist, wird der Wert automatisch gesetzt.
sr: Ако поље има само једну опцију за избор и још увек нема вредност, вредност се аутоматски поставља.

source: This option only works if you have one value and doesn't work if there is more than one option available.
de: Diese Option funktioniert nur, wenn Sie genau einen Wert haben. Sie funktioniert nicht, wenn mehr als eine Option verfügbar ist.
sr: Овај оператор функционише само ако имате једну вредност и не делује ако има више од једне опције.

source: set readonly |ui|
de: als schreibgeschützt festlegen |ui|
sr: укључи само за преглед |ui|

source: Allows you to display an attribute as read only (which means no changes are possible).
de: Ermöglicht die schreibgeschützte Anzeige eines Attributs (was bedeutet, dass keine Änderungen möglich sind).
sr: Омогућава вам да прикажете атрибут само за читање (readonly), што значи да измене неће бити могуће.

source: unset readonly |ui|
de: als änderbar festlegen |ui|
sr: искључи само за преглед |ui|

source: In case a workflow set the field in question to read only, you can undo this with option above.
de: Falls ein Workflow das betreffende Feld auf schreibgeschützt gesetzt hat, können Sie dies mit der obigen Option rückgängig machen.
sr: У случају да је радни ток поставио поље на само за преглед (readonly), ово можете поништити уз помоћ горњег оператора.

source: Stop after match
de: Nach Treffer stoppen
sr: Заустави после поклапања

source: Decide if other workflows are executed after the current one.
de: Entscheiden Sie, ob andere Workflows nach dem aktuellen ausgeführt werden.

source: If set to ``no`` (default), further workflows will be executed if they match the condition. In this case, it is possible that your actions from the current workflow can be overwritten by another workflow. If set to ``yes``, no further workflows will be executed after the current one.
de: Bei der Einstellung ``Nein`` (Standard) werden weitere Workflows ausgeführt, wenn deren Bedingung zutreffen. In diesem Fall ist es möglich, dass Ihre Aktionen aus dem aktuellen Workflow von einem anderen Workflow überschrieben werden. Wenn Sie ``Ja`` wählen, werden nach dem aktuellen Workflow keine weiteren Workflows ausgeführt.

source: Priority
de: Priorität
sr: Приоритет

source: You can define the sequence of execution of the workflows by settings a numeric value. The execution runs in ascending order. That means lower values (e.g. ``100``) are executed before higher ones (e.g. ``999``).
de: Sie können die Reihenfolge der Workflow-Ausführung durch das Anpassen eines numerischen Wertes festlegen. Die Ausführung erfolgt in aufsteigender Reihenfolge. Das heißt niedrigere Werte (z.B. ``100``) werden vor höheren (z.B. ``999``) ausgeführt.

source: The default value is ``500``.
de: Der Standardwert ist ``500``.

source: Learn by Example
de: Lernen Sie anhand von Beispielen
sr: Учите на примеру

source: This page showcases some examples for core workflows. To learn about core workflows in detail, first go to :doc:`how-do-they-work`.
de: Auf dieser Seite werden einige Beispiele für Core Workflows vorgestellt. Um mehr über Core Workflows im Detail zu erfahren, schauen Sie sich zuerst :doc:`how-do-they-work` an.

source: All core workflow examples below are configured in the same system. Compared to a fresh installation of Zammad, the system has some additional groups and some custom object attributes you can find in the respective examples. See these examples as inspiration and adapt the workflows to your processes.
de: Alle unten aufgeführten Core Workflow-Beispiele sind im gleichen System konfiguriert. Im Vergleich zu einer Neuinstallation von Zammad verfügt das System über einige zusätzliche Gruppen und einige benutzerdefinierte Objektattribute, die Sie in den jeweiligen Beispielen finden. Betrachten Sie diese Beispiele als Inspiration und passen Sie die Arbeitsabläufe an Ihre Prozesse an.

source: Group Based Fields
de: Gruppenabhängige Felder

source: Often, different teams (like sales, support, or 2nd level) need slightly different workflows to handle tickets effectively. Group-based workflows allow you to customize the ticket experience by defining the fields displayed, the required input and the available options based on the group assigned to the ticket.
de: Oft haben verschiedene Teams (wie Vertrieb, Support oder 2nd Level) leicht unterschiedliche Prozesse, um Tickets effektiv zu bearbeiten. Mit gruppenbasierten Workflows können Sie das Handling eines Tickets anpassen, indem Sie die angezeigten Felder, die erforderlichen Eingaben und die verfügbaren Optionen auf der Grundlage der zugewiesenen Gruppe definieren.

source: Problem/scenario
de: Problem/Szenario

source: When a ticket is created in or moved to the ``2nd Level`` group, the category field must be limited, some fields have to be shown and specific fields are mandatory to have all relevant information for the 2nd level support present in the ticket.
de: Wenn ein Ticket in der Gruppe ``2nd Level`` erstellt oder in diese verschoben wird, muss das Kategoriefeld eingeschränkt werden, einige Felder müssen angezeigt werden und bestimmte Felder sind Pflichtfelder, damit alle relevanten Informationen für den 2nd Level Support im Ticket vorhanden sind.

source: Workflow configuration
de: Workflow-Konfiguration

source: Area
de: Bereich

source: Selected conditions
de: Ausgewählte Bedingungen

source: **Group** *is* ``2nd Level``
de: **Gruppe** *ist* ``2nd Level``

source: Saved conditions
de: Gespeicherte Bedingungen

source: Not used because the UI has to change
de: Nicht verwendet, da es um ungespeicherte Änderungen in der UI geht

source: immediately when the group is set to 2nd Level.
de: sofort, wenn die Gruppe auf 2nd Level gesetzt wird.

source: **Category** *show*
de: **Category** *anzeigen*

source: **Category** *set fixed to* ``2nd Level`` (and all sub categories)
de: **Category** *fest eingestellt auf* ``2nd Level`` (und alle Unterkategorien)

source: **Operating System** and **Software used** *show*
de: **Operating System** und **Software used** *anzeigen*

source: **Operating System** and **Software used** *set mandatory*
de: **Operating System** und **Software used** *als erforderlich festlegen*

source: Configuration in UI
de: Konfiguration in der UI

source: Sample workflow that shows specific values and fields for 2nd level
de: Beispiel-Workflow, der bestimmte Werte und Felder für 2nd Level zeigt
sr: Пример радног тока који приказује одређене вредности и поља за 2nd Level

source: Approval Process
de: Freigabeprozess

source: In many organizations, an approval is required to initiate subsequent processes. This approval is usually limited to a specific group of people to ensure that all requirements for the subsequent process are fulfilled.
de: In vielen Organisationen ist eine Freigabe erforderlich, um nachfolgende Prozesse in Gang zu setzen. Diese Freigabe ist in der Regel auf eine bestimmte Gruppe von Personen beschränkt, um sicherzustellen, dass alle Anforderungen für den nachfolgenden Prozess erfüllt sind.

source: The approval of a customer issue can only be done by users with the role ``Approval Person``. As long as this approval has not been done, the value must be set fixed to ``no``, unless the approval person views the ticket.
de: Die Freigabe eines Kundenanliegens kann nur von Benutzern mit der Rolle ``Approval Person`` durchgeführt werden. Solange diese Freigabe nicht erfolgt ist, muss der Wert fest auf ``Nein`` gesetzt werden, es sei denn, die genehmigende Person sieht das Ticket an.

source: Based on the approval state, additional automation processes can be established (e.g. a trigger to raise the priority or assign a specific agent).
de: Auf der Grundlage des Freigabestatus können zusätzliche Automatisierungsprozesse eingerichtet werden (z.B. ein Trigger zur Erhöhung der Priorität oder zur Zuweisung eines bestimmten Agenten).

source: **Role** *is not* ``Approval Person``
de: **Rolle** *ist nicht* ``Approval Person``

source: Checks if role is not ``Approval Person`` for unsaved
de: Prüft, ob die Rolle nicht ``Approval Person`` für ungespeicherte

source: changes in the ticket.
de: Änderungen im Ticket ist.

source: **Approved** *is not* ``yes``
de: **Approved** *ist nicht* ``yes``

source: Checks if the approval is not yet set to ``yes``.
de: Prüft, ob die Freigabe noch nicht auf ``yes`` gesetzt ist.

source: **Approved** *set fixed to* ``no``
de: **Approved** *fest eingestellt auf* ``no``

source: Prevents changes when above conditions are met.
de: Verhindert Änderungen, wenn die oben genannten Bedingungen erfüllt sind.

source: Sample workflow that restricts an approval attribute to specific roles
de: Beispiel-Workflow, der den Genehmigungs-Status auf bestimmte Rollen einschränkt
sr: Пример радног тока који ограничава атрибут Approval на одређене улоге

source: Enforcing Ticket Categorization
de: Erzwingen der Ticket-Kategorisierung

source: To have convincing numbers for your statistic, it can be a good idea to enforce certain attributes to be populated before the ticket can be closed.
de: Um aussagekräftige Zahlen für Ihre Statistik zu erhalten, kann es Sinn machen, bestimmte Attribute zu erzwingen, die vor dem Schließen des Tickets ausgefüllt werden müssen.

source: The ``Category`` field must be set to mandatory if an agent wants to set the states ``closed`` or ``pending close`` to enforce categorization.
de: Das Feld ``Category`` muss zum Pflichtfeld werden, wenn ein Agent den Status ``geschlossen`` oder ``auf Schließen warten`` setzen will, um eine Kategorisierung zu erzwingen.

source: **State** *is* ``closed`` or ``pending close``
de: **Status** *ist* ``geschlossen`` oder ``warten auf Schließen``

source: Selected condition because it has to be
de: Ausgewählte Bedingung, weil sie vor dem Speichern

source: checked before changes are saved.
de: geprüft werden muss.

source: **Category** *set mandatory*
de: **Category** *als erforderlich festlegen*

source: Sample workflow that sets fields to mandatory on specific states
de: Beispiel-Workflow, der Felder abhängig vom Ticketstatus als Pflichtfeld definiert
sr: Пример радног тока који поставља поља на обавезна за одређена стања

source: Ticket Handover Process
de: Ticket-Übergabe-Prozess

source: A handover from one agent to another might require more than just a change of the owner. Depending on the issue or process, it can be very helpful that the original agent leaves a small note so the new agent knows immediately what's the reason for the handover and where to start.
de: Eine Übergabe von einem Agenten an einen anderen kann mehr erfordern als nur einen Wechsel des Besitzers. Je nach Thema oder Prozess kann es sehr hilfreich sein, wenn der ursprüngliche Agent eine kleine Notiz hinterlässt, damit der neue Agent sofort weiß, was der Grund für die Übergabe ist und wo das Problem liegt.

source: Agents must write a small comment when they want to change the ticket owner. There is a custom ticket attribute called ``Handover`` where a text can be inserted. This field is hidden by default (Workflow 1) and only shows up when the owner changes. Additionally, it must be set to mandatory in such a case (Workflow 2).
de: Agenten müssen einen kleinen Kommentar schreiben, wenn sie den Besitzer des Tickets ändern wollen. Es gibt ein benutzerdefiniertes Ticket-Attribut namens ``Handover``, in das ein Text eingefügt werden kann. Dieses Feld ist standardmäßig ausgeblendet (Workflow 1) und wird nur angezeigt, wenn sich der Besitzer ändert. Außerdem muss es in einem solchen Fall auf obligatorisch gesetzt werden (Workflow 2).

source: Because the field is hidden after saving the change of the ticket owner, the text of the field has to be written to the ticket as an article by a trigger. Otherwise, the new agent would not see it at all.
de: Da das Feld nach dem Speichern der Änderung des Besitzers des Tickets ausgeblendet wird, muss der Text des Feldes durch einen Trigger als Artikel in das Ticket geschrieben werden. Andernfalls würde der neue Agent es gar nicht sehen.

source: This workflow hides the field in general. Please note the lower priority which tells Zammad to execute this workflow first.
de: Dieser Workflow blendet das Feld grundsätzlich aus. Bitte beachten Sie die niedrigere Priorität, weshalb Zammad diesen Workflow zuerst ausführt.

source: No condition needed, because it should
de: Keine Bedingung erforderlich, denn es sollte

source: always be hidden.
de: immer ausgeblendet sein.

source: **Handover** *hide*
de: **Handover** *verstecken*

source: This workflow shows the field and sets it as mandatory when another ticket owner is selected. This workflow has the default priority so it runs after Workflow 1.
de: Dieser Workflow zeigt das Feld an und legt es als Pflichtfeld fest, wenn ein anderer Besitzer des Tickets ausgewählt wird. Dieser Workflow hat die Standardpriorität, d.h. er läuft nach Workflow 1.

source: **Owner** *is modified*
de: **Besitzer** *ist verändert*

source: **Handover** *show*
de: **Handover** *anzeigen*

source: **Handover** *set mandatory*
de: **Handover** *als erforderlich festlegen*

source: As mentioned above, the content of the field has to be written as a ticket article by a trigger. An example configuration of such a trigger could look like this:
de: Wie bereits erwähnt muss der Inhalt des Feldes durch einen Trigger als Ticket-Artikel geschrieben werden. Eine Beispielkonfiguration eines solchen Triggers könnte wie folgt aussehen:

source: Condition: **Handover** *has changed*
de: Bedingung: **Handover** *wurde verändert*

source: Action: **Article** > **Note** with variable ``#{ticket.handover}`` in body
de: Aktion: **Artikel** > **Notiz** mit Variable ``#{ticket.handover}`` im Body

source: Hiding the handover field in core workflows
de: Ausblenden des Handover-Felds in Core Workflows
sr: Скривање поља за примопредају у радним токовима

source: Showing the handover field and set it as mandatory
de: Das Handover-Feld anzeigen und als Pflichtfeld festlegen
sr: Приказ поља за примопредају и постављање на обавезно

source: Write the content of the handover field to an article by a trigger
de: Schreiben des Handover-Feld-Inhalts in einen Artikel durch einen Trigger

source: As a result, the ticket includes an article of the type note which includes the predefined text and the handover comment.
de: Als Ergebnis enthält das Ticket einen Artikel vom Typ Notiz, der den vordefinierten Text und den Inhalt des Handover-Felds enthält.
sr: Као резултат, тикет сада укључује чланак напомене који садржи предефинисани текст и коментар примопредаје.

source: Core workflow changes are checked by the application server
de: Änderungen durch Core Workflows werden vom Anwendungsserver überprüft

source: All changes to attributes are checked by the application server. This can have a performance impact on instances with many core workflows and/or high load.
de: Alle Änderungen an Attributen werden vom Anwendungsserver geprüft. Dies kann sich bei Instanzen mit vielen Core Workflows und/oder hoher Last auf die Leistung auswirken.

source: Core workflows do not replace triggers
de: Core Workflows ersetzen keine Trigger

source: Workflows manipulate the behavior of fields. However, they do not set values in fields because of actions.
de: Workflows verändern Felder und deren Verhalten. Sie setzen jedoch keine Werte in Felder aufgrund von Aktionen.
sr: Радни токови манипулишу понашање поља. Међутим, они не постављају вредности у поља због радњи.

source: API calls are only partly affected
de: API-Calls sind nur teilweise betroffen
sr: API позиви су само делимично захваћени

source: Some options affect UI only and thus do not restrict responses and calls.
de: Einige Optionen wirken sich nur auf die Benutzeroberfläche aus und schränken daher API requests und responses nicht ein.
sr: Неке опције утичу само на кориснички интерфејс и стога не ограничавају API захтеве.

source: This affects the following actions:
de: Das betrifft die folgenden Aktionen:
sr: Ово утиче на следеће радње:

source: select
de: auswählen
sr: изабери

source: auto select
de: automatisch auswählen
sr: аутоматски избор

source: show
de: anzeigen
sr: прикажи

source: hide
de: verstecken
sr: сакриј

source: Some fields stay unavailable to customers
de: Einige Felder bleiben für Kunden unzugänglich
sr: Нека поља остају недоступна клијентима
