Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: On **self-hosted instances**, we still don't recommend it. Using a Gmail account for automated, outgoing messages is risky: users who exceed Google's `email sending limits <https://support.google.com/a/answer/166852>`_ can have their accounts suspended.
de: Auch für **selbst gehostete** Zammad-Instanzen empfehlen wir das nicht. Ein Gmail-Konto für automatische ausgehende E-Mail zu verwenden ist riskant: Usern, die Googles `E-Mail Versandlimit <https://support.google.com/a/answer/166852>`_ überschreiten, kann der Account deaktiviert werden.
sr: На **инстанцама које хостујете сами**, то и даље не препоручујемо. Коришћење Gmail налога за аутоматизоване, одлазне поруке је ризично: корисницима који прекораче Google `ограничења за слање е-поште <https://support.google.com/a/answer/166852>`_ могу бити суспендовани налози.

source: Set up a generic :doc:`email channel </channels/email/index>` instead and use the :ref:`Email Notification <email-notification>` setting.
de: Richten Sie stattdessen einen allgemeinen :doc:`E-Mail Kanal </channels/email/index>` ein und benutzen Sie die Einstellungen für die :ref:`E-Mail Benachrichtigung <email-notification>`.
sr: Уместо тога, подесите генерички :doc:`имејл канал </channels/email/index>` и користите подешавање :ref:`имејл обавештења <email-notification>`.

source: I successfully added my account, but Zammad isn't fetching new emails
de: Ich habe mein Konto erfolgreich hinzugefügt, aber Zammad holt keine neuen E-Mails ab
sr: Успешно сам додао свој налог, али Zammad не преузима нову пошту

source: If you specified a :ref:`custom folder/label to fetch from <google-folder>`, are you sure incoming mail is arriving in that folder?
de: Falls Sie einen :ref:` speziellen Ordner oder ein spezielles Label <google-folder>` angegeben haben, stellen Sie bitte sicher, dass E-Mails auch dort ankommen.
sr: Ако сте навели :ref:`прилагођен фолдер/ознаку за преузимање <google-folder>`, да ли сте сигурни да долазна пошта стиже у тај фолдер?

source: Header based actions in Google channels work in the same way as in email channels. This is why the section has been adopted verbatim from :doc:`here </channels/email/email-headers>`.
de: Header-basierte Aktionen in Google-Kanälen funktionieren auf die gleiche Weise wie in E-Mail-Kanälen. Deshalb wurde der Abschnitt wortwörtlich von :doc:`hier </channels/email/email-headers>` übernommen.
sr: Радње заглавља у Google каналима функционишу идентично као у имејл каналима. Зато је овај чланак дословно пренешен :doc:`одавде </channels/email/email-headers>`.

source: Filters in Google channels work in the same way as filters in email channels. This is why the section has been adopted verbatim from :doc:`here </channels/email/filters>`.
de: Filter in Google-Kanälen funktionieren auf die gleiche Weise wie Filter in E-Mail-Kanälen. Deshalb wurde der Abschnitt wörtlich von :doc:`hier </channels/email/filters>` übernommen.
sr: Филтери у Google каналима функционишу идентично као филтери у имејл каналима. Зато је овај чланак дословно пренешен :doc:`одавде </channels/email/filters>`.

source: System Filters in Google channels work in the same way as in email channels. This is why the section has been adopted verbatim from :doc:`here </channels/email/filters/system-filters>`.
de: Systemfilter in Google-Kanälen funktionieren auf die gleiche Weise wie in E-Mail-Kanälen. Deshalb wurde der Abschnitt wörtlich von :doc:`hier </channels/email/filters/system-filters>` übernommen.
sr: Системски филтери у Google каналима функционишу идентично системским филтерима у имејл каналима. Зато је овај чланак дословно пренешен :doc:`одавде </channels/email/filters/system-filters>`.

source: Connect a Google Email account to Zammad.
de: Verbinden Sie ein Google E-Mail Konto mit Zammad.
sr: Повежите Google имејл налог са Zammad-ом.

source: Google channel settings panel
de: Einstellungsbereich für Google-Kanal
sr: Панел са подешавањима Google канала

source: Google channels are a specialized kind of :doc:`📨 email channel </channels/email/index>`.
de: Google-Kanäle sind eine spezielle Art von :doc:`📨 E-Mail-Kanälen </channels/email/index>`.
sr: Google канали су специјализована врста :doc:`📨 имејл канала </channels/email/index>`.

source: If you're already familiar with email channels, you can skip most of this. However, you should have a look at the :doc:`./basic-setup` to get started.
de: Wenn Sie bereits mit E-Mail-Kanälen vertraut sind, können Sie das meiste hier überspringen. Sie sollten jedoch einen Blick auf das :doc:`./basic-setup` werfen, um loszulegen.
sr: Ако сте већ упознати са имејл каналима, можете да прескочите већину овога. Међутим, требало би да консултујете :doc:`основна подешавања <./basic-setup>` за прве кораке.

source: Connect Zammad to Google and add an account to fetch emails from.
de: Verbinden Sie Zammad mit Google und fügen Sie ein Konto hinzu, von dem Sie E-Mails abrufen möchten.
sr: Повежите Zammad са Google-ом и додајте налог за допремање имејл порука.

source: Self-hosted users may have already completed this step during new system setup.
de: Nutzer einer selbst gehosteten Instanz haben diese Schritte vermutlich bereits während der Einrichtung gemacht.
sr: Корисници који сами хостују су можда већ обавили овај корак током подешавања новог система.

source: :doc:`Filters <filters>`
de: :doc:`Filter <filters>`
sr: :doc:`Филтери <filters>`

source: Make sure new tickets show up in the right place with automated, if-this-then-that rules for all incoming email.
de: Richten Sie Automatisierungen mit Wenn-Dann-Regeln ein und stellen damit sicher, dass neue Tickets an die richtige Stelle gelangen.
sr: Уверите се да се нови тикети појављују на правом месту са аутоматским правилима ако-ово-онда-оно за сву долазну пошту.

source: :doc:`Signatures <signatures>`
de: :doc:`Signaturen <signatures>`
sr: :doc:`Потписи <signatures>`

source: Customize signatures for all outgoing emails.
de: Anpassung von Signaturen für alle ausgehenden E-Mails.
sr: Прилагодите потписе за сву одлазну пошту.

source: :doc:`Settings <settings>`
de: :doc:`Einstellungen <settings>`
sr: :doc:`Подешавања <settings>`

source: modify subject-line prefixes (e.g. use “AW:” instead of "RE:"")
de: passen Sie den Präfix im Betreff an (z.B. ""AW:" anstatt "RE:")
sr: измена префикса наслова (нпр. коришћење „AW:“ уместо „RE:“)

source: :doc:`Header based actions <email-headers>`
de: :doc:`Header-basierte Aktionen <email-headers>`
sr: :doc:`Радње заглавља <email-headers>`

source: Settings in Google channels work in the same way as in email channels. This is why the section has been adopted verbatim from :doc:`here </channels/email/settings>`.
de: Die Einstellungen in Google-Kanälen funktionieren auf die gleiche Weise wie in E-Mail-Kanälen. Deshalb wurde der Abschnitt wörtlich von :doc:`hier </channels/email/settings>` übernommen.
sr: Подешавања у Google каналима су идентична подешавањима у имејл каналима. Зато је овај чланак дословно пренешен :doc:`одавде </channels/email/settings>`.

source: Signatures in Google channels work in the same way as in email channels. This is why the section has been adopted verbatim from :doc:`here </channels/email/signatures>`.
de: Signaturen in Google-Kanälen funktionieren auf die gleiche Weise wie in E-Mail-Kanälen. Deshalb wurde der Abschnitt wörtlich von :doc:`hier </channels/email/signatures>` übernommen.
sr: Потписи у Google каналима функционишу идентично потписима у имејл каналима. Зато је овај чланак дословно пренешен :doc:`одавде </channels/email/signatures>`.

source: You can connect to user and shared mailboxes in your M365 environment. Follow the steps below and skip not applicable parts.
de: Sie können eine Verbindung zu Benutzer- und geteilten Postfächern in Ihrer M365-Umgebung herstellen. Führen Sie die folgenden Schritte aus und überspringen Sie nicht zutreffende Teile.
sr: Можете повезати корисничке и заједничке поштанске сандучиће из вашег M365 окружења. Пратите кораке испод и прескочите делове који се не односе на вас.

source: Switching from M365 IMAP to M365 Graph? Make sure you don't use email aliases, Microsoft doesn't support this via Graph.
de: Wechseln Sie von M365 IMAP zu M365 Graph? Stellen Sie sicher, dass Sie keine E-Mail-Aliasse verwenden, da Microsoft dies über Graph nicht unterstützt.
sr: Прелазите са M365 IMAP на М365 Graph? Обратите пажњу да Microsoft не подржава имејл псеудониме у Graph контексту.

source: In case you are using email aliases, you could create a shared mailbox for each alias to solve this problem.
de: Falls Sie E-Mail-Aliasse verwenden, können Sie für jeden Alias ein freigegebenes Postfach einrichten, um dieses Problem zu lösen.
sr: Уколико користите имејл псеудониме, можете креирати заједничко поштанско сандуче за сваки алиас да бисте решили овај проблем.

source: First Steps
de: Erste Schritte
sr: Први кораци

source: Check your FQDN under *Settings > System > Fully Qualified Domain Name* in the admin interface of Zammad. If it is not correct, change it now. Otherwise the setup of the channel will fail.
de: Überprüfen Sie Ihren FQDN unter *Einstellungen > System > Vollqualifizierter Domainname* in der Verwaltungsoberfläche von Zammad. Wenn er nicht korrekt ist, ändern Sie ihn jetzt. Andernfalls wird die Einrichtung des Kanals fehlschlagen.
sr: Проверите ваш FQDN у *Подешавања > Систем > Квалификовани назив домена* у Zammad интерфејсу администратора. Уколико није исправан, промените га сад. У супротном поставка канала неће успети.

source: Go to *Channels > Microsoft 365 Graph Email* and click on **Connect Microsoft 365 App**. Copy the provided callback URL.
de: Gehen Sie zu *Kanäle > Microsoft 365 Graph E-Mail* und klicken Sie auf **Microsoft 365 App verbinden**. Kopieren Sie die angezeigte Callback-URL.
sr: Идите на *Канали > Microsoft 365 Graph имејл* и кликните на **Повежи Microsoft 365 апликацију**. Ископирајте наведени URL повратног позива.

source: Go to Microsoft's `Entra admin center <https://entra.microsoft.com/#home>`_ and log in as an administrator (at least application administrator permission is required).
de: Gehen Sie zu Microsofts `Entra Admin Center <https://entra.microsoft.com/#home>`_ und melden Sie sich als Administrator an (mindestens die Berechtigung als Anwendungsadministrator ist erforderlich).
sr: Идите на Microsoft `Entra admin center <https://entra.microsoft.com/#home>`_ и пријавите се као администратор (или са одговарајућим дозволама администратора апликација).

source: Create App
de: App erstellen

source: Screenshot shows Entra admin center with application registration screen.
de: Der Screenshot zeigt das Entra Admin Center mit der Ansicht für die App-Registrierung.
sr: Снимак екрана који Entra admin center са страницом регистрације апликација.

source: Create a new app by going to *Applications > App registrations* and select **New registration**.
de: Erstellen Sie eine neue App, indem Sie zu *Anwendungen > App-Registrierungen* gehen und **Neue Registrierung** wählen.
sr: Креирајте нову апликацију преко *Applications > App registrations* и одаберите **New registration**.

source: Enter a fitting name and select an account type. Supported types are:
de: Geben Sie einen passenden Namen ein und wählen Sie einen Kontotyp. Unterstützte Typen sind:
sr: Унесите одговарајући назив и изаберите врсту налога. Подржане врсте су:

source: Accounts in this organizational directory only (Single tenant)
de: Nur Konten in diesem Organisationsverzeichnis (einzelner Mandant)
sr: Налози само у овом организационом директоријуму (један корисник)

source: Accounts in any organizational directory (Multitenant)
de: Konten in einem beliebigen Organisationsverzeichnis (mandantenfähig)
sr: Налози у било ком организационом директоријуму (више корисника)

source: Under "Redirect URI", select "Web" as platform and paste your already copied callback URL from Zammad.
de: Wählen Sie unter "Redirect URI" die Plattform "Web" und fügen Sie die bereits kopierte Callback URL von Zammad ein.
sr: Под „Redirect URI” одаберите „Web” као платформу и налепите ваш већ ископирани URL повратног позива.

source: Click on **Register**.
de: Klicken Sie auf **Registrieren**.
sr: Кликните на **Register**.

source: Screenshot shows Entra admin center with application overview screen.
de: Der Screenshot zeigt das Entra Admin Center mit der Übersicht der Anwendungen.
sr: Снимак екрана који приказује Entra admin center са прегледом апликација.

source: In the overview screen, copy the "Application (client) ID", switch to Zammad and paste it in the "Client ID" field in the pop up.
de: Kopieren Sie in der Übersichtsansicht die "Anwendungs ID (Client)", wechseln Sie zu Zammad und fügen Sie sie in das Feld "Client-ID" im Pop-up ein.
sr: Из прегледа ископирајте „Application (client) ID”, пребаците се у Zammad и налепите га у поље „Клијент ID” у дијалогу.

source: Only required for single tenant setup: copy the "Directory (tenant) ID" and paste it in the "Tenant UUID/Name" field in Zammad.
de: Nur für die Einrichtung eines einzelnen Mandanten erforderlich: Kopieren Sie die "Verzeichnis-ID (Mandant)" und fügen Sie sie in das Feld "Verzeichnis-UUID/Name (Mandant)" in Zammad ein.
sr: Обавезно само за поставку са једним корисником: ископирајте „Directory (tenant) ID” и налепите га у „UUID/назив корисника апликације” поље у Zammad-у.

source: Create Secret
de: Geheimnis erstellen
sr: Креирајте шифру

source: Screenshot shows Entra admin center with client secret screen.
de: Der Screenshot zeigt das Entra Admin Center mit der Ansicht "Geheime Clientschlüssel".
sr: Снимак екрана који приказује Entra admin center са клијентском шифром.

source: In Entra, go to "Certificates & secrets" and add a secret by clicking the **New client secret** button.
de: Gehen Sie in Entra zu "Zertifikate & Geheimnisse" und fügen Sie einen geheimen Client-Schlüssel hinzu, indem Sie auf die Schaltfläche **Neuer geheimer Clientschlüssel** klicken.
sr: У Entra-и, идите на „Certificates & secrets” и додајте шифру кликом на дугме **New client secret**.

source: Enter a description, set an expiry duration and click **Add**.
de: Geben Sie eine Beschreibung ein, legen Sie eine Gültigkeitsdauer fest und klicken Sie auf **Hinzufügen**.
sr: Унесите опис, одаберите истек и кликните на **Add**.

source: Copy the string under "Value" (not the "Secret ID"!), this is the secret. Paste it to Zammad in the "Client Secret" field.
de: Kopieren Sie die Zeichenkette unter "Value" (nicht die "Secret ID"!), das ist das Secret.. Fügen Sie es bei Zammad in das Feld "Client-Secret" ein.
sr: Ископирајте низ текста под „Value” (не под „Secret ID”!), ово је ваша шифра. Налепите је у Zammad-у у поље „Клијентска шифра”.

source: Configure API Permissions
de: API-Berechtigungen konfigurieren
sr: Подешавање API дозвола

source: Screenshot shows Entra admin center with api permission screen.
de: Der Screenshot zeigt das Entra Admin Center mit der Ansicht für die API-Berechtigungen.
sr: Снимак екрана приказује Entra admin center са API дозволама.

source: Go to "API permissions" and **Add a permission**.
de: Gehen Sie zu "API-Berechtigungen" und wählen Sie **Berechtigung hinzufügen**.
sr: Идите на „API permissions” и кликните на **Add a permission**.

source: Select "Microsoft Graph" and "Delegated permissions".
de: Wählen Sie "Microsoft Graph" und "Delegierte Berechtigungen".
sr: Одаберите „Microsoft Graph” и „Delegated permissions”.

source: Add the following permissions:
de: Fügen Sie die folgenden Berechtigungen hinzu:
sr: Додајте следеће дозволе:

source: Save it by clicking the **Add permissions** button.
de: Speichern Sie sie, indem Sie auf die Schaltfläche **Berechtigungen hinzufügen** klicken.
sr: Снимите их кликом на дугме **Add permissions**.

source: Additional Steps for Shared Mailboxes
de: Zusätzliche Schritte für freigegebene Postfächer
sr: Додатни кораци за заједничке поштанске сандучиће

source: If you want to fetch email from a shared mailbox, you have to perform additional steps:
de: Wenn Sie E-Mails aus einem freigegebenen Postfach abrufen möchten, müssen Sie zusätzliche Schritte durchführen:
sr: Уколико желите да преузимате имејл из заједничког поштанског сандучића, морате да обавите додатне кораке:

source: Log in to the `Exchange admin center <https://admin.exchange.microsoft.com>`_.
de: Melden Sie sich beim `Exchange Admin Center <https://admin.exchange.microsoft.com>`_ an.
sr: Пријавите се у `Exchange admin center <https://admin.exchange.microsoft.com>`_.

source: Go to *Recipients > Mailboxes*, select the mailbox and click on **Mailboxes delegation**.
de: Gehen Sie zu *Recipients > Mailboxes*, wählen Sie das Postfach aus und klicken Sie auf **Mailbox delegation**.
sr: Идите на *Recipients > Mailboxes*, одаберите сандуче и кликните на **Mailboxes delegation**.

source: Under "Send as", click on **Edit** and **Add members**. Search and select the user from which you want to access the mailbox and **Save** it.
de: Klicken Sie unter "Send as" auf **Edit** und **Add members**. Suchen und wählen Sie den Benutzer, von dem aus Sie auf die Mailbox zugreifen möchten, und wählen Sie **Save**.
sr: Под „Send as”, кликните на **Edit** и **Add members**. Претражите и одаберите корисника под којим желите да приступите сандучету и кликните на **Save** .

source: Do the same for "Read and manage (Full Access)".
de: Machen Sie dasselbe für "Read and manage (Full Access)".
sr: Одрадите исте кораке за „Read and manage (Full Access)”.

source: Configure the Channel in Zammad
de: Konfigurieren Sie den Kanal in Zammad
sr: Подешавање канала у Zammad-у

source: App Configuration
de: App Konfiguration
sr: Подешавање апликације

source: Screenshot shows Zammad's app configuration dialog.
de: Der Screenshot zeigt den Konfigurationsdialog in Zammad.
sr: Снимак екрана који приказује Zammad дијалог подешавања апликације.

source: If you followed this guide, you already should have pasted your app information. If not, here is a short summary:
de: Wenn Sie diese Anleitung befolgt haben, sollten Sie Ihre App-Informationen bereits eingefügt haben. Falls nicht, finden Sie hier eine kurze Zusammenfassung:
sr: Уколико сте пратили овај водич, већ би требало да сте налепили информације о апликацији. Уколико нисте, ево кратког прегледа:

source: In Zammad's channel configuration, click on **Configure App**.
de: Klicken Sie in der Kanalkonfiguration von Zammad auf **App konfigurieren**.
sr: У Zammad-овом подешавању канала, кликните на **Подеси апликацију**.

source: Enter your app details:
de: Geben Sie Ihre App-Details ein:
sr: Унесите детаље ваше апликације:

source: Client ID: *Application (client) ID*
de: Client-ID: *Anwendungs-ID (Client)*
sr: Kлијент ID: *Application (client) ID*

source: Client Secret: *Value* (not the "Secret ID"!) from client secret
de: Client-Secret: *Value* (nicht die "Secret ID"!) des Client-Secrets
sr: Клијентска шифра: *Value* (не „Secret ID”!) од клијентске шифре

source: Tenant UUID/Name: *Directory (tenant) ID* (not required for shared mailboxes)
de: Verzeichnis-UUID/Name (Mandant): *Verzeichnis-ID (Mandant)*
sr: UUID/назив корисника апликације: *Directory (tenant) ID* (није обавезно за заједничке поштанске сандучиће)

source: Click on **Submit**.
de: Klicken Sie auf **Übermitteln**.
sr: Кликните на **Пошаљи**.

source: Now you can add your account to Zammad. Do so by clicking the **Add account** button in the top right corner. Select the correct mailbox type. In case you selected "Shared Mailbox", you have to enter the email address of the shared mailbox. Confirm by clicking the **Authenticate** button, enter your credentials and confirm the requested permissions by clicking the **Accept** button.
de: Jetzt können Sie Ihr Konto zu Zammad hinzufügen. Klicken Sie dazu auf die Schaltfläche **Konto hinzufügen** in der oberen rechten Ecke. Wählen Sie den richtigen Mailbox-Typ. Falls Sie "Freigegebenes Postfach" (shared mailbox) ausgewählt haben, müssen Sie die E-Mail-Adresse des freigegebenen Postfachs eingeben. Bestätigen Sie durch Klicken auf die Schaltfläche **Authentifizieren**, geben Sie Ihre Zugangsdaten ein und bestätigen Sie die gewünschten Berechtigungen durch Klicken auf die Schaltfläche **Akzeptieren**.
sr: Сад можете додати ваш налог у Zammad. Ово можете урадити кликом на дугме **Додај налог** у горњем десном углу. Одаберите жељену врсту поштанског сандучета. У случају да одаберете „Заједничко поштанско сандуче”, мораћете да унесете имејл адресу заједничког поштанског сандучета. Потврди кликом на дугме **Аутентификуј се**, унесите своје креденцијале и потврдите тражене дозволе кликом на дугме **Accept**.

source: Screenshot shows Zammad's dialog for account configuration.
de: Der Screenshot zeigt den Dialog von Zammad zur Konfiguration des Kontos.
sr: Снимак екрана који приказује Zammad дијалог подешавања налога.

source: After that, Zammad will ask you to assign a destination group. Select a group which should (initially) handle the incoming tickets of this channel. Additionally, you can decide if assign the email address should be assigned to the selected group for outgoing emails (*Destination group > Sending email address*). Choose between:
de: Danach werden Sie von Zammad aufgefordert, eine Gruppe zuzuweisen. Wählen Sie eine Gruppe, die (zunächst) die eingehenden Tickets dieses Kanals bearbeiten soll. Zusätzlich können Sie entscheiden, ob die E-Mail-Adresse der ausgewählten Gruppe für ausgehende E-Mails (*E-Mail-Versandadresse der Zielgruppe*) zugewiesen werden soll. Wählen Sie zwischen:
sr: Након тога Zammad ће вас питати за доделу циљне групе. Изаберите групу која би требало (иницијално) да обради примљене тикете овог канала. Додатно, можете одлучити да ли имејл адреса треба да буде додељена одабраној групи за одлазну пошту (*Одредишна група > Имејл адреса за слање*). Изаберите између:

source: **Change to ...** to add this email address to the group for outgoing emails. This may overwrite an already assigned email address.
de: **Wechsel zu ...**, um diese E-Mail-Adresse der Gruppe für ausgehende E-Mails hinzuzufügen. Dies kann eine bereits zugewiesene E-Mail-Adresse überschreiben.
sr: **Измени на ...** за доделу ове имејл адресе групи за одлазну пошту. Ово може преиначити већ додељену имејл адресу.

source: **Do not change email address** if you don't want assign an email address to the group or change it. If the group has no assigned email address, it stays empty. If the group already has an assigned email address, it stays the same.
de: **E-Mail-Adresse nicht ändern**, wenn Sie der Gruppe keine E-Mail-Adresse zuweisen oder sie ändern möchten. Wenn der Gruppe keine E-Mail-Adresse zugewiesen ist, bleibt sie leer. Wenn der Gruppe bereits eine E-Mail-Adresse zugewiesen wurde, bleibt diese unverändert.
sr: **Без измене имејл адресе** уколико не желите да доделите имејл адресу групи или да је измените. Уколико група нема додељену имејл адресу, остаје празна. Уколико група већ има додељену имејл адресу, остаје иста.
