Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: This is the target URL Zammad shall redirect to when the user presses the SAML button.
de: Dies ist die Ziel-URL, an die Zammad weiterleiten soll, wenn der Benutzer die SAML-Schaltfläche drückt.
sr: Ово је циљна URL адреса на коју ће Zammad преусмерити када корисник притисне SAML дугме.

source: IDP single logout target URL
de: IDP Ziel-URL für Einzel-Abmeldung
sr: IDP URL путања јединствене одјаве

source: This is the URL to which the single logout request and response should be sent.
de: Dies ist die URL, an die die einzelne Abmeldeanforderung gesendet werden soll.
sr: Ово је URL путања на коју треба преусмерити захтеве и одговоре за јединствену одјаву.

source: IDP certificate
de: IDP-Zertifikat
sr: IDP сертификат

source: The public certificate of your IDP for Zammad to verify during the callback phase.
de: Das öffentliche Zertifikat Ihres IDP, das Zammad während des "Callbacks" überprüfen soll.
sr: Јавни сертификат вашег IDP-а који Zammad треба да провери током фазе повратног позива.

source: IDP certificate fingerprint
de: Fingerabdruck IDP-Zertifikat
sr: IDP отисак сертификата

source: The fingerprint of your IDPs public certificate to verify during callback phase.
de: Der Fingerabdruck Ihres öffentlichen IDP-Zertifikats, der während des "Callbacks" geprüft wird.
sr: Отисак вашег јавног IDP сертификата за верификацију током фазе повратног позива.

source: 🔏 **For the IdP certificate / certificate fingerprint:**
de: 🔏 **Für das IdP-Zertifikat / den Zertifikatsfingerabdruck:**
sr: 🔏 **За IdP сертификат / отисак сертификата:**

source: Provide **only one or the other**—do not provide both! (Between the two, we recommend the signing certificate itself: fingerprints use SHA-1, which `has been broken for a while now <https://www.schneier.com/blog/archives/2005/02/sha1_broken.html>`_.)
de: Verwenden Sie **nur eine der Varianten**. Wir empfehlen die Verwendung des Zertifikats selbst: Fingerabdrücke verwenden SHA-1, das `seit einiger Zeit als unsicher gilt <https://www.schneier.com/blog/archives/2005/02/sha1_broken.html>`_).
sr: Обезбедите **или једно или друго**—никако обе вредности! (Између ове две, препоручујемо сам сертификат за потписивање: отисци сертификата користе SHA-1 алгоритам, који је већ неко време покварен <https://www.schneier.com/blog/archives/2005/02/sha1_broken.html>`_.)

source: **Keycloak users:** Find your certificate in the Keycloak admin panel under **Realm Settings > Keys > Algorithm: RS256 > Certificate**.
de: **Keycloak-Anwender:** Sie finden Ihr Zertifikat im Keycloak-Administrationsbereich unter **Realm Settings > Keys > Algorithm: RS256 > Certificate**.
sr: **Keycloak корисници:** Пронађите свој сертификат у Keycloak административном панелу под **Realm Settings > Keys > Algorithm: RS256 > Certificate**.

source: This is the unique identifiers field type. Usually it should be ``urn:oasis:names:tc:SAML:1.1:nameid-format:emailAddress``.
de: Dies ist der Feldtyp für unique identifiers (eindeutige Kennung). Normalerweise ist es ``urn:oasis:names:tc:SAML:1.1:nameid-format:emailAddress``.
sr: Ово је типа идентификатора јединствених поља. Обично би требало да буде ``urn:oasis:names:tc:SAML:1.1:nameid-format:emailAddress``.

source: Zammad **expects an email address as unique identifier**!
de: Zammad **erwartet eine E-Mail-Adresse als eindeutigen Identifikator**!
sr: Zammad **очекује имејл адресу као јединствени идентификатор**!

source: UID attribute name
de: Name des UID-Attributs
sr: Назив UID атрибута

source: Here you can define an attribute that uniquely identifies the user. If unset, the name identifier returned by the IDP is used.
de: Hier können Sie ein Attribut zur eindeutigen Identifizierung des Benutzers festlegen. Wenn es nicht gesetzt ist, wird der von der IDP zurückgegebene Namensbezeichner verwendet.
sr: Овде можете одредити назив атрибута који јединствено идентификује корисника. Уколико није подешено, биће коришћен индентификатор назива који враћа IDP.

source: Example configuration of SAML part 2
de: Beispielkonfiguration von SAML Teil 2
sr: Пример подешавања SAML део 2

source: Decide if the certificate for the connection to the IdP service has to be verified or not (default: ``yes``).
de: Entscheiden Sie, ob das Zertifikat für die Verbindung zum IdP-Dienst verifiziert werden muss oder nicht (Standard: ``Ja``).
sr: Одређује да ли ће сертификат за конекцију до IdP сервиса бити проверен или не (подразумевано: ``да``).

source: Signing & Encrypting
de: Signieren & Verschlüsseln
sr: Потписивање и шифровање

source: Define if you want to sign, encrypt, do both or nothing for the requests.
de: Legen Sie fest, ob Sie die Anfragen signieren, verschlüsseln, beides oder nichts tun wollen.
sr: Одређује да ли желите потписивање и шифровање захтева.

source: Certificate (PEM)
de: Zertifikat (PEM)
sr: Сертификат (PEM)

source: Paste the public certificate of your Zammad SAML client, if you want to encrypt the requests.
de: Fügen Sie das öffentliche Zertifikat Ihres Zammad SAML-Clients ein, wenn Sie die Anfragen verschlüsseln möchten.
sr: Налепите јавни сертификат вашег Zammad SAML клијента, уколико желите шифровање захтева.

source: Make sure the certificate is:
de: Vergewissern Sie sich, dass das Zertifikat:
sr: Уверите се да је сертификат:

source: already valid and not yet expired
de: bereits gültig und noch nicht abgelaufen ist
sr: већ важећи и није још истекао

source: no CA certificate
de: kein CA-Zertifikat ist
sr: није CA сертификат

source: valid for signing and encrypting
de: gültig zum Signieren und Verschlüsseln ist
sr: важећи за потписивање и шифровање

source: Private key (PEM)
de: Privater Schlüssel (PEM)
sr: Тајни кључ (PEM)

source: Paste the private key of your Zammad SAML client here, if you want to sign the requests.
de: Fügen Sie hier den privaten Schlüssel Ihres Zammad SAML-Clients ein, wenn Sie die Anfragen signieren möchten.
sr: Налепите тајни кључ вашег Zammad SAML клијента, уколико желите потписивање захтева.

source: Make sure the key is an RSA key with a length of at least 2048 bits.
de: Stellen Sie sicher, dass der Schlüssel ein RSA-Schlüssel mit einer Länge von mindestens 2048 Bit ist.
sr: Уверите се да је тајни кључ RSA дужине од најмање 2048 бита.

source: Private key secret
de: Geheimnis des privaten Schlüssels
sr: Лозинка тајног кључа

source: If your private key is secured with a secret, you can provide it here.
de: Wenn Ihr privater Schlüssel mit einem Passwort gesichert ist, können Sie es hier angeben.
sr: Уколико је ваш тајни кључ обезбеђен лозинком, можете је унети овде.

source: Your callback URL
de: Ihre Callback-URL
sr: Ваш URL повратног позива

source: This URL is needed for your IdP configuration so it knows where to redirect to after successful authentication.
de: Diese URL wird für die IdP-Konfiguration benötigt, damit dieser weiß, wohin er nach erfolgreicher Authentifizierung weiterleiten muss.
sr: Ова URL адреса је потребна за вашу IDP конфигурацију како би знала где да преусмери корисника након успешне аутентификације.

source: After saving your input by clicking on the "Submit" button, Zammad verifies the provided keys/certificates (e.g. if they are valid for signing/encrypting and if they aren't expired).
de: Nachdem Sie Ihre Eingaben durch Klicken auf die Schaltfläche "Absenden" gespeichert haben, überprüft Zammad die bereitgestellten Schlüssel/Zertifikate (z.B. ob sie zum Signieren/Verschlüsseln gültig und nicht abgelaufen sind).
sr: По снимању вашег уноса кликом на дугме „Пошаљи”, Zammad ће проверити достављене кључеве/сертификате (нпр. да ли су важећи за потписивање/шифровање и да нису истекли.

source: See :ref:`automatic account linking <automatic-account-linking>` for details on how to link existing Zammad accounts to IdP accounts.
de: Siehe :ref:`automatische Kontoverknüpfung <automatic-account-linking>` für Details zur Verknüpfung bestehender Zammad-Konten mit IdP-Konten.
sr: Погледајте :ref:`аутоматско повезивање налога <automatic-account-linking>` за детаље о томе како да повежете постојеће Zammad налоге са IdP налозима.

source: Automatic account linking doesn't work
de: Automatische Kontoverknüpfung funktioniert nicht
sr: Аутоматско повезивање налога не функционише

source: Have you double-checked your IdP's user attribute mapping configuration?
de: Haben Sie die Konfiguration der Benutzerattribut-Zuordnung Ihres IdP überprüft?
sr: Да ли сте још једном проверили подешавање мапирања корисничких атрибута вашег IdP-а?

source: SAML with Keycloak
de: SAML mit Keycloak
sr: SAML са Keycloak-ом

source: Step 1: Keycloak Configuration
de: Schritt 1: Keycloak-Konfiguration
sr: Корак 1. Keycloak подешавања

source: **To add Zammad as a client,** save the XML configuration to disk (``https://your.zammad.domain/auth/saml/metadata``) and use **Clients > Clients list > Import client** in the Keycloak admin panel.
de: **Um Zammad als Client hinzuzufügen,** speichern Sie die XML-Konfiguration auf Ihrem Rechner (``https://your.zammad.domain/auth/saml/metadata``) und verwenden Sie **Clients > Clients list > Import client** im Keycloak Admin Panel.
sr: **Да бисте додали Zammad као клијента,** сачувајте XML конфигурацију на диск (``https://your.zammad.domain/auth/saml/metadata``) и користите **Clients > Clients list > Import client* * у Keycloak админ панелу.

source: To help Zammad **match its own user accounts to Keycloak users**, create a user attribute (or “property”) mapper. In **Clients list**, click on your newly created Client ID, choose the tab **Client scopes** and click on the link which refers to your Zammad instance. Choose **Add mapper > By configuration > User Property** and create a mapper with the following entries:
de: Um Zammad bei der **Zuordnung der Benutzerkonten zu Keycloak-Benutzern** zu helfen, erstellen Sie einen Benutzerattribut- (oder "Eigenschafts-")-Mapper. Klicken Sie in der **Clientl list** auf Ihre neu erstellte Client-ID, wählen Sie den Reiter **Client scopes** und klicken Sie auf den Link, der auf Ihre Zammad-Instanz verweist. Wählen Sie **Add mapper > By configuration > User Property** und erstellen Sie einen Mapper mit den folgenden Einträgen:
sr: Да бисте помогли Zammad-у да **повеже сопствене корисничке налоге са Keycloak корисницима**, креирајте мапирање атрибута корисника (или „property“). У **Clients list** кликните на ваш новокреирани ID клијента, изаберите језичак **Client scopes** и кликните на линк који се односи на вашу Zammad инстанцу. Изаберите **Add mapper > By configuration > User Property** и додајте мапирање са следећим уносима:

source: **Mapper Type**
de: **Mapper-Typ**

source: In the example above, we're telling Zammad that whenever it receives a SAML login request, it should take the ``email`` property from Keycloak, look for a Zammad user with the same ``email`` attribute, and create a new session for that user.
de: Im obigen Beispiel weisen wir Zammad an, dass es bei jeder SAML-Anmeldeanfrage die Eigenschaft ``email`` von Keycloak nehmen, nach einem Zammad-Benutzer mit demselben ``email``-Attribut suchen und eine neue Sitzung für diesen Benutzer erstellen soll.
sr: У горњем примеру, кажемо Zammad-у да кад год прими SAML захтев за пријаву, треба да узме атрибут ``email`` од Keycloak-а, потражи Zammad корисника са истим атрибутом ``email`` и креира нову сесију за тог корисника.

source: If your Keycloak users' email addresses are stored on another property (*e.g.,* ``username``), adjust accordingly.
de: Wenn die E-Mail-Adressen Ihrer Keycloak-Benutzer in einer anderen Eigenschaft gespeichert sind (*z.B.* ``username``), passen Sie sie entsprechend an.
sr: Ако су имејл адресе ваших Keycloak корисника ускладиштене у другом атрибуту (*нпр.* ``username``), прилагодите мапирање у складу са тим.

source: Back in **Settings**, enter the Client ID (``https://your.zammad.domain/auth/saml/metadata``) in the field **Master SAML Processing URL**.
de: Geben Sie in den **Einstellungen** die Client-ID (``https://your.zammad.domain/auth/saml/metadata``) in das Feld **Master SAML Processing URL** ein.
sr: Вратите се у **Settings**, унесите Client ID (``https://your.zammad.domain/auth/saml/metadata``) у поље **Master SAML Processing URL**.

source: You also need to enable **Sign assertions**.
de: Sie müssen auch **Sign Assertions** aktivieren.
sr: Такође морате да укључите **Sign assertions**.

source: 2. Configure Zammad
de: 2. Konfigurieren Sie Zammad
sr: 2. Подесите Zammad

source: Log in to Zammad as an administrator
de: Als Administrator bei Zammad anmelden
sr: Пријавите се у Zammad као администратор

source: In the admin panel go to "Settings" > "Security" > "Third-party Applications" > "Authentication via SAML"
de: Gehen Sie im Admin-Bereich zu "Einstellungen" > "Sicherheit" > "Anwendungen von Drittanbietern" > "Authentifizierung über SAML"
sr: Идите у администраторском панелу на „Подешавања” > „Безбедност” > „Апликације трећег лица” > „Аутентификација путем SAML”

source: Provide the following information:
de: Geben Sie die folgenden Informationen an:
sr: Обезбедите следеће информације:

source: SAML IdP Login URL: ``https://your.domain/realms/your-realm/protocol/saml``
de: SAML IdP Login URL: ``https://ihre.domain/realms/your-realm/protocol/saml``
sr: SAML IdP URL пријаве: ``https://your.domain/realms/your-realm/protocol/saml``

source: SAML IdP Logout URL: ``https://your.domain/realms/your-realm/protocol/saml``
de: SAML IdP Logout-URL: ``https://ihre.domain/realms/your-realm/protocol/saml``
sr: SAML IdP URL одјаве: ``https://your.domain/realms/your-realm/protocol/saml``

source: SAML IdP Certificate: Upload the previously downloaded Base64 certificate.
de: SAML IdP-Zertifikat: Laden Sie das zuvor heruntergeladene Base64-Zertifikat hoch.
sr: SAML IdP сертификат: отпремите претходно преузет Base64 сертификат.

source: Save the settings
de: Speichern Sie die Einstellungen
sr: Сачувајте подешавања

source: Read on at :ref:`saml-zammad` for a description of the specific fields in Zammad.
de: Lesen Sie weiter unter :ref:`saml-zammad` für eine Beschreibung der einzelnen Felder in Zammad.
sr: Погледајте :ref:`saml-zammad` за опис појединалних поља у Zammad-у.

source: SAML with Microsoft 365
de: SAML mit Microsoft 365
sr: SAML са Microsoft 365

source: 1. Register Zammad as an Application in Microsoft Entra ID
de: 1. Zammad als Anwendung in Microsoft Entra ID registrieren
sr: 1. Региструјте Zammad као апликацију у Microsoft Entra ID

source: Log in to the Microsoft Entra admin center with administrative rights
de: Melden Sie sich im Microsoft Entra Admin Center mit administrativen Rechten an
sr: Пијавите се у Microsoft Entra администраторски панел са одговарајућим дозволама

source: Navigate to "Identity" > "Applications" > "Enterprise Applications"
de: Navigieren Sie zu "Identity" > "Applications" > "Enterprise Applications"
sr: Идите на „Identity” > „Applications” > „Enterprise Applications”

source: Click "New Application" and select "Create your own application"
de: Klicken Sie auf "New Application" und wählen Sie "Create your own application"
sr: Кликните на „New Application” и одаберите „Create your own application”

source: Enter a name for the application, e.g. "Zammad SAML Integration"
de: Geben Sie einen Namen für die Anwendung ein, z.B. "Zammad SAML Integration"
sr: Унесите назив апликације, нпр. „Zammad SAML Integration”

source: Choose "Integrate any other application you don't find in the gallery", then click "Create"
de: Wählen Sie "Integrate any other application you don't find in the gallery", und klicken Sie dann auf "Create"
sr: Одаберите „Integrate any other application you don't find in the gallery”, па кликните на „Create”

source: 2. Configure SAML-based Single Sign-On (SSO)
de: 2. Konfigurieren Sie SAML-basiertes Single Sign-On (SSO)
sr: 2. Подесите SAML јединствену пријаву (SSO)

source: After the application is created, go to its overview page
de: Nachdem die Anwendung erstellt wurde, gehen Sie zur Übersichtsseite
sr: Након креирања апликације, идите на преглед

source: Select "Single sign-on" from the left-hand menu
de: Wählen Sie "Single sign-on" aus dem linken Menü
sr: Одаберите „Single sign-on” из менија са леве стране

source: Choose "SAML" as the sign-on method
de: Wählen Sie "SAML" als Anmeldemethode
sr: Одаберите „SAML” као метод пријаве

source: In the "Basic SAML Configuration" section, click "Edit":
de: Klicken Sie im Abschnitt "Basic SAML Configuration" auf "Edit":
sr: У одељку „Basic SAML Configuration”, кликните на „Edit”:

source: Identifier (Entity ID): Use Zammad's Entity ID, which can be found at ``https://your.zammad.domain/auth/saml/metadata``
de: Identifier (Entity ID): Verwenden Sie die Entity ID von Zammad, die Sie unter ``https://ihre.zammad.domain/auth/saml/metadata`` finden können
sr: Идентификатор (Entity ID): искористите Zammad-ov Entity ID, који моћете пронаћи на ``https://your.zammad.domain/auth/saml/metadata``

source: Reply URL (Assertion Consumer Service URL): Set it to ``https://your.zammad.domain/auth/saml/callback``
de: Reply URL (Assertion Consumer Service URL): Setzen Sie sie auf ``https://ihre.zammad.domain/auth/saml/callback``
sr: URL адреса одговора (Assertion Consumer Service URL): поставите на ``https://your.zammad.domain/auth/saml/callback``

source: Save the configuration
de: Speichern Sie die Konfiguration
sr: Сачувајте подешавања

source: 3. Configure User Attributes and Claims Mapping
de: 3. Benutzer-Attribute und Claims-Zuordnung konfigurieren
sr: 3. Подесите мапирање корисничких атрибута и захтева

source: In the "Attributes & Claims" section, click "Edit". By default, some claims like User Principal Name, Email Address, First Name, and Last Name are already configured.
de: Klicken Sie im Abschnitt "Attributes & Claims" auf "Edit". Standardmäßig sind einige Angaben wie User Principal Name, EMail-Address, First Name und Last Name bereits konfiguriert.
sr: У одељку „Attributes & Claims”, кликните на „Edit”. Подразумевано, неки захтеви као „User Principal Name”, „Email Address”, „First Name” и „Last Name” су већ подешени.

source: Screenshots showing "Attribute & Claims" configuration in Entra admin center
de: Screenshots der "Attribute & Claims"-Konfiguration im Entra Admin Center
sr: Снимак екрана који приказује „Attribute & Claims” подешавања у Entra администраторском панелу

source: 4. Download the SAML Certificate
de: 4. Laden Sie das SAML-Zertifikat herunter
sr: 4. Преузмите SAML сертификат

source: In the "SAML Signing Certificate" section, download the "Certificate (Base64)":
de: Laden Sie im Abschnitt "SAML Signing Certificate" das "Certificate (Base64)" herunter:
sr: У одељку „SAML Signing Certificate”, преузмите „Certificate (Base64)”:

source: Screenshot showing the highlighted certificate export already
de: Screenshot zeigt den hervorgehobenen Zertifikatexport
sr: Снимак екрана који приказује већ наглашен извоз сертификата

source: 5. Configure Zammad
de: 5. Zammad konfigurieren
sr: 5. Подесите Zammad

source: IDP SSO target URL: The Login URL from the Microsoft Entra Admin Center.
de: IDP SSO target URL: Die Anmelde-URL aus dem Microsoft Entra Admin Center.
sr: IDP SSO URL путања: URL пријаве из Microsoft Entra администраторског панела.

source: IDP single logout target URL: The Logout URL from the Microsoft Entra Admin Center.
de: IDP single logout target URL: Die Logout URL aus dem Microsoft Entra Admin Center.
sr: IDP Single Logout URL путања: URL одјаве из Microsoft Entra администраторског панела.

source: 6. Assign Users
de: 6. Benutzer zuweisen
sr: 6. Доделите кориснике

source: In Microsoft Entra ID, assign the relevant users to the Zammad application to grant them access.
de: Weisen Sie in Microsoft Entra ID die entsprechenden Benutzer der Zammad-Anwendung zu, um ihnen Zugriff zu gewähren.
sr: У Microsoft Entra ID, доделите одговрајуће кориснике Zammad апликацији и доделите им приступ.

source: It is possible to create a quick login for your helpdesk via Twitter. To do so, you need to follow these steps:
de: Es ist möglich, eine Anmeldung über Twitter zu erstellen. Dazu müssen Sie die folgenden Schritte ausführen:
sr: Могуће је подесити брзо пријављивање у Zammad преко Twitter-а. Да бисте то урадили, потребно је да пратите следеће кораке:

source: Register Twitter App
de: Twitter-App registrieren
sr: Регистрација Twitter апликације

source: Go to https://dev.twitter.com/apps and login with your account.
de: Rufen Sie https://dev.twitter.com/apps auf und melden Sie sich mit Ihrem Konto an.
sr: Идите на https://dev.twitter.com/apps и пријавите се са својим налогом.

source: inital page
de: Startseite
sr: почетна страница

source: Click on "Create App"
de: Klicken Sie auf "Create App"
sr: Кликните на „Create App”

source: new app page
de: neue App Seite
sr: Страница нове апликације

source: Enter app settings. As "Callback URL" you need to enter ``https://zammad_host/api/v1/external_credentials/twitter/callback``. You need to replace ``zammad_host`` with the domain of your Zammad system.
de: Geben Sie die App-Einstellungen ein. Als "Callback URL" müssen Sie ``https://zammad_host/api/v1/external_credentials/twitter/callback`` eingeben. Ersetzen Sie ``zammad_host`` durch die Domain Ihres Zammad-Systems.
sr: Унесите подешавања апликације. Као „Callback URL“ треба да унесете ``https://zammad_host/api/v1/external_credentials/twitter/callback``. Морате заменити ``zammad_host`` са доменом вашег Zammad система.

source: After the app has been created, update the application icon and organization attributes.
de: Nachdem die Anwendung erstellt wurde, aktualisieren Sie das Anwendungssymbol und die Organisationsattribute.
sr: Након што је апликација направљена, подесите иконицу апликације и атрибуте организације.

source: set permissions to receive and send direct messages
de: Berechtigungen zum Empfangen und Senden von Direktnachrichten festlegen
sr: подесите дозволе за примање и слање директних порука

source: Next we need to set ``read, write and access direct messages`` permissions for the app.
de: Als Nächstes müssen wir die Berechtigungen ``read, write and access direct messages`` Berechtigungen für die Anwendung festlegen.
sr: Затим морамо да подесимо дозволе за ``read, write and access direct messages`` за апликацију.

source: click on Keys & Access Token, note them
de: Klicken Sie auf Schlüssel & Zugangstoken, notieren Sie sie
sr: кликните на Keys & Access Token, забележите их

source: Go to "Keys and Access Token" tab and note the "Consumer Key" and "Consumer Secret".
de: Gehen Sie zum Tab "Keys and Access Token" und notieren Sie sich den "Consumer Key" und das "Consumer Secret".
sr: Идите на језичал „Keys and Access Toke“ и забележите „Consumer Key“ и „Consumer Secret“.

source: Configure Zammad as Twitter App
de: Zammad als Twitter-App konfigurieren
sr: Подесите Zammad као Twitter апликацију

source: Go to "Admin > Security > Twitter > Third Party Applications > Twitter" Section.
de: Gehen Sie zu "Einstellungen > Sicherheit > Anwendungen von Drittanbietern > Twitter"
sr: Идите на одељак „Администрација > Безбедност > Апликације трећег лица > Twitter“.

source: Admin > Security > Third Party Applications
de: Verwaltung > Sicherheit > Anwendungen von Drittanbietern
sr: Администрација > Безбедност > Апликације трећег лица

source: Fill in the "Twitter Key" and the "Twitter Secret" and click the "Submit" button.
de: Geben Sie den "Twitter Key" und das "Twitter Secret" ein und klicken Sie auf die Schaltfläche "Übermitteln".
sr: Попуните „Twitter кључ“ и „Twitter шифра“ и кликните на дугме „Пошаљи“.
