Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: You can add new public links via the *New Public Link* button on the upper right. You'll see a new dialog where you can provide the following information:
de: Sie können neue öffentliche Links über die Schaltfläche *Neuer öffentlicher Link* oben rechts hinzufügen. Es wird ein Dialog angezeigt, in dem Sie die folgenden Informationen festlegen können:
sr: Можете додати нове јавне линкове путем дугмета *Нови јаван линк* у горњем десном углу. Видећете нови дијалог где можете унети следеће информације:

source: This is the actual target page you're linking to. Zammad only allows URLs that start with either ``http://`` or ``https://``.
de: Dies ist die eigentliche Zielseite, auf die Sie verlinken. Zammad erlaubt nur URLs, die entweder mit ``http://`` oder ``https://`` beginnen.
sr: Ово је уствари циљна страна на коју линкујете. Zammad дозвољава само URL адресе које почињу са ``http://`` или ``https://``.

source: Do not use data privacy and terms of service URLs of ``zammad.com`` or ``zammad.org``. Every company handles it differently, so there is no standardized approach to data retention and other policies. This function was made to allow you to link to your *own resources*.
de: Verwenden Sie nicht URLs zum Datenschutz und zu den Nutzungsbedingungen von ``zammad.com`` oder ``zammad.org``. Jede Firma handhabt dies anders, so dass es keinen standardisierten Ansatz für die Datenspeicherung und andere Bedingungen gibt. Diese Funktion ist dazu da, damit Sie auf Ihre *eigenen Ressourcen* verlinken können.
sr: Немојте користити URL путање политике приватности и услова услуге од ``zammad.com`` или ``zammad.org``. Свака фирма их уређује на другачији начин, тако да не постоји стандардизован приступ за чување података и друге полисе. Ова функција је направљена да вам омогући да преусмерите на своје *сопствене полисе*.

source: This is the regular text your user sees as the link text. You may want to keep the title as short as possible as it's displayed in the footer of the context you'll later select.
de: Dies ist der normale Text, den der Benutzer als Linktext sieht. Sie sollten den Titel so kurz wie möglich halten, da er in der Fußzeile des Bereichs des Bereichs angezeigt wird, den Sie noch auswählen.
sr: Ово је обичан текст који ваш корисник види као назив линка. Можда бисте желели да наслов буде што краћи јер је приказан у подножју контекста који ћете касније изабрати.

source: The description for URLs is an accessibility feature that helps users with screen readers to better understand the scope of the URL. It will also be shown by normal browsers when hovering over the link in question.
de: Die Beschreibung für URLs dient der Barrierefreiheit, die Benutzern mit Bildschirmlesegeräten hilft zu verstehen, was sich unter der URL verbirgt. Sie wird auch in normalen Browsern angezeigt, wenn man den Mauszeiger über den betreffenden Link bewegt.
sr: Опис за URL адресе је функција приступачности која помаже корисницима са читачима екрана да боље разумеју контекст линка. Такође ће га претраживачи стандарно приказати када пређете мишем преко дотичног линка.

source: Use this to describe the link. This value is *optional*.
de: Beschreiben Sie damit den Link. Dieser Wert ist *optional*.
sr: Користите ово да опишете линк. Ова вредност је *опциона*.

source: Context
de: Kontext
sr: Контекст

source: The context setting allows you to choose one or several places where this link should be displayed. Depending on your choice, Zammad will then show the links on the relevant pages.
de: Die Kontexteinstellung ermöglicht es Ihnen, einen oder mehrere Orte auszuwählen, an denen dieser Link angezeigt werden soll. Je nach Ihrer Wahl zeigt Zammad die Links dann auf den entsprechenden Seiten an.
sr: Подешавање контекста вам омогућава да изаберете једно или више места на којима треба да се прикаже овај линк. У зависности од вашег избора, Zammad ће затим приказати линкове на релевантним страницама.

source: You can currently select from:
de: Sie können derzeit wählen zwischen:
sr: Тренутно можете бирати између:

source: Forgot Password Screen
de: Passwort-Vergessen-Ansicht
sr: Страна заборављене лозинке

source: Login Screen
de: Login
sr: Страна за пријављивање

source: Signup Screen
de: Registrierungs-Ansicht
sr: Страна регистрације

source: To help you understand scopes better, here's the different scopes as a screenshot. Note that we intentionally did set all links for all contexts. 🤓
de: Damit Sie die Bereiche besser verstehen, sehen Sie hier die verschiedenen Bereiche als Screenshot. Beachten Sie, dass wir absichtlich alle Links für alle Kontexte gesetzt haben. 🤓
sr: Да бисмо вам помогли да боље разумете контексте, ево различитих контекста као снимака екрана. Имајте на уму да смо намерно поставили све линкове за све контексте. 🤓

source: Screenshot showing Zammad's forgot password page with custom public links
de: Screenshot der Seite "Passwort vergessen" von Zammad mit benutzerdefinierten öffentlichen Links
sr: Снимак екрана који приказује Zammad-ову страну заборављене лозинке са прилагођеним јавним линком

source: Screenshot showing Zammad's login page with custom public links
de: Screenshot der Anmeldeseite von Zammad mit benutzerdefinierten öffentlichen Links
sr: Снимак екрана који приказује Zammad-ову страну за пријављивање са прилагођеним јавним линком

source: Screenshot showing Zammad's signup page with custom public links
de: Screenshot der Anmeldeseite von Zammad mit benutzerdefinierten öffentlichen Links
sr: Снимак екрана који приказује Zammad-ову страну регистрације са прилагођеним јавним линком

source: Display in new tab
de: In neuem Tab anzeigen
sr: Прикажи у новом прозору

source: This setting allows you to determine if the user's browser opens the URL in a new tab or within the existing tab.
de: Mit dieser Einstellung können Sie festlegen, ob der Browser des Benutzers die URL in einem neuen Tab oder innerhalb des bestehenden Tabs öffnet.
sr: Ово подешавање вам омогућава да одредите да ли кориснички претраживач треба да отвори URL адресу у новом прозору или унутар постојећег.

source: Manage Existing Public Links
de: Verwalten der bestehenden öffentlichen Links
sr: Управљајте постојећим јавним линковима

source: Re-arrange Links
de: Links neu anordnen
sr: Промените редослед линкова

source: By default Zammad sorts your public links in the order you've created them. That may be a problem if you add a link later on. For this reason you can easily change the link order by dragging them to another position by using the ≣ handle.
de: Standardmäßig sortiert Zammad Ihre öffentlichen Links in der Reihenfolge, in der Sie sie erstellt haben. Das kann ein Problem sein, wenn Sie später einen Link hinzufügen. Aus diesem Grund können Sie die Reihenfolge der Links leicht ändern, indem Sie sie über den ≣-Button an eine andere Position ziehen.
sr: Подразумевано, Zammad сортира ваше јавне линкове редоследом којим сте их додали. То може бити проблем ако касније додате нови линк. Из тог разлога можете лако променити редослед линкова тако што ћете их превући на другу позицију путем ≣ ручке.

source: These changes are applied immediately.
de: Diese Änderungen werden sofort übernommen.
sr: Ове промене се примењују одмах.

source: Actions for Existing Links
de: Aktionen für existierende Links
sr: Радње за постојеће линкове

source: Updating existing entries
de: Bestehende Tickets aktualisieren
sr: Освежавање постојећих уноса

source: Got a typo in your URL or title? Want to change the context the link is being shown on? No problem! Just click on the affected link title and adjust the entry as needed.
de: Haben Sie einen Tippfehler in Ihrer URL oder Ihrem Titel? Möchten Sie den Kontext ändern, in dem der Link angezeigt wird? Kein Problem! Klicken Sie einfach auf den betreffenden Link-Titel und passen Sie den Eintrag nach Bedarf an.
sr: Имате грешку у URL адреси или називу? Желите да промените контекст у коме се линк приказује? Нема проблема! Само кликните на назив линка и прилагодите унос по потреби.

source: You'll be given the same options as you have during the link creation.
de: Sie sehen die gleichen Optionen wie bei der Erstellung des Links.
sr: Биће вам доступне исте опције које имате током додавања линка.

source: Cloning & Removing
de: Klonen und Löschen
sr: Клонирање и уклањање

source: If you want to add a new link that's very similar to an existing one, simply click on ⋮ and select *Clone*.
de: Wenn Sie einen neuen Link hinzufügen möchten, der einem bestehenden Link sehr ähnlich ist, klicken Sie einfach auf ⋮ und wählen Sie *Klonen*.
sr: Ако желите да додате нов линк који је веома сличан постојећем, једноставно кликните на ⋮ и изаберите *Клонирај*.

source: Zammad will open a new public link dialog with the existing settings filled in.
de: Zammad öffnet einen neuen öffentlichen Link-Dialog, in dem die vorhandenen Einstellungen übernommen werden.
sr: Zammad ће отворити дијалог новог јавног линка са попуњеним подешавањима.

source: If you no longer need a public link, you can **remove** it by using ⋮ and selecting *Delete*. Zammad will ensure that you really want to remove the entry with a modal. Be aware that the deletion is **final**. There's no way to bring back removed public links.
de: Wenn Sie einen öffentlichen Link nicht mehr benötigen, können Sie ihn **löschen**, indem Sie ⋮ klicken und *Löschen* wählen. Zammad vergewissert sich mit einer Rückfrage, dass Sie den Eintrag wirklich entfernen wollen. Beachten Sie, dass die Löschung **endgültig** ist. Es gibt keine Möglichkeit, entfernte öffentliche Links wiederherzustellen.
sr: Ако вам више није потребан јавни линк, можете га **уклонити** тако што ћете користити ⋮ и изабрати *Избриши*. Zammad ће проверити да ли заиста желите да избришете унос помоћу модала. Обратите пажњу да је брисање **коначно**. Не постоји начин да вратите уклоњене јавне линкове.

source: Screenshot showing the ⋮ action menu in public links
de: Screenshot zeigt das ⋮ Aktionsmenü in öffentlichen Links
sr: Снимак екрана који приказује ⋮ мени радњи у јавним линковима

source: Report Profiles
de: Berichts-Profile

source: The reporting is useful to view statistics, get an overview of the number of tickets (e.g. tickets of a specific customer) and to download ticket data from Zammad. In the following section you will find instructions about how to create and change report profiles. You can find an explanation about how to use the reporting in the :user-docs:`reporting section of the user documentation </extras/reporting>`. If the reporting in Zammad is not enough for you, you can even connect third-party reporting tools like Grafana to Zammad.
de: Berichte sind nützlich, um Statistiken einzusehen, eine Übersicht über die Anzahl der Tickets zu erhalten (z.B. Tickets eines bestimmten Kunden) und um Ticket-Daten von Zammad herunterzuladen. Im folgenden Abschnitt finden Sie eine Anleitung zum Erstellen und Ändern von Berichts-Profilen. Sie finden eine Erklärung zur Verwendung der Berichte im :user-docs:`Berichts-Bereich der Benutzerdokumentation </extras/reporting>`. Wenn Ihnen die Berichte in Zammad nicht ausreichen, können Sie sogar Reporting-Tools von Drittanbietern wie Grafana mit Zammad verbinden.

source: To create and edit report profiles, ``admin.report_profile`` permission is required. To use the reporting itself, ``report`` permission is required.
de: Um Berichtsprofile zu erstellen und zu bearbeiten, ist die Berechtigung ``admin.report_profile`` erforderlich. Um die Berichte selbst zu nutzen, ist die Berechtigung ``report`` erforderlich.
sr: За додавање и уређивање профила извештавања, неопходна је ``admin.report_profile`` дозвола. За коришћење самог извештавања, неопходна је ``report`` дозвола.

source: ⚠️ Be aware that granting users the ``reporting`` permission may leak information. On the one hand, users could see ticket metadata that they do not actually have access to. On the other hand, a possibly large scale of ticket information can easily be downloaded as a spreadsheet.
de: ⚠️ Seien Sie sich bewusst, dass die Erteilung der Berechtigung ``report`` unter Umständen zu einem Datenschutzproblem führen kann. Einerseits könnten Benutzer Metadaten zu Tickets sehen, auf die sie eigentlich keinen Zugriff haben. Andererseits kann eine möglicherweise große Menge an Ticketinformationen leicht als Tabelle heruntergeladen werden.
sr: ⚠️ Будите свесни да давање ``report`` дозволе може да доведе до цурења информација. Са једне стране, корисници могу да виде мета податке тикета којима уствари немају приступ. Са друге стране, велика количина података о тикетима се може једноставно презуети у табеларном формату.

source: Create and Edit Profiles
de: Profile erstellen und bearbeiten
sr: Додавање и уређивање профила

source: Report profiles are used to filter report results. The idea of the profiles is to limit the number of tickets and determine the type of tickets you want to analyze. You can create any number of profiles in the admin interface in the "Report Profile" area. You can filter the tickets as in other places in Zammad based on different conditions.
de: Berichtsprofile werden verwendet, um die Berichte zu filtern. Die Idee der Profile besteht darin, die Anzahl der Tickets zu begrenzen und die Art der Tickets zu bestimmen, die Sie analysieren möchten. Sie können eine beliebige Anzahl von Profilen in den Einstellungen im Bereich "Berichts-Profile" erstellen. Sie können die Tickets wie an anderen Stellen in Zammad auf der Grundlage verschiedener Bedingungen filtern.
sr: Профили извештаја се користе за филтрирање резултата извештаја. Идеја профила је да ограниче број тикета и одреде врсту тикета које желите да анализирате. Можете додати било који број профила у интерфејсу администратора у области „Профили извештаја“. Можете филтрирати тикете на исти начин као и другим областима Zammad-а на основу услова тикета.

source: The edit dialog looks like this:
de: Der Bearbeitungsdialog sieht wie folgt aus:
sr: Форма за уређивање изгледа овако:

source: Screenshot shows creation of report profile
de: Screenshot zeigt die Erstellung eines Berichtsprofils
sr: Снимак екрана приказује додавање профила извештаја

source: This example shows the statistics of all tickets of the organization "Awesome Customer Inc." that were created in the last month.
de: Dieses Beispiel zeigt die Statistik aller Tickets der Organisation "Awesome Customer Inc.", die im letzten Monat erstellt wurden.
sr: Овај пример приказује статистику свих тикета организације „Awesome Customer Inc.” отворених у последњих месец дана.

source: All configured report profiles are displayed in the reporting area and you can switch between them with one click. Have a look at the next section to learn some basics about the usage of the reporting.
de: Alle konfigurierten Berichtsprofile werden im Bereich "Berichte" angezeigt und Sie können mit einem Klick zwischen ihnen wechseln. Schauen Sie sich den nächsten Abschnitt an, um Grundlagen über die Verwendung der Berichte zu erfahren.
sr: Сви подешени профили извештаја су приказани у области извештавања и можете да прелазите између њих једним кликом. Погледајте следећи одељак за неке основе коришћења извештавања.

source: Use the Reporting
de: Verwendung der Berichte

source: You can find the reporting section in the bottom left corner in Zammad next to the avatar icon or your initials:
de: Sie finden den Bereich "Berichte" in der linken unteren Ecke in Zammad neben dem Avatar-Symbol oder Ihren Initialen:
sr: Одељак извештавања можете пронаћи у доњем левом углу Zammad-а одмах поред аватар сличице или ваших иницијала:

source: Menu bar with highlighted reporting
de: Menüleiste mit hervorgehobenen Bereich "Berichte"
sr: Трака са менијем и наглашеним извештавањем

source: If you can't see the reporting button, you should check the permissions.
de: Wenn Sie die Schaltfläche "Berichte" nicht sehen können, sollten Sie die Berechtigungen überprüfen.
sr: Ако не видите дугме извештавања, проверите ваше дозволе.

source: Have a look at the :user-docs:`reporting section of the user documentation </extras/reporting>` for more information about the usage.
de: Weitere Informationen über die Verwendung finden Sie im Abschnitt :user-docs:`Berichte in der Benutzerdokumentation </extras/reporting>`.

source: External Reporting Tools
de: Externe Reporting-Tools
sr: Екстерни алати за извештавање

source: If the integrated reporting is not enough for you, you can even use third party tools like Grafana! Please have a look at :docs:`Reporting Tools </appendix/reporting-tools-thirdparty.html>` in the system documentation, where you can find more information.
de: Wenn Ihnen das integrierte Reporting nicht ausreicht, können Sie auch Tools von Drittanbietern wie Grafana verwenden! Bitte werfen Sie einen Blick auf :docs:`Reporting Tools </appendix/reporting-tools-thirdparty.html>` in der Systemdokumentation, wo Sie weitere Informationen finden können.
sr: Уколико интегрисани извештавање није довољно за вас, можете користи чак и алате трећег лица попуте Grafana-е! Погледајте под :docs:`алатима за извештавање </appendix/reporting-tools-thirdparty.html>` у системској документацији, где можете пронаћи више информација.

source: Admin Permissions
de: Admin-Berechtigungen
sr: Дозволе администратора

source: 📁 **Permissions are namespaced**, which is sort of like having files inside of folders.
de: 📁 **Berechtigungen sind hierarchisch**, was in etwa so ist, als ob sich Dateien in Ordnern befinden.
sr: 📁 **Дозволе су у организоване по називу**, што је као да имате датотеке унутар фолдера.

source: The permissions listed on this page all belong to the ``admin`` namespace. You can select them individually, or you can just select ``admin`` to enable the whole bunch.
de: Die auf dieser Seite aufgeführten Berechtigungen gehören alle zum Berechtigungsgruppe ``Admin``. Sie können sie einzeln auswählen oder einfach ``Admin`` auswählen, um die gesamte Gruppe zu aktivieren.
sr: Све дозволе наведене на овој страници припадају групи ``admin``. Можете их одабрати појединачно, или једноставно одабрати ``admin`` да бисте укључили читаву групу.

source: Admin permissions in the New Role dialog
de: Administratorberechtigungen im Dialogfeld "Neue Rolle“
sr: Дозволе администратора у дијалогу нове улоге

source: Admin permissions are shown at the top of the New Role dialog...
de: Admin-Berechtigungen werden oben im Dialogfeld "Neue Rolle“ angezeigt ...
sr: Дозволе администратора су приказане при врху дијалога нове улоге...

source: Screenshot showing admin settings within Zammad.
de: Screenshot, der die Admin-Einstellungen in Zammad zeigt.
sr: Снимак екрана који приказује подешавања администратора у Zammad-у.

source: ...and give users access to the pages of the Admin Panel.
de: ...und geben Benutzern Zugriff auf den Admin-Bereich.
sr: ...и омогућити корисницима приступ страницама панела администратора.

source: Please be aware that these permissions only grant access to the **settings/configuration** in Zammad. If you want to grant agents access to tickets, see :doc:`agent permissions <agent-permissions>` and :doc:`group permissions <../groups/access-levels>`
de: Bitte beachten Sie, dass diese Berechtigungen nur Zugriff auf die **Einstellungen/Konfiguration** in Zammad gewähren. Wenn Sie Agenten Zugriff auf Tickets gewähren möchten, siehe :doc:`Agent-Berechtigungen <agent-permissions>` und :doc:`Gruppen-Berechtigungen <../groups/access-levels>`
sr: Обратите пажњу да ове дозволе контролишу само приступ Zammad **подешавањима/конфигурацији**. Уколико желите да одобрите оператерима приступ тикетима, погледајте :doc:`дозволе оператера <agent-permissions>` и :doc:`групне дозволе <../groups/access-levels>`

source: Permission name
de: Name der Berechtigung
sr: Назив дозволе

source: Give access to
de: Gewährt Zugriff auf
sr: Омогућује приступ

source: :doc:`AI > Provider </ai/provider>`
de: :doc:`KI > Anbieter </ai/provider>`
sr: :doc:`AI > Провајдер </ai/provider>`

source: :doc:`AI > AI Agents </ai/ai-agents>`
de: :doc:`KI > KI-Agenten </ai/ai-agents>`

source: AI > Smart Assist Text Tools
de: KI > Smart Assist Text Werkzeuge
sr: AI > Smart Assist текстуалне алатке

source: :doc:`AI > Ticket Summary </ai/summary>`
de: :doc:`KI > Ticket-Zusammenfassung </ai/summary>`

source: :doc:`Settings > Branding </settings/branding>`
de: :doc:`Einstellungen > Branding </settings/branding>`
sr: :doc:`Подешавања > Брендинг </settings/branding>`

source: :doc:`Manage > Calendars </manage/calendars>`
de: :doc:`Verwalten > Kalender </manage/calendars>`
sr: :doc:`Управљање > Календари </manage/calendars>`

source: Required for :doc:`/manage/slas/index`
de: Erforderlich für :doc:`/manage/slas/index`
sr: Обавезно за :doc:`/manage/slas/index`

source: :doc:`Channels > Chat </channels/chat>`
de: :doc:`Kanäle > Chat </channels/chat>`
sr: :doc:`Канали > Ћаскање </channels/chat>`

source: Accessing chat for agents: ``chat.agent``
de: Zugang zum Chat für Agenten: ``chat.agent``
sr: Приступ ћаскању за оператере: ``chat.agent``

source: :doc:`Channels > Email </channels/email/index>`
de: :doc:`Kanäle > Email </channels/email/index>`
sr: :doc:`Канали > Имејл </channels/email/index>`

source: :doc:`Channels > Facebook </channels/facebook>`
de: :doc:`Kanäle > Facebook </channels/facebook>`
sr: :doc:`Канали > Facebook </channels/facebook>`

source: Accessing Facebook tickets for agents: :doc:`/manage/groups/access-levels`
de: Zugriff auf Facebook Tickets für Agenten: :doc:`/manage/groups/access-levels`
sr: Приступ Facebook тикетима за оператере: :doc:`/manage/groups/access-levels`

source: :doc:`Channels > Form </channels/form>`
de: :doc:`Kanäle > Formulare </channels/form>`
sr: :doc:`Канали > Форма </channels/form>`

source: :doc:`Channels > Google </channels/google/index>`
de: :doc:`Kanäle > Google </channels/google/index>`
sr: :doc:`Канали > Google </channels/google/index>`

source: :doc:`Channels > Microsoft 365 Graph Email </channels/microsoft365-graph/index>`
de: :doc:`Kanäle > Microsoft 365 Graph Email </channels/microsoft365/index>`
sr: :doc:`Канали > Microsoft 365 Graph имејл </channels/microsoft365-graph/index>`

source: :doc:`Channels > Microsoft 365 IMAP Email </channels/microsoft365/index>`
de: :doc:`Kanäle > Microsoft 365 IMAP Email </channels/microsoft365/index>`
sr: :doc:`Канали > Microsoft 365 IMAP имејл </channels/microsoft365/index>`

source: :doc:`Channels > SMS </channels/sms>`
de: :doc:`Kanäle > SMS </channels/sms>`
sr: :doc:`Канали > SMS </channels/sms>`

source: :doc:`Channels > Telegram </channels/telegram>`
de: :doc:`Kanäle > Telegram </channels/telegram>`
sr: :doc:`Канали > Telegram </channels/telegram>`

source: Accessing Telegram tickets for agents: :doc:`/manage/groups/access-levels`
de: Zugriff auf Telegram-Tickets für Agenten: :doc:`/manage/groups/access-levels`
sr: Приступ Telegram тикетима за оператере: :doc:`/manage/groups/access-levels`

source: :doc:`Channels > Web </channels/web>`
de: :doc:`Kanäle > Web </channels/web>`
sr: :doc:`Канали > Веб </channels/web>`

source: :doc:`Channels > Whatsapp </channels/whatsapp/index>`
de: doc:`Kanäle > Whatsapp </channels/whatsapp/index>`
sr: :doc:`Канали > Whatsapp </channels/whatsapp/index>`

source: :doc:`Manage > Checklist </manage/checklist>`
de: doc:`Verwalten> Checklisten </manage/checklist>`
sr: :doc:`Управљање > Списак задатака </manage/checklist>`

source: :doc:`System > Data Privacy </system/data-privacy>`
de: :doc:`System > Datenschutz </system/data-privacy>`
sr: :doc:`Систем > Приватност података </system/data-privacy>`

source: 🔥 Be careful, it allows users to permanently delete data on the system.
de: 🔥 Seien Sie vorsichtig, es erlaubt Benutzern, Daten auf dem System dauerhaft zu löschen.
sr: 🔥 Будите опрезни, омогућава корисницима да трајно бришу податке на систему.
