Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: Generic Notifications Trigger
de: Trigger für allgemeine Benachrichtigungen
sr: Генерички окидач обавештења

source: For posting a notification to an external service, you can use a dedicated :doc:`Trigger </manage/trigger>`. Here we will outline steps needed to create a Trigger which will fire a webhook under certain conditions.
de: Um eine Benachrichtigung an einen externen Dienst zu senden, können Sie einen speziellen :doc:`Trigger </manage/trigger>` verwenden. Hier werden die Schritte beschrieben, die zur Erstellung eines Triggers erforderlich sind, der einen Webhook abhängig von bestimmten Bedingungen auslöst.
sr: За слање обавештења на спољни сервис, можете користити наменски :doc:`окидач </manage/trigger>`. Овде ћемо навести кораке потребне за додавање окидача који ће покренути повратни позив под одређеним условима.

source: Go to Trigger management screen, and click on the green **New Trigger** button.
de: Gehen Sie zu den Trigger-Einstellungen und klicken Sie auf die grüne Schaltfläche **Neuer Trigger**.
sr: Идите на екран за управљање окидачем и кликните на зелено дугме **Нови окидач**.

source: First, provide a suitable **Name** for the trigger.
de: Geben Sie zunächst einen geeigneten **Namen** für den Trigger an.
sr: Прво унесите одговарајући **назив** окидача.

source: Trigger Activator and Action Execution Mode
de: Trigger-Aktivierung und Aktionsausführungsmodus
sr: Активација окидача и режим извршавања радње

source: Next, choose a suitable activator type under **Activated by** field:
de: Wählen Sie anschließend im Feld **Aktiviert durch** einen geeigneten Aktivierungstyp aus:
sr: Затим изаберите одговарајући тип активације у пољу **Активација**:

source: This will execute the trigger on a specific action, e.g. user creating or updating a ticket, an email coming in.
de: Dadurch wird der Trigger bei einer bestimmten Aktion ausgeführt, z.B. wenn ein Benutzer ein Ticket erstellt oder aktualisiert oder eine E-Mail eingeht.
sr: Ово ће извршити окидач за одређену радњу, нпр. корисник који отвара или освежава тикет, долазни имејл.

source: If you choose **Action** activator, you can set one of the two options for **Action execution**, in order to influence how it evaluates configured conditions:
de: Wenn Sie die Aktivierung **Aktion** auswählen, können Sie eine der beiden Optionen für die **Aktionsausführung** einstellen, um zu beeinflussen, wie die konfigurierte Bedingung auswertet wird:
sr: Ако изаберете активацију **Радња**, можете да подесите једну од две опције за **Извршавање радње**, како бисте утицали на то како окидач процењује подешене услове:

source: This will check if any property used as a condition attribute was updated by the action. If the action behind the trigger was one other than update, it will simply check if the conditions match.
de: Damit wird geprüft, ob eine in der Bedingung verwendete Eigenschaft aktualisiert wurde. Wenn die auslösende Aktion kein Update war wird geprüft, ob die Bedingungen übereinstimmen.
sr: Ово ће проверити да ли је неко својство које се користи као атрибут услова освежено радњом. Ако је радња иза окидача била другачија од освежавања, једноставно ће проверити да ли се услови подударају.

source: This will check if the current state of the ticket matches configured conditions.
de: Damit wird geprüft, ob der aktuelle Status des Tickets den konfigurierten Bedingungen entspricht.
sr: Ово ће проверити да ли тренутно стање тикета одговара подешеним условима.

source: This will execute the trigger at a specific time, e.g. when a ticket pending time is reached.
de: Dadurch wird der Trigger zu einem bestimmten Zeitpunkt ausgeführt, z.B. wenn eine bestimmte Wartezeit für ein Ticket erreicht ist.
sr: Ово ће извршити окидач у одређено време, нпр. када се достигне време чекања тикета.

source: **Time event** activator simply checks if conditions match. This is the same behavior as **Always** execution mode for **Action** activator.
de: Aktivierung **Time event** prüft, ob die Bedingungen übereinstimmen. Das entspricht dem Verhalten wie im Ausführungsmodus **Immer** für die Aktivierung **Aktion**.
sr: Активација **Временски догађај** једноставно проверава да ли су услови задовољени. Ово је исто понашање као режим извршавања **Увек** за активацију **Радња**.

source: For **Conditions for affected objects**, you may configure any of the following recipes, or their combination.
de: Für **Bedingungen für zu verarbeitende Objekte** können Sie jedes der folgenden Beispiele oder deren Kombination konfigurieren.
sr: За **Услови за захваћене објекте** можете да подесите било који од следећих рецепата или њихову комбинацију.

source: Ticket Created ``Action activator only``
de: Ticket erstellt ``Nur Aktions-Aktivierung``
sr: Отворен тикет ``само активација радње``

source: Select ticket **Action** attribute, leave the operator on *is* and set the value to *created*.
de: Wählen Sie **Aktion**, lassen Sie den Operator auf *ist* und setzen Sie den Wert auf *erstellt*.
sr: Изаберите атрибут **Радња** тикета, оставите оператор на *је* и поставите вредност на *додато*.

source: Ticket Updated ``Action activator only``
de: Ticket aktualisiert ``Nur Aktions-Aktivierung``
sr: Освежен тикет ``само активација радње``

source: Select ticket **Action** attribute, leave the operator on *is* and set the value to *updated*.
de: Wählen Sie **Aktion**, lassen Sie den Operator auf *ist* und setzen Sie den Wert auf *aktualisiert*.
sr: Изаберите атрибут **Радња** тикета, оставите оператор на *је* и подесите вредност на *освежено*.

source: Ticket Pending Time Reached ``Time event activator only``
de: Ticket-Wartezeit erreicht ``Nur Zeitereignis-Aktivierung``
sr: Достигнуто време чекања тикета ``само активација временским догађајем``

source: Select ticket **Pending till** attribute and set the operator to *has reached*.
de: Wählen Sie das Attribut **Warten bis** und setzen Sie den Operator auf *wurde erreicht*.
sr: Изаберите атрибут тикета **На чекању до** и подесите оператор на *је достигнуто*.

source: Ticket Escalation Time Reached ``Time event activator only``
de: Ticket-Eskalationszeit erreicht ``Nur Zeitereignis-Aktivierung``
sr: Достигнуто време ескалације тикета ``само активација временског догађаја``

source: Select ticket **Escalation at** attribute and set the operator to *has reached*.
de: Wählen Sie das Attribut **Eskalation am** und setzen Sie den Operator auf *wurde erreicht*.
sr: Изаберите атрибут **Ескалација у** атрибута и подесите оператор на *је достигнуто*.

source: Ticket Escalation Time Reached Warning ``Time event activator only``
de: Ticket-Eskalationszeit Warnung erreicht ``Nur Zeitereignis-Aktivierung``
sr: Упозорење на ескалацију тикета ``само активација временског догађаја``

source: Select ticket **Escalation at** attribute and set the operator to *has reached warning*.
de: Wählen Sie das Attribut **Eskalation am** und setzen Sie den Operator auf *Warnung wurde erreicht*.
sr: Изаберите атрибут **Ескалација у** и подесите оператор на *је достигло упозорење*.

source: For complex conditions, you can switch on **Expert Mode** under the conditions field. This will allow you to change the condition group operators to *Match any (OR)*. See :doc:`/misc/object-conditions/expert-mode` for more information.
de: Für komplexere Bedingungen können Sie den **Expertenmodus** unter dem Bereich Bedingungen einschalten. Dadurch können Sie die Operatoren der Bedingungen in *Mit allen übereinstimmen (ODER)* ändern. Siehe :doc:`/misc/object-conditions/expert-mode` für weitere Informationen.
sr: За сложене услове можете да укључите **Стручни режим** у пољу за услове. Ово ће вам омогућити да промените операторе групе услова у *Дисјункција (OR)*. Погледајте :doc:`/misc/object-conditions/expert-mode` за више информација.

source: Next, under **Execute changes on objects**, change the initial attribute to *Notification > Webhook* and select your notifications webhook from the list.
de: Ändern Sie dann unter **Führt folgende Änderungen an Objekten durch** die Aktion zu *Benachrichtigung > Webhook* und wählen Sie Ihren Benachrichtigungs-Webhook aus der Liste aus.
sr: Затим, у одељку **Изврши измене на објектима**, промените почетни атрибут у *Обавештење > Повратни позив* и изаберите свој повратни позив за обавештења са листе.

source: Configuring Trigger for firing of Webhook
de: Konfigurieren des Triggers für das Auslösen des Webhooks
sr: Подешавање окидача за покретање повратног позива

source: Finally, click on **Submit** to save the trigger.
de: Klicken Sie abschließend auf **Übermitteln**, um den Auslöser zu speichern.
sr: На крају, кликните на **Пошаљи** да бисте сачували окидач.

source: Mattermost Notifications
de: Mattermost-Benachrichtigungen
sr: Mattermost обавештења

source: Follow the steps below to configure a webhook for receiving Zammad notifications in a Mattermost channel.
de: Führen Sie die folgenden Schritte aus, um einen Webhook für den Empfang von Zammad-Benachrichtigungen in einem Mattermost-Kanal zu konfigurieren.
sr: Пратите доле наведене кораке да бисте подесили повратни позив за примање Zammad обавештења у Mattermost каналу.

source: Step 1 - Setup Incoming Webhooks Integration for your Mattermost Channel
de: Schritt 1 - Einrichten der Integration eingehender Webhooks für Ihren Mattermost-Kanal
sr: Корак 1 - Подесите Incoming Webhooks интеграцију за ваш Mattermost канал

source: In your Mattermost top-left corner product menu, choose **Integrations**.
de: Wählen Sie in Ihrem Mattermost-Menü oben links **Integrations**.
sr: У менију у горњем левом углу Mattermost апликације изаберите **Integrations**.

source: Integrations menu item in Mattermost
de: Menüpunkt Integrations in Mattermost
sr: Ставка менија Integrations у Mattermost-у

source: Click on **Incoming Webhooks** integration button.
de: Klicken Sie auf die Schaltfläche **Eingehende Webhooks**.
sr: Кликните на дугме за **Incoming Webhooks** интеграцију.

source: Incoming Webhooks in Mattermost Integratons
de: Eingehende Webhooks in Mattermost
sr: Incoming Webhooks у Mattermost интеграцијама

source: Click on **Add Incoming Webhook** button.
de: Klicken Sie auf die Schaltfläche **Eingehenden Webhook hinzufügen**.
sr: Кликните на дугме **Add Incoming Webhook**.

source: Add Incoming Webhook button
de: Schaltfläche Eingehender Webhook hinzufügen
sr: Add Incoming Webhook дугме

source: Provide an appropriate **Title** and **Description** for the incoming webhook, and choose a target **Channel** for the notification messages.
de: Geben Sie einen geeigneten **Titel** und eine **Beschreibung** für den eingehenden Webhook an, und wählen Sie als Ziel den gewünschten **Kanal** für die Benachrichtigungen.
sr: Наведите одговарајући **Title** и **Description** за долазни повратни позив и изаберите циљни **Channel** за поруке обавештења.

source: Optionally, you may choose to check **Lock to this channel** to limit notifications to a single Mattermost channel. If unset, it will be possible to configure the target channel from Zammad side as well.
de: Optional können Sie **Lock to this channel** wählen, um Benachrichtigungen auf einen einzigen Mattermost-Kanal zu beschränken. Wenn diese Option nicht ausgewählt wird, können Sie den Zielkanal auch von der Zammad-Seite aus konfigurieren.
sr: Опционо, можете изабрати да означите **Lock to this channel** да бисте ограничили обавештења на један Mattermost канал. Ако није подешено, биће могуће подесити циљни канал и са Zammad стране.

source: Incoming Webhook Setup
de: Webhook-Einrichtung eingehend
sr: Incoming Webhook подешавање

source: Click on **Save** button.
de: Klicken Sie auf die Schaltfläche **Speichern**.
sr: Кликните на дугме **Save**.

source: Once created, make sure to copy *the webhook endpoint URL* to clipboard and save it for later. You can do this in one click via the button shown right next to the field.
de: Kopieren Sie nach der Erstellung die *Webhook-Endpunkt-URL* in die Zwischenablage und speichern Sie sie für später. Sie können dies mit einem Klick über den Button im Feld tun.
sr: Након додавања, обавезно копирајте *Webhook endpoint URL* у привремену меморију и сачувајте га за касније. То можете учинити једним кликом преко дугмета приказаног одмах поред поља.

source: Copying Incoming Webhook URL
de: Eingehende Webhook-URL kopieren
sr: Копирање URL адресе долазног повратног позива

source: Finally, close the incoming webhook setup by clicking **Done**.
de: Schließen Sie die Einrichtung des eingehenden Webhooks ab, indem Sie auf **Fertig** klicken.
sr: Коначно, затворите подешавање долазног повратног позива кликом на **Done**.

source: Step 2 - Add a Pre-defined Webhook in Zammad
de: Schritt 2 - Einen vordefinierten Webhook in Zammad hinzufügen
sr: Корак 2 - Додајте повратни позив по шаблону у Zammad

source: Go to :doc:`Webhook </manage/webhook/add>` management screen in your Zammad instance and click on the arrow next to the green button in the upper right corner. Choose **Pre-defined Webhook** from the dropdown menu.
de: Gehen Sie in Ihrer Zammad-Instanz in den Einstellungen zu :doc:`Webhook </manage/webhook/add>` und klicken Sie auf den Pfeil neben der grünen Schaltfläche in der oberen rechten Ecke. Wählen Sie **Vordefinierter Webhook** aus dem Dropdown-Menü.
sr: Идите на екран управљања :doc:`повратним позивима </manage/webhook/add>` у вашој Zammad инстанци и кликните на стрелицу поред зеленог дугмета у горњем десном углу. Изаберите **Повратни позив по шаблону** из падајућег менија.

source: In the subsequent modal dialog, select **Mattermost Notifications** as the pre-defined webhook.
de: Wählen Sie im folgenden Dialogfeld **Mattermost Notifications** als vordefinierten Webhook aus.
sr: У следећем модалном дијалогу изаберите **Mattermost обавештења** за шаблон повратног позива.

source: New Mattermost Notifications Pre-defined Webhook modal
de: Dialog "Neuer Webhook" für vordefinierte Mattermost-Benachrichtigungen
sr: Дијалог новог повратног позива по шаблону Mattermost обавештења

source: Click **Next**.
de: Klicken Sie auf **Weiter**.
sr: Кликните на **Следеће**.

source: In the new dialog, paste *the webhook endpoint URL* from Mattermost into **Endpoint** field.
de: Fügen Sie im neuen Dialogfeld *die Webhook-Endpunkt-URL* von Mattermost in das Feld **Endpunkt** ein.
sr: У новом дијалогу налепите *Webhook endpoint URL* из Mattermost-a у поље **Путања**.

source: Optionally, you can set **Messaging Username** which will be used to post the Zammad notifications. Default value is *zammad*.
de: Optional können Sie einen **Benutzernamen** festlegen, der für die Veröffentlichung der Zammad-Benachrichtigungen verwendet werden soll. Standard ist *zammad*.
sr: Опционо, можете да подесите **Корисничко име за поруке** које ће се користити за постављање Zammad обавештења. Подразумевана вредност је *zammad*.

source: Optionally, you can also set **Messaging Channel**, if you would like to post to a different target channel than configured in the Mattermost incoming webhook.
de: Optional können Sie auch einen **Messaging Channel** einstellen, wenn Sie an einen anderen Zielkanal posten möchten als in der Mattermost Eingangsintegration konfiguriert.
sr: Опционо, такође можете да подесите **Канал за поруке**, ако желите да објављујете на каналу другачијем од онога који је подешен у Mattermost Incoming Webhook.

source: Configuring Mattermost Webhook endpoint
de: Konfigurieren des Mattermost Webhook-Endpunkts
sr: Подешавање путање Mattermost повратног позива

source: Finally, click on **Submit**.
de: Klicken Sie abschließend auf **Übermitteln**.
sr: На крају кликните на **Пошаљи**.

source: Step 3 - Configuring a Trigger for firing of the Webhook
de: Schritt 3 - Konfigurieren eines Triggers für das Auslösen des Webhooks
sr: Корак 3 – Подешавање окидача за покретање повратног позива

source: As a last step, you need to create a :doc:`Trigger <generic-notifications-trigger>` for posting a notification to the Mattermost channel under certain conditions.
de: Als letzten Schritt müssen Sie einen :doc:`Trigger <generic-notifications-trigger>` erstellen, um unter bestimmten Bedingungen eine Benachrichtigung an den Mattermost-Kanal zu senden.
sr: Као последњи корак, потребно је да направите :doc:`окидач <generic-notifications-trigger>` за постављање обавештења у Mattermost канал под одређеним условима.

source: Once the trigger is in place, your webhook is ready for use!
de: Sobald der Trigger eingerichtet ist, ist Ihr Webhook einsatzbereit!
sr: Када је окидач подешен, ваш повратни позив је спреман за употребу!

source: From now on, whenever a ticket is created or updated in your Zammad system, a suitable notification will be posted in the configured Mattermost Channel. The notification will contain the link to the ticket, updated data and :ref:`content of the last article <mattermost-removing-article-body>`. It will also be :user-docs:`color coded </basics/service-ticket/settings/state.html#state-colors>` according to its latest state.
de: Von nun an wird jedes Mal, wenn ein Ticket in Ihrem Zammad-System erstellt oder aktualisiert wird, eine entsprechende Benachrichtigung in dem konfigurierten Mattermost-Kanal gepostet. Die Benachrichtigung enthält den Link zum Ticket, die aktualisierten Daten und den :ref:`Inhalt des letzten Artikels <mattermost-removing-article-body>`. Außerdem wird sie entsprechend ihrem letzten Status :user-docs:`farblich gekennzeichnet</basics/service-ticket/settings/state.html#state-colors>`.
sr: Од сада, кад год се тикет отвори или освежи у вашем Zammad систему, одговарајуће обавештење ће бити објављено у подешеном Mattermost каналу. Обавештење ће садржати линк до тикета, освежене податке и :ref:`садржај последњег чланка <mattermost-removing-article-body>`. Такође ће бити означен :user-docs:`бојом </basics/service-ticket/settings/state.html#state-colors>` према најновијем стању.

source: Removing Article Content from the Mattermost Notification
de: Entfernen des Artikelinhalts aus der Mattermost-Benachrichtigung
sr: Уклањање садржаја чланка из Mattermost обавештења

source: If you are concerned about leaking sensitive article content via notifications, there is a way to remove them by further customizing the webhook payload.
de: Wenn Sie vermeiden wollen, dass sensible Artikelinhalte über Benachrichtigungen verschickt werden, gibt es eine Möglichkeit, diese zu entfernen. Passen Sie dazu den Webhook-Payload an.
sr: Ако сте забринути због цурења осетљивог садржаја чланка путем обавештења, постоји начин да их уклоните даљим прилагођавањем података повратног позива.

source: Find your webhook in the list on the management screen and click on it to edit it.
de: Suchen Sie Ihren Webhook in der Liste in den Einstellungen und klicken Sie ihn an, um ihn zu bearbeiten.
sr: Пронађите свој повратни позив у листи на екрану за управљање и кликните на њега да бисте га уредили.

source: Switch on **Custom Payload** and the code editor below will be shown, pre-populated with the default payload.
de: Schalten Sie **Eigene Nutzlast** ein, und der nachstehende Code-Editor wird angezeigt, der mit der Standard-Payload-Konfiguration vorausgefüllt ist.
sr: Укључите **Прилагођени подаци** и биће приказан уредник кода испод, унапред попуњен подразумеваним подацима.

source: Next, identify the line starting with ``"text": "...`` block in the JSON structure.
de: Als nächstes identifizieren Sie die Zeile, die mit dem Block ``"text": "...`` in der JSON-Struktur beginnt.
sr: Затим идентификујте ред који почиње са ``"text": "...`` блок у JSON структури.

source: Custom Payload for Mattermost Webhook
de: Benutzerdefinierter Payload für Mattermost Webhook
sr: Прилагођени подациза Mattermost повратни позив

source: Scroll horizontally to the end of the line and select ``\n\n#{notification.body}`` part near the end. Be sure not to include the end double quote with comma (``",``) in the rest of the line, since the new payload must remain a valid JSON value.
de: Scrollen Sie bis zum Ende der Zeile und markieren Sie ``\n\n#{notification.body}``. Achten Sie darauf, das abschließende doppelte Anführungszeichen mit Komma (``",``) nicht in den Rest der Zeile zu übernehmen, da der neue Payload ein gültiger JSON-Wert bleiben muss.
sr: Померите се хоризонтално до краја реда и обележите део ``\n\n#{notification.body}`` при крају. Уверите се да не укључите крајњи двоструки наводник са зарезом (``",``) у остатку реда, пошто нова структура мора остати исправна JSON вредност.

source: Custom Payload with Article Content for Mattermost Webhook
de: Benutzerdefinierter Payload mit Artikelinhalt für Mattermost Webhook
sr: Прилагођени подаци са садржајем чланка за Mattermost повратни позив

source: Then, simply delete the selected code.
de: Löschen Sie dann einfach den ausgewählten Codeblock.
sr: Затим једноставно избришите обележени код.

source: Custom Payload w/o Article Content for Mattermost Webhook
de: Benutzerdefinierter Payload ohne Artikelinhalt für Mattermost Webhook
sr: Прилагођени подаци без садржаја чланка за Mattermost повратни позив

source: Finally, click on **Submit** to save your webhook changes.
de: Klicken Sie abschließend auf **Übermitteln**, um Ihre Webhook-Änderungen zu speichern.
sr: На крају, кликните на **Пошаљи** да бисте сачували измене повратног позива.

source: On the next invocation of the webhook, the notification will not include content of the last article.
de: Bei der nächsten Ausführung des Webhooks wird die Benachrichtigung nicht den Inhalt des letzten Artikels enthalten.
sr: Приликом следећег позивања повратног позива, обавештење неће укључивати садржај последњег чланка.

source: Microsoft Teams Notifications
de: Benachrichtigungen für Microsoft Teams
sr: Microsoft Teams обавештења

source: Microsoft decided to retire `their Office 365 connectors <https://devblogs.microsoft.com/microsoft365dev/retirement-of-office-365-connectors-within-microsoft-teams/>`_. The new way of connecting Microsoft Teams with third-party tools is via `Workflows in Teams <https://support.microsoft.com/en-us/office/browse-and-add-workflows-in-microsoft-teams-4998095c-8b72-4b0e-984c-f2ad39e6ba9a>`_.
de: Microsoft hat beschlossen, seine `Office 365-Konnektoren <https://devblogs.microsoft.com/microsoft365dev/retirement-of-office-365-connectors-within-microsoft-teams/>`_ einzustellen. Der neue Weg, Microsoft Teams mit Tools von Drittanbietern zu verbinden, führt über `Workflows in Teams <https://support.microsoft.com/de-de/office/durchsuchen-und-hinzuf%C3%BCgen-von-workflows-in-microsoft-teams-4998095c-8b72-4b0e-984c-f2ad39e6ba9a>`_.
sr: Microsoft је одлучио да пензионише `њихове Office 365 конекторе <https://devblogs.microsoft.com/microsoft365dev/retirement-of-office-365-connectors-within-microsoft-teams/>`_. Нов начин повезивања Microsoft Teams са алатима треће стране је преко `Workflows у Teams <https://support.microsoft.com/en-us/office/browse-and-add-workflows-in-microsoft-teams-4998095c-8b72-4b0e-984c-f2ad39e6ba9a>`_.

source: In the transitional period, we decided to keep this guide as is. Make sure to follow Microsoft's guide as a replacement for **step 1** below, to connect Teams and Zammad via Workflows.
de: Für die Übergangszeit haben wir uns entschieden, diese Anleitung so zu belassen, wie sie ist. Stellen Sie sicher, dass Sie die Anleitung von Microsoft als Ersatz für **Schritt 1** unten befolgen, um Teams und Zammad über Workflows zu verbinden.
sr: У међувремену, одлучили смо да задржимо изглед овог водича. Молимо пратите Microsoft упутства као замену за **корак 1** испод, како бисте повезали Teams и Zammad преко Workflows.
