Repository: zammad/zammad-admin-documentation
Catalog: locale/*/LC_MESSAGES/admin-docs.po
Languages: de, sr

source: Now you can link accounts via "Avatar > Profile > Link Accounts" or login via Zammad login page.
de: Jetzt können Sie Konten über "Avatar > Profil > Verknüpfte Konten" verknüpfen oder sich über die Zammad-Login-Seite anmelden.
sr: Сада можете повезати налоге преко „Аватар > Профил > Повезани налози” или се пријавити преко Zammad странице за пријаву.

source: Two-factor Authentication Methods
de: Methoden für Zwei-Faktor-Authentifizierung
sr: Методи двофакторске аутентификације

source: Two-Factor Authentication
de: Zwei-Faktor-Authentifizierung
sr: Двофакторска аутентификација

source: Two-factor authentication (2FA) enhances the security of Zammad accounts by adding an extra layer of verification beyond a password. It requires users to provide two different types of authentication factors, typically something they know (like a password) and something they possess (like a mobile device or a security token), to ensure that only authorized individuals can access the account.
de: Die Zwei-Faktor-Authentifizierung (2FA) erweitert die Sicherheit von Zammad-Konten, indem eine zusätzliche Prüfung neben einem Passwort erforderlich ist. Benutzer müssen über zwei verschiedene Faktoren verfügen, um sicherzustellen, dass Sie berechtigt sind, auf das Konto zuzugreifen. Typischerweise ist das etwas, was die Benutzer wissen (wie ein Passwort) und etwas, das sie besitzen (wie ein Mobilgerät oder ein Security-Token).
sr: Двофакторска аутентикација (2FA) појачава безбедност Zammad налога додавањем додатног нивоа верификације поред лозинке. Захтева од корисника да обезбеде два различита типа фактора аутентификације, обично нешто што знају (попут лозинке) и нешто што поседују (као што је мобилни уређај или безбедносни кључ), како би се осигурало да само овлашћене особе могу да приступе налогу.

source: Enable Recovery Codes
de: Wiederherstellungs-Codes aktivieren
sr: Укључивање шифри за опоравак

source: Recovery codes are one-time use security codes that can be used by the user if they lose access to their other two-factor authentication methods. They cannot be used on their own, they can only be activated if at least one two-factor authentication method is enabled.
de: Wiederherstellungscodes sind einmalig verwendbare Sicherheitscodes, die vom Benutzer verwendet werden können, wenn er den Zugang zu seinen anderen Zwei-Faktor-Authentifizierungsmethoden verliert. Sie können nicht allein verwendet werden, sondern können nur aktiviert werden, wenn mindestens eine Zwei-Faktor-Authentifizierungsmethode aktiviert ist.
sr: Шифре за опоравак су једнократни сигурносни кодови које корисник може користити ако изгуби приступ својим другим методама двофакторске аутентификације. Не могу се користити самостално, могуће их је укључити само ако је укључен још бар један метод двофакторске аутентификације.

source: Enable Recovery Codes Setting
de: Einstellung Wiederherstellungscodes aktivieren
sr: Укључивање подешавања шифри за опоравак

source: Recovery codes can only be used as a backup method. If enabled, they will be automatically generated for the user once they set up their initial two-factor authentication method.
de: Wiederherstellungscodes können nur als Backup-Methode verwendet werden. Wenn sie aktiviert sind, werden sie automatisch für den Benutzer generiert, sobald er seine erste Zwei-Faktor-Authentifizierungsmethode eingerichtet hat.
sr: Шифре за опоравак могу се користити само као резервни метод. Ако су укључене, аутоматски ће се генерисати за корисника када подесе свој почетни метод двофакторске аутентификације.

source: The user will be asked to print out or save the generated recovery codes in a safe place. Once used, a recovery code cannot be reused.
de: Der Benutzer wird aufgefordert, die generierten Wiederherstellungscodes auszudrucken oder an einem sicheren Ort zu speichern. Ein einmal verwendeter Wiederherstellungscode kann nicht wiederverwendet werden.
sr: Од корисника ће бити затражено да одштампа или сачува генерисане шифре за опоравак на безбедном месту. Једном употребљена, шифра за опоравак се не може поново користити.

source: Users will also have an option to regenerate their recovery codes at any time, which invalidates already existing recovery codes and provides them with a list of fresh codes.
de: Die Nutzer haben außerdem die Möglichkeit, ihre Wiederherstellungscodes jederzeit neu zu generieren, wodurch bereits vorhandene Wiederherstellungscodes ungültig werden und sie eine Liste mit neuen Codes erhalten.
sr: Корисници ће такође имати опцију да регенеришу своје шифре за опоравак у било ком тренутку, што поништава већ постојеће и пружа им листу свежих кодова.

source: After you enable this setting, when the user completes a setup of their initial two-factor authentication method, they will be presented with a list of recovery codes and instructed to save them for later use.
de: Nachdem Sie diese Einstellung aktiviert haben, wird dem Benutzer nach Abschluss der Einrichtung seiner Zwei-Faktor-Authentifizierungsmethode eine Liste mit Wiederherstellungscodes angezeigt, die er zur späteren Verwendung speichern kann.
sr: Након што укључите ово подешавање, када корисник заврши поставку свог почетног метода двофакторске аутентификације, биће му представљена листа шифри за опоравак и упутство да их сачува за каснију употребу.

source: Recovery Codes Generation Modal Dialog
de: Dialog zur Erzeugung von Wiederherstellungscodes
sr: Модални дијалог за генерисање шифри за опоравак

source: Enforce the Set Up of the Two-Factor Authentication
de: Einrichtung der Zwei-Faktor-Authentifizierung erzwingen
sr: Захтевање поставке двофакторске аутентификације

source: In case you wish to require your users to set up at least one two-factor authentication method for their account, you can do this by selecting specific user roles the requirement applies to in **Enforced for user roles** setting. Of course you must have at least one two-factor authentication method enabled for this setting to take effect.
de: Wenn Sie von Ihren Benutzern verlangen wollen, dass sie mindestens eine Zwei-Faktor-Authentifizierungsmethode für ihr Konto einrichten, können Sie dies tun, indem Sie in der Einstellung **Für Benutzer-Rollen erzwingen** bestimmte Benutzerrollen auswählen, für die die Anforderung gilt. Natürlich müssen Sie mindestens eine Zwei-Faktor-Authentifizierungsmethode aktiviert haben, damit diese Einstellung wirksam wird.
sr: У случају да желите да од својих корисника захтевате да за свој налог подесе бар један метод двофакторске аутентификације, то можете урадити тако што ћете изабрати одређене корисничке улоге на које се захтев примењује у подешавању **Захтевано за корисничке улоге**. Наравно морате имати укључен најмање један метход двофакторске аутентификације да би ово подешавање ступило на снагу.

source: Enforced for User Roles Setting
de: Verpflichtend für Benutzerrollen
sr: Подешавање захтевано за корисничке улоге

source: After you change this setting, if the user has one of the selected roles on their account, they will be forced to set up the two-factor authentication upon next sign in or application reload.
de: Nachdem Sie diese Einstellung geändert haben, werden Benutzer mit der entsprechenden Rolle gezwungen, die Zwei-Faktor-Authentifizierung bei der nächsten Anmeldung oder beim erneuten Laden der Anwendung einzurichten.
sr: Након што промените ово подешавање, ако корисник има једну од изабраних улога на свом налогу, биће захтевано од њих да поставе двофакторску аутентификацију приликом следећег пријављивања или поновног учитавања апликације.

source: A modal dialog with instructions will be shown, and they will not be able to do any work before they set up at least one two-factor method.
de: Es wird ein Dialogfeld mit Anweisungen angezeigt und sie können erst dann weiter arbeiten, wenn sie mindestens eine Zwei-Faktor-Methode eingerichtet haben.
sr: Биће приказан модални дијалог са упутствима и корисник неће моћи да ради са системом пре него што постави бар један метод двофакторске аутентификације.

source: Modal Dialog for Enforcing Two-Factor Authentication Set Up
de: Dialog zur Erzwingung der Zwei-Faktoren-Authentifizierung
sr: Модални дијалог за захтевање поставке двофакторске аутентификације

source: Reset Two-Factor Authentication for a Specific User
de: Zwei-Faktor-Authentifizierung für bestimmte User zurücksetzen
sr: Поништавање двофакторске аутентификација за конкретног корисника

source: In case an user isn't able to login anymore because of an inaccessible second factor, you can reset the user's 2FA method.
de: Falls sich ein Benutzer aufgrund eine nicht verfügbaren Zwei-Faktor-Methode nicht mehr anmelden kann, können Sie die 2FA-Methode des Benutzers zurücksetzen.
sr: У случају да корисник више није у могућности да се пријави због недоступности другог фактора, можете поништити кориснички метод двофакторске аутентификације.

source: To do this, go to the user management and search for the relevant user. After you found the account, click the button in the action column and select "Manage Two-Factor Authentication":
de: Gehen Sie dazu in die Benutzerverwaltung und suchen Sie nach dem entsprechenden Benutzer. Nachdem Sie das Konto gefunden haben, klicken Sie auf den Button in der Aktionsspalte und wählen Sie "Zwei-Faktor-Authentifizierung verwalten":
sr: Да бисте ово урадили, идите на уређивање корисника и претражите за одговарајућег корисника. Након што пронађете налог, кликните на дугме у колони радње и изаберите „Управљање двофакторском аутентификацијом”:

source: Context menu in action column in user management
de: Kontextmenü in der Aktionsspalte der Benutzerverwaltung
sr: Контекстни мени у колони радње у екрану уређивања корисника

source: After selecting this, you can see a dialog where you can either reset one 2FA method or reset all of the user's 2FA methods:
de: Nachdem Sie dies ausgewählt haben, sehen Sie einen Dialog, in dem Sie entweder eine 2FA-Methode oder alle 2FA-Methoden des Benutzers zurücksetzen können:
sr: По одабиру, добићете дијалог где можете поништити или један или све методе двофакторске аутентификације:

source: Dialog for resetting user's 2FA method
de: Dialog zum Zurücksetzen der 2FA-Methode des Benutzers
sr: Дијалог за поништавање корисничких метода двофакторске аутентификације

source: Choose the fitting one, click on the corresponding "Remove ..." button and confirm your action. The user now has to setup a new 2FA method, depending on your 2FA configuration.
de: Wählen Sie die passende aus, klicken Sie auf die entsprechende Schaltfläche "... entfernen" und bestätigen Sie Ihre Aktion. Der Benutzer muss nun abhängig von Ihrer 2FA-Konfiguration eine neue 2FA-Methode einrichten.
sr: Изаберите одговарујућу опцију, кликните на дугме „Уклони” и потврдите своју радњу. Корисник ће сада морати да постави нови метод двофакторске аутентификације, у зависности од ваше конфигурације.

source: Authenticator App
de: Authentifizierungs-App
sr: Апликација за аутентификацију

source: The authenticator app method is a type of two-factor authentication that uses a mobile application to generate one-time codes for account verification. After setting up the authenticator app on their device, the user links it to their Zammad account.
de: Die Authentifizierungs-App ist eine Methode der Zwei-Faktor-Authentifizierung, bei der eine mobile App ("Authentifizierungs-App") Einmal-Codes generiert, die beim Anmelden geprüft werden. Nachdem die Benutzer eine Authentifizierungs-App auf Ihrem Gerät eingerichtet haben, können diese die App mit ihr Zammad-Konto verknüpfen.
sr: Метод апликације за аутентификацију је врста двофакторске аутентификације која користи мобилну апликацију за генерисање једнократних кодова за верификацију налога. Након подешавања апликације за аутентификацију на свом уређају, корисник је повезује са својим Zammad налогом.

source: When logging in, the user is prompted to enter a time-sensitive code generated by the app, in addition to their password. This code acts as the second factor of authentication, providing an extra layer of security as it changes periodically and is unique to the user's device.
de: Bei der Anmeldung wird der Nutzer aufgefordert, zusätzlich zu seinem Passwort einen von der App generierten zeitabhängigen Code einzugeben. Dieser Code dient als zweiter Authentifizierungsfaktor und bietet eine zusätzliche Sicherheitsebene, da er sich regelmäßig ändert und nur auf dem Gerät des Nutzers vorhanden ist.
sr: Приликом пријављивања, од корисника се тражи да унесе временски осетљив код који генерише апликација, поред своје лозинке. Овај код се примењује као други фактор аутентификације, пружајући додатни ниво заштите пошто се периодично мења и јединствен је за уређај корисника.

source: Security Code in Google Authenticator App
de: Sicherheits-Code in der Google Authenticator App
sr: Сигурносни код у апликацији Google Authenticator

source: The app generates codes based on a shared secret key stored securely on both the user's device and the server, ensuring a synchronized and secure authentication process. The method of generating the codes is sometimes also called TOTP (time-based one-time password).
de: Die App generiert Codes auf der Grundlage eines gemeinsam genutzten geheimen Schlüssels, der sowohl auf dem Gerät des Nutzers als auch auf dem Server sicher gespeichert ist, wodurch ein synchronisierter und sicherer Authentifizierungsprozess gewährleistet wird. Die Methode zur Generierung der Codes wird manchmal auch als TOTP (time-based one-time password) bezeichnet.
sr: Апликација генерише кодове на основу дељеног тајног кључа који је безбедно ускладиштен и на корисниковом уређају и на серверу, обезбеђујући синхронизован и сигуран процес аутентификације. Метода генерисања кодова се понекад назива и TOTP (једнократна лозинка заснована на времену).

source: Enabling the Authenticator App Method
de: Aktivieren der Authenticator App-Methode
sr: Укључивање метода апликације за аутентификацију

source: To enable the method, just toggle the switch on in the settings.
de: Um die Methode zu aktivieren, schalten Sie sie einfach in den Einstellungen ein, indem Sie den Schalter aktivieren.
sr: Да бисте укључили метод, само притисните прекидач у подешавањима.

source: Authenticator App Switch in Settings
de: Authenticator App Schalter in den Einstellungen
sr: Прекидач апликације за аутентификацију у подешавањима

source: Now the users will be able to set up this two-factor authentication method for their accounts via "Avatar -> Profile -> Password & Authentication". Once they do, on next sign-in with password, they will be asked to provide an additional security code generated by their mobile device.
de: Jetzt können die Nutzer diese Zwei-Faktor-Authentifizierungsmethode für ihre Konten über "Avatar > Profil > Passwort & Authentifizierung" einrichten. Sobald sie dies getan haben, werden sie bei der nächsten Anmeldung mit Passwort aufgefordert, einen zusätzlichen Sicherheitscode einzugeben, der von ihrem Mobilgerät generiert wird.
sr: Сада ће корисници моћи да подесе овај метод двофакторске аутентификације за своје налоге преко „Аватар -> Профил -> Лозинка и аутентификација". Када то ураде, приликом следећег пријављивања путем лозинке, од њих ће се тражити да приложе и додатни безбедносни код који генерише њихов мобилни уређај.

source: Security Keys
de: Sicherheits-Schlüssel
sr: Безбедносни кључеви

source: The security keys method is a type of a two-factor authentication that uses Web Authentication API in the browser for verifying user's identity. The user can register multiple hardware or software security keys with their Zammad account and then they can use it during the sign-in process.
de: Die Sicherheitsschlüssel-Methode ist eine Art der Zwei-Faktor-Authentifizierung, die die Web-Authentifizierungs-API im Browser zur Überprüfung der Identität des Benutzers verwendet. Der Benutzer kann mehrere Hardware- oder Softwareschlüssel mit seinem Zammad-Konto registrieren und diese dann während des Anmeldevorgangs verwenden.
sr: Метод безбедносних кључева је врста двофакторске аутентификације која користи Web Authentication API у претраживачу за верификацију идентитета корисника. Корисник може да региструје више хардверских или софтверских безбедносних кључева са својим Zammad налогом, а затим га може користити током процеса пријављивања.

source: When logging in, the user is prompted to provide the same security key they registered with their account, in addition to their password. This key acts as the second factor of authentication, providing an extra layer of security.
de: Bei der Anmeldung wird der Benutzer aufgefordert, zusätzlich zu seinem Passwort den hinterlegten Sicherheitsschlüssel anzugeben, den er für sein Konto registriert hat. Dieser Schlüssel dient als zweiter Authentifizierungsfaktor und bietet eine zusätzliche Sicherheitsebene.
sr: Приликом пријављивања, од корисника се тражи да приложи исти сигурносни кључ који је регистровао са својим налогом, поред своје лозинке. Овај кључ се примењује као други фактор аутентификације, пружајући додатни ниво безбедности.

source: Security Key dialog in Safari on macOS
de: Sicherheitsschlüssel-Dialog in Safari unter macOS
sr: Дијалог за поставку безбедносног кључа у Safari претраживачу на macOS-у

source: The type of the key can range from hardware USB sticks to passkeys stored in a device of user's choice. Which type can be used depends on the browser flavor and the platform of the user.
de: Die Art des Schlüssels kann von Hardware-USB-Sticks bis zu Passkeys reichen, die in einem Gerät der Wahl des Nutzers gespeichert sind. Welcher Typ verwendet werden kann, hängt von der Browser-Variante und der Plattform des Nutzers ab.
sr: Тип кључа може се креће од хардверских USB флешева до приступних кључева ускладиштених у уређају по избору корисника. Који тип се може користити зависи од врсте претраживача и платформе корисника.

source: Enabling the Security Keys Method
de: Aktivieren der Sicherheitsschlüssel-Methode
sr: Укључивање метода безбедносних кључева

source: Security Keys Switch in Settings
de: Schalter für Sicherheitsschlüssel in den Einstellungen
sr: Прекидач безбедносних кључева у подешавањима

source: Now the users will be able to set up this two-factor authentication method for their accounts via "Avatar -> Profile -> Password & Authentication". Once they do, on next sign-in with password, they will be asked to provide the same security key they registered during the setup.
de: Jetzt können die Nutzer diese Zwei-Faktor-Authentifizierungsmethode für ihre Konten über "Avatar > Profil > Passwort & Authentifizierung" einrichten. Sobald sie dies getan haben, werden sie bei der nächsten Anmeldung mit Passwort aufgefordert, den Sicherheitsschlüssel bereitzustellen, den sie in ihrem Konto hinterlegt haben.
sr: Сада ће корисници моћи да подесе овај метод двофакторске аутентификације за своје налоге преко „Аватар -> Профил -> Лозинка и аутентификација". Када то ураде, приликом следећег пријављивања путем лозинке, од њих ће се тражити да приложе исти безбедносни кључ који су регистровали прликом поставке.

source: **Only relevant for on-premise users.**
de: **Nur relevant für on-premise Nutzer.**

source: As a SaaS customer of Zammad, you don't have access to these settings. We're handling these for you to ensure service stability.
de: Als SaaS-Kunde von Zammad haben Sie keinen Zugriff auf diese Einstellungen. Wir übernehmen diese für Sie, um die Stabilität des Dienstes zu gewährleisten.

source: The URL of your Zammad installation.
de: Die URL Ihrer Zammad-Installation.
sr: URL ваше инсталације Zammad-а.

source: This setting is used within :doc:`/misc/variables` and notifications.
de: Diese Einstellung wird in :doc:`/misc/variables` und Benachrichtigungen verwendet.
sr: Ово подешавање се користи у оквиру :doc:`/misc/variables` и обавештења.

source: It is automatically set by the *Getting Started wizard*.
de: Diese Einstellung wird automatisch durch den *Einrichtungsassistenten* festgelegt.
sr: Аутоматски се поставља приликом *почетне поставке система*.

source: Changing this setting also changes callback URLs for your channels etc.
de: Durch die Änderung dieser Einstellung werden auch die Callback-URLs für Ihre Kanäle usw. geändert.
sr: Промена овог подешавања такође мења URL адресе за повратне позиве ваших канала итд.

source: This setting can have negative affects on being able to login.
de: Diese Einstellung kann zu Schwierigkeiten bei der Anmeldung führen.
sr: Ово подешавање може негативно утицати на могућност пријављивања.

source: HTTP type
de: HTTP-Typ
sr: HTTP протокол

source: The HTTP type tells if your installation is accessible with transport layer security (``https``) or not (``http``).
de: Der HTTP-Typ gibt an, ob Ihre Installation mit Transport Layer Security (``https``) zugänglich ist oder nicht (``http``).

source: This ID is being used within your ticket number. In case you're communicating with another ticket system with similar ticket number schemes this ID greatly reduces the risk of false follow ups.
de: Diese ID wird in Ihrer Ticketnummer verwendet. Für den Fall, dass Sie mit einem anderen Ticketsystem mit ähnlichen Nummernschema kommunizieren, verringert diese ID das Risiko falscher Zuordnungen erheblich.
sr: Овај ID се користи у оквиру броја вашег тикета. У случају да комуницирате са другим системом тикета са сличним шемама броја тикета, овај ID у великој мери смањује ризик од лажних наставака.

source: The SystemID is randomly selected upon installation of Zammad (``1-99``).
de: Die SystemID wird bei der Installation von Zammad zufällig gesetzt (``1-99``).
sr: SystemID се насумично бира приликом инсталације Zammad-а (``1-99``).

source: **Do not** change this setting in a productive system! Your Zammad installation may no longer recognize old ticket number based follow ups upon change!
de: **Ändern Sie diese Einstellung nicht** in einem produktiven System! Ihre Zammad-Installation erkennt bei einer Änderung möglicherweise auf alten Ticketnummern basierende Rückfragen nicht mehr!
sr: **Не** мењајте ово подешавање на систему у продукцији! Ваша Zammad инсталација можда више неће препознати старе наставке на основу броја тикета након измене!

source: Core Workflow Ajax Mode
de: Core Workflow Ajax Modus
sr: Ajax режим радног тока

source: This setting allows administrators to enforce :doc:`/system/core-workflows` to use Ajax-Calls instead of web sockets. You'll usually only need this if you experience serious issues as noted below.
de: Mit dieser Einstellung können Administratoren erzwingen, dass :doc:`/system/core-workflows` Ajax-Aufrufe anstelle von Web-Sockets verwendet werden. Dies ist in der Regel nur dann erforderlich, wenn schwerwiegende Probleme auftreten (siehe unten).
sr: Ово подешавање омогућава администраторима да наметну :doc:`радним токовима </system/core-workflows>` да користе Ajax позиве уместо web socket-а. Ово ће вам бити неопходно само ако имате озбиљне проблеме као што је наведено у наставку.

source: **🤓 Possible (technical) reasons**
de: **🤓 Mögliche (technische) Gründe**
sr: **🤓 Могући (технички) разлози**
